{
    "formatter": "Entity linking is the process of determining the true identity of an entity mentioned in text by linking it to the correct entry in a knowledge base. Given a piece of input text where the mention is marked as follows: #mention#, a mention, and a list of candidates from Wikipedia, your goal is to select the candidate that most accurately represents the given mention based on the contextual information provided in the text. \n    Here is an example:\n     Text: #Amazon# is one of the largest e-commerce platforms in the world, founded by Jeff Bezos.\n        Entity Mention: Amazon \n      Candidates: [\n  \"6891537 - Amazon Prime Video: Amazon Prime Video, or simply Prime Video, is an American subscription video on-demand over-the-top streaming and rental service of Amazon offered both as a stand-alone service and as part of Amazon's Prime subscription. The service primarily distributes films and television series produced or co-produced by Amazon MGM Studios or licensed to Amazon, as Amazon Originals, with the service also hosting content from other providers, content add-ons, live sporting events, and video rental and purchasing services.\", \n \"1701 - Amazon River: The Amazon River (UK: , US: ; Spanish: Río Amazonas, Portuguese: Rio Amazonas) in South America is the largest river by discharge volume of water in the world, and the longest or second-longest river system in the world, a title which is disputed with the Nile. The headwaters of the Apurímac River on Nevado Mismi had been considered for nearly a century the Amazon basin's most distant source until a 2014 study found it to be the headwaters of the Mantaro River on the Cordillera Rumi Cruz in Peru.\", \n \"90451 - Amazon (company): Amazon.com, Inc., doing business as Amazon (, AM-ə-zon; UK also , AM-ə-zən), is an American multinational technology company, engaged in e-commerce, cloud computing, online advertising, digital streaming, and artificial intelligence. It is considered one of the Big Five American technology companies, the other four being Alphabet (parent company of Google), Apple, Meta (parent company of Facebook), and Microsoft.\", \n  \"48139 - Amazon rainforest: The Amazon rainforest, also called Amazon jungle or Amazonia, is a moist broadleaf tropical rainforest in the Amazon biome that covers most of the Amazon basin of South America. This basin encompasses 7,000,000 km2 (2,700,000 sq mi), of which 6,000,000 km2 (2,300,000 sq mi) are covered by the rainforest.\", \n \"5962343 - Amazon S3: Amazon Simple Storage Service (S3) is a service offered by Amazon Web Services (AWS) that provides object storage through a web service interface. Amazon S3 uses the same scalable storage infrastructure that Amazon.com uses to run its e-commerce network.\", \n \"31354610 - Amazon Drive: Amazon Drive, formerly known as Amazon Cloud Drive, was a cloud storage application managed by Amazon. The service offered secure cloud storage, file backup, file sharing, and Photo printing.\", \n \"90451 - .amazon: Amazon.com, Inc., doing business as Amazon (, AM-ə-zon; UK also , AM-ə-zən), is an American multinational technology company, engaged in e-commerce, cloud computing, online advertising, digital streaming, and artificial intelligence. It is considered one of the Big Five American technology companies, the other four being Alphabet (parent company of Google), Apple, Meta (parent company of Facebook), and Microsoft.\"  \n] \n  Correct Answer: 90451\n      Now it is time to perform entity linking with the following inputs:\n        Text: {text}\n        Entity Mention: {mention}\n        Candidates: {candidates}\n        Answer only with the candidate number that you think is the correct answer. Answer with 'None of the candidates' if none of the candidates can be selected. Please do not include any additional information or explanation in your answer.",
    "input variables": [
        "text",
        "mention",
        "candidates"
    ]
}