[
    {
        "url": "https://en.wikipedia.org/wiki/2005_Birmingham_tornado"
    },
    {
        "heading": "2005 Birmingham tornado",
        "table": [
            [
                "Meteorological history"
            ],
            [
                "Date",
                "July 28, 2005"
            ],
            [
                "Formed",
                "14:37BST(UTC+01:00)"
            ],
            [
                "Duration",
                "20 minutes"
            ],
            [
                "IF3 tornado"
            ],
            [
                "on theInternational Fujita scale"
            ],
            [
                "Highest winds",
                "144–216 mph (232–348 km/h)"
            ],
            [
                "Overall effects"
            ],
            [
                "Fatalities",
                "0"
            ],
            [
                "Injuries",
                "39"
            ],
            [
                "Damage",
                "£40 million (2005)"
            ],
            [
                "Areas affected",
                "Birmingham,United Kingdom"
            ]
        ]
    },
    {
        "heading": "2005 Birmingham tornado",
        "paragraphs": [
            "The2005 Birmingham tornadowas an IF3tornadowhich became the costliest tornado ever recorded inGreat Britain. The tornado occurred on 28 July 2005 in the Southern and Eastern suburbs ofBirmingham. It formed on a day when thunderstorms were expected to develop across the Midlands and eastern England. The tornado touched down at approximately 14:37BSTin the King’s Heath area and moved north-northeasterly, affectingKing's Heath,Moseley,Sparkhill,Balsall Heath,SaltleyandErdingtonas it carved a roughly 7 mi (11 km) long path through the city.Several organizations have rated this tornadowith various degrees of intensity; most recently theEuropean Severe Storms Laboratoryrated the tornado IF3 on theInternational Fujita scalein December 2024."
        ]
    },
    {
        "heading": "Background",
        "paragraphs": [
            "Previous tornadoes",
            "While England has more reported tornadoes, relative to its land area, than any other country, the vast majority are weak. According to theMet Office, around 30 tornadoes hit the UK every year, though most are small and dissipate without causing significant damage. ",
            "Several tornadoes have struck the city of Birmingham. AnF3 tornadostruck the city in 1931, killing one woman and severely damaging hundreds of houses. On 23 November 1981, during a record-breakingnationwide tornado outbreak, three tornadoes touched down within the Birmingham city limits – inErdington, King’s Heath, andSelly Oak– with three other tornadoes touching down within the boundaries of the widerWest Midlandscounty. Notable tornadoes also struck the city in 1946, 1968, and 1999.",
            "Meteorological synopsis",
            "On the morning of July 28, a shallow depression was located southwest ofCornwall, with a slow-movingwarm frontextending across the Midlands and acold frontadvancing from the southwest. Early cloud cover gave way to breaks in the afternoon, allowing surface heating to destabilize the atmosphere. This heating, combined with anelevated mixed layerof dry air advected from Spain, created conditions favorable for intense convection. ",
            "Key to the tornado formation was the development of a triple point, where the synoptic cold front intersected an insolation-enhanced warm front, a boundary strengthened by solar heating. This intersection enhanced low-level convergence and vorticity, providing the necessary lift for thunderstorm development. The environment featured moderate instability (1000–1600 J/kg ofCAPE) and extreme wind shear, particularly in the lowest 1–3 km of the atmosphere, where directional shear promoted rotating updrafts.",
            "Initial storm development began by 13:45 GMT, and the storms exhibitedsupercellularcharacteristics, with one nearPeterboroughsplitting into distinct left and right-moving cells. The Birmingham cell subsequently developed at around 13:45 GMT. "
        ]
    },
    {
        "heading": "Effects and damage",
        "paragraphs": [
            "At 2:29 PM BST, a funnel cloud was photographed from the Hopwood Park Service area on the M42 motorway, 8.5 miles south of Birmingham. TORRO concluded this to be a separate, T2 tornado. By around 2:37PM, the main tornado began in Howard Road, Kings Heath. Initially crossing the High Street, the tornado inflicted roof damage to several buildings, including a roof torn off and thrown across the road. A woman was taken to hospital after being struck by flying debris.",
            "Continuing northeastward into Wake Green and Moseley, the tornado began causing more significant damage to trees and homes. Several streets including Blenheim Rd were completely blocked by fallen trees.",
            "Reaching Balsall Heath, the tornado attained peak IF3 intensity: several shops had their windows blown out and lost portions of their roofs. Several rows of terraced homes along Birchwood Road and Alder Road in Balsall Heath had their roofs torn off, and several sustained exterior wall damage to the upper floors. Cars were rolled several metres down driveways, and trees were flattened in Balsall Heath park.",
            "Continuing northwards across Stratford Road,Ladypool Primary Schoolwas extensively damaged and lost its distinctiveMartin & Chamberlaintower. The adjacentSt Agatha's Churchalso suffered some damage.Christ Church(consecrated in 1867), on the corner of Dolobran Road and Grantham Road in Sparkbrook, was also damaged and has now been demolished.  ",
            "Farm Park, Sparkhill suffered severe damage, shortly before the approached Coventry Road where it significantly damaged a Wedding Hall and several homes.",
            "At this point, the tornado was weakening as it continued northwards pastSt Andrew’s Stadium. A brick wall was blown down at Saltley Viaduct, and minor tree damage was noted along Heartlands Parkway at the intersection with Cuckoo Road.",
            "The tornado crossed theM6 Motorwayjust east of the Gravelly Hill interchange. TV Aerial damage is found in The Oval, Erdington, as well as minor roof damage. The final instance of damage came from Erdington Abbey, where trees suffered minor branch damage. "
        ]
    },
    {
        "heading": "Aftermath",
        "paragraphs": [
            "Immediately following the tornado, more than 50 ambulance, and 10 fire crews were deployed to the scene, along with sniffer dogs, and West Midlands Fire Service declared a major incident. Over a dozen people were taken to hospital for treatment, 39 were injured, several severely. Then-Birmingham council leader, Paul Tillesley, remarked that it was a “miracle” that no fatalities occurred. ",
            "Hundreds of residents were evacuated from significantly damaged areas, particularly Balsall Heath, while emergency services searched over 1000 properties. Overall, more than 500 buildings were damaged, including 115 businesses, Ladypool Primary School, churches, and hundreds of houses- several were subsequently marked for demolition. ",
            "Birmingham City Council provided emergency accommodation for over 160 people following the tornado, and granted a £1 million recovery fund.  The tornado is the costliest on record in the UK, having caused £40 million of damage, equivalent to £75 million in 2023. "
        ]
    },
    {
        "heading": "Rating",
        "paragraphs": [
            "In August 2006,Timothy P. Marshalland Stuart Robinson with the Haag Engineering Co, rated the tornado EF2 on a draft version of the-then unpublishedEnhanced Fujita scale, marking one of the first tornadoes to receive an EF-scale rating. In July 2015, the tornado was rated T5–6 on theTORRO scaleby theTornado and Storm Research Organisationbased on the United Kingdom. TheEuropean Severe Storms Laboratoryrated the tornado F2, on theFujita scaleand T4 on the TORRO scale. However, in December 2024, this rating was amended to IF3 on the newInternational Fujita scale. "
        ]
    },
    {
        "heading": "Second tornado in October",
        "paragraphs": [
            "Three months later, on 12 October 2005, an IF2 tornado caused damage to roofs in Dovey Road,Moseley, less than a mile from the path of the 28 July tornado.  "
        ]
    },
    {
        "heading": "External links",
        "table": [
            {
                "vteWeather events in theUnited Kingdom": "Climate of the United Kingdomclimate changeDrought in the United KingdomUnited Kingdom weather records"
            },
            [
                "Avalanches",
                "Lewes 1836Buachaille Etive Mòr 2009"
            ],
            [
                "Cold snaps",
                "1683–8417091894–951946–471962–631981–821985–8619871990–91October 20082009–102010–11February 2012Spring 2013February–March 2018December 2022"
            ],
            [
                "Snow events",
                "January 1881March 1891April 1981January 1995February 2009March 2013March 2018 (Emma)March 2023 (Larisa)"
            ],
            [
                "Flash floods",
                "Louth 1920Lynmouth 1952Chew Stoke 1968Glasgow 2002Boscastle 2004Morpeth 2008Yorkshire Dales 2019London 2021"
            ],
            [
                "Floods",
                "Bristol Channel 16071Trent 1683Holmfirth 1738, 1777, 1944North East England 1771Strathspey 1829Thames 1928Thames 1947South England 1968Autumn 2000Summer 2007August 2008November–December 2009Workington 20092012–13Winter 2013–14Somerset Levels 2013–14Winter 2015–16June 2016Winter 2019–20Yorkshire Dales 2019Summer 2022202320242025"
            ],
            [
                "Storm surges",
                "South England 1287North Sea 1287Thames 1928North Sea 1953North Sea 1976North Sea 1978North Sea 2007North Sea and Irish Sea 2013"
            ],
            [
                "Thunderstorms",
                "Widecombe-in-the-Moor 1638July 1968"
            ],
            [
                "Tornadoes",
                "London 1091Great Malvern 1761October 1913November 1981Birmingham 2005London 2006October 2022"
            ],
            [
                "Windstormsandformerhurricanes",
                "December 1703November 1824January 1839August 1848October 1859February 1871December 1879October 1881February 1903September 1961 (Debbie)February 1962January 1968January 1976August 1986 (Charley)October 1987January 1990October 1996 (Lili)December 1998January 2007September 2011 (Katia)December 2011January 2012October 2013December 2013Christmas 2013January 2014February 2014October 2014 (Gonzalo)November 2015 (Abigail)December 2015 (Desmond)December 2015 (Eva)October 2017 (Ophelia)January 2018 (Eleanor)October 2019 (Lorenzo)February 2020 (Ciara)February 2020 (Dennis)September 2020 (Alex)December 2021 (Barra)February 2022 (Eunice)October 2023 (Babet)November 2023 (Ciarán)December 2024 (Darragh)January 2025 (Éowyn)"
            ],
            [
                "Windstorm seasons",
                "2015–162016–172017–182018–192019–202020–212021–222022–232023–242024–25"
            ],
            [
                "HeatwavesDroughts",
                "175718081906191119551976199019952003200620132018201920212022"
            ],
            [
                "Wildfires",
                "Summer 2018February–May 2019Wareham 2020April–August 2022Wennington 2022Cannich 2023March–May 2025"
            ],
            [
                "Other",
                "Great Smog 1952Great Stink 1858"
            ],
            {
                "vteWeather events in theUnited Kingdom": "1Disputedtsunami"
            }
        ]
    },
    {
        "heading": "External links",
        "table": [
            {
                "vteTornado outbreaks of 2005": "January 13–14March 21–22April 5–7July 6–8(Hurricane Cindy)July 28August 18August 19August 29–31(Hurricane Katrina)"
            },
            {
                "vteTornado outbreaks of 2005": "September 24–26(Hurricane Rita)October 23–24(Hurricane Wilma)November 6November 12–13November 15November 27–28"
            }
        ]
    }
]