[
    {
        "url": "https://en.wikipedia.org/wiki/2022%E2%80%93present_Ukrainian_refugee_crisis"
    },
    {
        "heading": "Ukrainian refugee crisis",
        "table": [
            [
                "A young Ukrainian refugee atPrzemyśltrain station in Poland"
            ],
            [
                "Date",
                "February 2022–present"
            ],
            [
                "Location",
                "UkraineCentral and Eastern Europe"
            ]
        ]
    },
    {
        "heading": "Ukrainian refugee crisis",
        "table": [
            {
                "vteRusso-Ukrainian War(outline)": "BackgroundDissolution of the Soviet UnionRussia–Ukraine relationsBudapest Memorandum2003 Tuzla Island conflictOrange Revolution2007 Munich speech of Vladimir PutinRussia–Ukraine gas disputesEuromaidanRevolution of Dignity2014 pro-Russian unrest in Ukraine(Odesa clashes)Major topics2018 Moscow–Constantinople schismInformation warcyberwarfareransomwarecyberattacksBelarusian involvementInternational sanctionsMedia portrayalForeign aid (militaryhumanitarian)Crimean crisis(Timeline)Little green menKrymnashCrimean ParliamentBelbek AirportSouthern Naval Base2014 Simferopol2014 Russian protestsWar in Donbas(Timeline)Capture of DonetskSlovianskKramatorskArtemivsk1st MariupolSievierodonetskIl-76 shootdownZelenopillia rocket attackKarlivka1st Donetsk AirportLuhansk Border BaseKrasnyi LymanSector D clashesRaid of the 95th BrigadeShakhtarsk RaionHorlivkaYasynuvataIlovaiskNovoazovsk2nd Mariupol2nd Donetsk AirportDebaltseveInternational recognitionPost-Minsk II conflict2015Shyrokyne (2015)Marinka (2015)2016Svitlodarsk (2016)2017Avdiivka (2017)2018Kerch Strait incident (2018)2019202020212022Attacks on civiliansSlovianskMalaysia Airlines Flight 17NovosvitlivkaVolnovakhaDonetskMariupolKramatorskStanytsia LuhanskaRussian invasion of Ukraine (2022–present)(Timeline)Prelude to invasion(Reactions)Military engagementsNorthern Ukraine campaignAntonov AirportKyivChernihivSumyEastern Ukraine campaignMariupol1st KharkivIzium2nd KharkivDonbasSievierodonetskLysychanskSoledarBakhmutLuhansk OblastMarinkaAvdiivkaPokrovskSouthern Ukraine campaign1st KhersonMelitopolMykolaivKherson counteroffensive2nd Kherson2023 Ukrainian counteroffensive2024 Kursk offensiveEffects and aftermathEconomic impactPeace negotiationsProtests in occupied UkraineWar crimesGovernment and intergovernmental reactionsNon-government reactionsProtestsRussian protestsICJ caseArrest warrantsRelatedUkrainian resistanceBelarusian and Russian partisan movementZagreb Tu-141 crashRussian mystery firesNord Stream pipeline sabotageSoloti training ground shootingBrovary helicopter crashBlack Sea drone incidentBryansk Oblast military aircraft crashesWagner Group rebellionWagner Group plane crashUkrainian coup attempt"
            }
        ]
    },
    {
        "heading": "Ukrainian refugee crisis",
        "paragraphs": [
            "Post-Minsk II conflict",
            "Attacks on civilians",
            "Related",
            "An ongoingrefugee crisisbegan inEuropein late February 2022 afterRussia's invasion of Ukraine. Over 6 millionrefugeesfleeing Ukraine are recorded across Europe, while an estimated 8 million others had beendisplaced within the countryby late May 2022.[needs update]   Approximately one-quarter ofthe country's total populationhad left their homes in Ukraine by 20 March. 90% of Ukrainian refugees are women and children, while most Ukrainian men between the ages of 18 and 60 are banned from leaving the country. By 24 March, more than half of all children in Ukraine had left their homes, of whom a quarter had left the country.  The invasion caused Europe'slargest refugee crisissinceWorld War II and its aftermath, is the first of its kind in Europe since theYugoslav Warsin the 1990s, as well as the fourth largest refugee crisis in history,  and is the largest refugee crisis of the 21st century, with the highest refugee flight rate globally.  ",
            "The vast majority of refugees initially entered neighbouring countries to the west of Ukraine (Poland,Slovakia,Hungary,Romania, andMoldova). Around 3 million people then moved further west to other European countries.  As of 18 July 2023, according to UNHCR data, the countries in which the largest numbers of Ukrainians had applied for asylum, or other temporary protection, were Poland (1.6 million),Germany(1 million) and theCzech Republic(0.54 million). As of September 2022,Human Rights Watchdocumented that Ukrainian civilians were being forcibly transferred to Russia. TheUN Human Rights Officestated \"There have been credible allegations offorced transfers of unaccompanied children to Russian occupied territory, or to the Russian Federation itself.\"  TheUnited States Department of Stateestimated that at least 900,000 Ukrainian citizens have been forcibly relocated to Russia. More than 4.5 million Ukrainians have returned to Ukraine since the beginning of the invasion.  ",
            "European Union(EU) countries bordering Ukraine have allowed entry to all Ukrainian refugees, and the EU has invoked theTemporary Protection Directivewhich grants Ukrainians the right to stay, work, and study in any European Union member state for an initial period of one year. Some non-European andRomani peoplehave reported ethnic discrimination at the border."
        ]
    },
    {
        "heading": "Refugees before the 2022 invasion",
        "paragraphs": [
            "Before the invasion, theannexation of Crimea by the Russian Federationand thewar in the Donbas, both of which are aspects of theRusso-Ukrainian War, had already resulted in over two million refugees andinternally displaced personssince 2014.  They have been referred to as Europe's forgotten refugees by some media,  due to their cool reception in the European Union, comparatively low asylum claim success rate, and media neglect.    ",
            "More than a million of the pre-2022 refugees, mainly fromDonbas, had gone to Russia between 2014 and 2016, while the number of people displaced within Ukraine had grown to 1.6 million people by early March 2016. "
        ]
    },
    {
        "heading": "Transportation",
        "paragraphs": [
            "For many refugees heading westward, trains played a vital role in the journey within Ukraine and into neighboring countries.Oleksandr Kamyshin, theCEOofUkrainian Railways, which operates the majority of train services in Ukraine, estimated that within three weeks of the start of the invasion, the network had transported 2.5 million passengers. He also said at its peak, the network transported 190,000 people a day. ",
            "To ensure trains can travel as safely as possible, the network had to constantly adapt to situations on the ground, such as if tracks are damaged by bombs or if they are no longer under Ukrainian control.  Trains have to move slower because they are often overloaded to fit as many people as possible, as well as minimising the risk of hitting damaged tracks. At night, trains also turn off their lights to reduce the chance of being targeted. ",
            "Railway companies in several European countries, including Austria, Belgium, the Czech Republic, Denmark, Finland, France, Germany, Hungary, Lithuania, the Netherlands, Poland, Romania, Slovakia and Switzerland, allowed Ukrainian refugees to travel by train for free.      ",
            "Other refugees traveled by motor vehicles or on foot. In some border crossings, traffic jams of several kilometres long formed. Air travel was not available in Ukraine as the country closed its airspace to civilian flights on the day of the invasion. "
        ]
    },
    {
        "heading": "Staging grounds and border crossings",
        "paragraphs": [
            "The city ofLvivin the west of Ukraine became a key staging ground for refugees. Up to 100,000 refugees were arriving in the city every day, which prior to the invasion had a population of 700,000. From Lviv, trains transport refugees to border crossing points such asMedyka, Poland andUzhhorod, close to the border with Slovakia and Hungary. From Medyka, most refugees continue toPrzemyśl, Poland, and onward to the rest of Europe. ",
            "Other major border crossings includedSiret, Romania; OcnițaandPalanca, Moldova; Beregsurány, Hungary andVyšné Nemecké, Slovakia. "
        ]
    },
    {
        "heading": "Number of refugees",
        "table": [
            [
                "Country",
                "",
                "Number"
            ],
            [
                "Poland",
                "",
                "1,640,510"
            ],
            [
                "Russia*",
                "",
                "1,212,585"
            ],
            [
                "Germany",
                "",
                "1,125,950"
            ],
            [
                "Czech Republic",
                "",
                "547,670"
            ],
            [
                "United Kingdom",
                "",
                "210,800"
            ],
            [
                "Spain",
                "",
                "186,045"
            ],
            [
                "Bulgaria",
                "",
                "168,570"
            ],
            [
                "Italy",
                "",
                "163,570"
            ],
            [
                "Moldova",
                "",
                "116,615"
            ],
            [
                "Romania",
                "",
                "106,786"
            ],
            [
                "Slovakia",
                "",
                "107,415"
            ],
            [
                "Netherlands",
                "",
                "94,415"
            ],
            [
                "Ireland",
                "",
                "91,330"
            ],
            [
                "Austria",
                "",
                "81,870"
            ],
            [
                "France",
                "",
                "70,570"
            ],
            [
                "Belgium",
                "",
                "70,435"
            ],
            [
                "Switzerland",
                "",
                "65,555"
            ],
            [
                "Estonia",
                "",
                "63,850"
            ],
            [
                "Finland",
                "",
                "61,060"
            ],
            [
                "Portugal",
                "",
                "56,995"
            ],
            [
                "Lithuania",
                "",
                "48,425"
            ],
            [
                "Sweden",
                "",
                "56,165"
            ],
            [
                "Norway",
                "",
                "56,970"
            ],
            [
                "Latvia",
                "",
                "43,592"
            ],
            [
                "Turkey",
                "",
                "41,390"
            ],
            [
                "Denmark",
                "",
                "41,155"
            ],
            [
                "Montenegro",
                "",
                "37,050"
            ],
            [
                "Belarus",
                "",
                "37,000"
            ],
            [
                "Hungary",
                "",
                "33,316"
            ],
            [
                "Georgia",
                "",
                "27,000"
            ],
            [
                "Greece",
                "",
                "25,050"
            ],
            [
                "Croatia",
                "",
                "23,035"
            ],
            [
                "Cyprus",
                "",
                "18,225"
            ],
            [
                "North Macedonia",
                "",
                "17,315"
            ],
            [
                "Slovenia",
                "",
                "10,140"
            ],
            [
                "Luxembourg",
                "",
                "6,065"
            ],
            {
                "Number of Ukrainian refugees in each country in July 2023(only countries with more than 10,000 refugees) *": "*U.N. High Commissioner for Refugeesfigures[56]"
            }
        ]
    },
    {
        "heading": "Number of refugees",
        "paragraphs": [
            "* Note: Numbers for Russia include Ukrainians recorded for all forms of stay in 2022, as well as 64,500 granted refugee or temporary asylum status. Figures for other countries are refugees registered for protection in each country or, if this figure is not available, refugees registered as living in that country.",
            "Numbers of refugees can change quickly and are often only estimates. Movements from country to country are not necessarily registered officially. Ukrainians are allowed to travel to some countries in Europe without a visa and may be allowed to stay in the country for a longer period, without special permission. Elsewhere, they have toapply for asylum. Due to theSchengen arrangements, having entered any Schengen country, refugees can travel on to other Schengen countries without any visas or border checks.",
            "TheUnited Nations Office for the Coordination of Humanitarian Affairsestimated on 27 February 2022 that in two months there would be 7.5 millioninternally displaced peoplein Ukraine, 12 million people would be in need of healthcare and the number of people fleeing the war could reach 4 million. TheUnited Nations High Commissioner for Refugees(UNHCR) stated that the situation was Europe's fastest growing refugee crisis since the Second World War. By early November, according to the UNHCR, the number of Ukrainian refugees recorded across Europe was around 7.8 million. The countries receiving the largest numbers of refugees were Russia (2.9 million), Poland (1.5 million), Germany (1 million) and the Czech Republic (0.4 million). ",
            "The communications chief of theUN High Commission for Human Rightscalled the speed of the exodus of refugees from Ukraine \"phenomenal\". ",
            "A study by the UN agencyInternational Organization for Migrationreleased on 21 March 2022 found that 13.5% of displaced people had also been displaced in 2014–2015. The study found that 60% of refugee households were traveling with children, and of the nearly 10 million people displaced within and outside Ukraine on that date, 186,000 were nationals of a third country. "
        ]
    },
    {
        "heading": "Neighbouring countries",
        "paragraphs": [
            "Neighbouring countries are listed in order of the number of refugees who have entered them; others are listed alphabetically.",
            "As early as 15 February, Poland was expecting a possible Russian attack on Ukraine. ThePolish governmentasked communities to prepare for up to a million refugees. By 25 July, more than 1.2 million Ukrainian refugees had been recorded in Poland. Poland greatly reduced the usual border formalities and said that various identity documents would be accepted. ",
            "Assembly points for refugees have opened in every district of Poland. Local authorities are providing free accommodation, food, and other necessary supplies. Apart from that, a huge number of citizens and organisations are voluntarily offering assistance, free accommodation and other help.   Websites with information for refugees are also in Ukrainian.  The government is preparing legal changes that would simplify the employment of Ukrainians in Poland, since currently a working visa is required as Ukrainians are from outside of the EU. ",
            "President of the European CouncilCharles Michelvisited the Polish-Ukrainian border crossing on 2 March and praised Polish efforts \"to guarantee safe passages for Ukrainians, for European citizens\" and those from other countries \"without any discrimination.\" In a later interview forFrance Interhe denounced alleged claims of racism of Ukrainian and Polish serviceman as \"Russian propaganda\" and part of Russia'sinformation warfare. (See also§ Racial discrimination.) Many observers believe that most are likely to stay in Poland and otherCentral Europeancountries because \"tight labor markets, affordable cities and a pre-existing diaspora have made those countries more appealing alternatives for Ukrainians, who find options slimmer in Europe's west\". ",
            "The number of refugees arriving to Poland have been unparalleled in Europe. Modelling estimates show that by 1 April, Ukrainian people (including refugees but also those previously living in Poland) made up between 15% and 30% of the population of each of the major Polish cities. For example, Ukrainians accounted for 10% of the total population ofWrocławbefore the war and this figure had increased to 23% by April 2022. ",
            "Poland has taken in almost 1.5 million Ukrainian refugees. The migration has resulted in a 50% rise in the population ofRzeszów, the largest city in south-eastern Poland.Warsaw's population has increased by 15%,Kraków's by 23%, andGdańsk's by 34%.    Ukrainian refugees have the legal right to reside and work across the European Union. They are also entitled to the same benefits as Poles, including health insurance, free public education, and child allowance.   ",
            "Less than a month after the invasion, the Polish government established the Aid Fund, run byBank Gospodarstwa Krajowego, which funds all actions and programs aimed at assisting and integrating Ukrainian refugees.   TheEuropean Investment Bankhas made a €600 million loan to the Aid Fund, after authorizing an initial €2 billion loan in June. The fund is distributed byBank Gospodarstwa Krajowego(BGK) to local governments and other public bodies that welcome and house Ukrainian migrants.  ",
            "As of 27 May, theRomanian governmenthad reported 989,357 Ukrainians entering Romania. Romanian Defence MinisterVasile Dîncuannounced on 22 February that Romania could receive 500,000 refugees if necessary; the first refugees arrived two days later. On 15 March, Minister of Foreign AffairsBogdan Aurescureported that about 80,000 remained in the country. ",
            "Someethnic Romaniansare among the Ukrainians who have fled to Romania. ",
            "According to the Ukrainian authorities, Russian troops in the territories of Ukraine occupied by Russia are engaged in the forcible deportation of people from Ukraine to Russia, passing them off as refugees. According to theRussian governmentfigures, 971,417 refugees had gone to Russia by 26 May. In March, the Ukrainian foreign ministry alleged that 2,389 Ukrainian children had been abducted from Russian-occupied territory in Donetsk and Luhansk, and transferred to Russia, as well as \"several thousand\" residents of Mariupol. Near the end of April it was reported that Ukrainian officials believed the number of Ukrainian children forced from eastern Ukraine and entered into the Russian adoption system totalled around 150,000. It had been previously reported by Russian media on that children without parents in Donetsk were being placed with Russian parents through their adoption network.  ",
            "Amnesty Internationalreported that \"The abusive and humiliating process known as 'filtration' is a shocking violation of international human rights and humanitarian law. Our research shows that many displaced Ukrainians end up inside Russia or Russia-occupied territories involuntarily, even if they are not physically forced to move. Deportation and forcible transfer of civilians in occupied territory are prohibited by international humanitarian law and can constitute war crimes or crimes against humanity.\" ",
            "From the start of the Russian invasion up to 26 July, 1,041,762 refugees from Ukraine had arrived in Hungary. As there are no border checks within the Schengen area, Hungary does not know how many people have moved to other Schengen countries. 500 people from third-party countries arrived by train in Budapest and asked the police for help; these were mostly students or migrant workers from Asia and Africa who had been living in Ukraine. ",
            "On 21 August 2024 a law came into force in Hungary, restricting support to those Ukrainian refugees who have come from one of currently 13 regions in Ukraine which are, directly affected by military action. Those from the listed regions remain eligible for state support, which includes free housing and a basic monthly sum. Based on UN refugee agencies estimates, some 2,000 to 3,000 people will lose access to subsidised accommodation and will find it difficult to secure alternative  properties to rent. Human rights groups said the worst affected areRomafrom the Transcarpathian region, who are living in shelters which will now close. ",
            "Moldova was among the first countries to receive refugees from theOdesaandVinnytsiaregions. Moldovan authorities have activated a centre for crisis management to facilitate accommodation and humanitarian relief for refugees. As of 26 July, 549,333 Ukrainian refugees had entered Moldova. Prime Minister of MoldovaNatalia Gavrilițasaid on 5 April that 100,000 refugees are staying in Moldova, with almost half of them being children. On 11 April, the UN said that Moldova was \"hosting an estimated 95,000 Ukrainians.\" According toMédecins Sans Frontières, the majority of refugees who do not stay continue on to Romania, Poland or other European countries. ",
            "Moldova received the highest number of refugees per capita of any country despite being one of Europe's poorest countries. According toMiddle East Eye, this has led to social tensions, and international aid was deemed crucial to help Moldovan institutions handle the influx of refugees. On 22 March, theFinancial Timesestimated that 4% of the Moldovan population were currently refugees, and reported that the government of Moldova had requested financial aid to cope with the emergency. At a conference in Berlin on 5 April, Germany and several partners, including France, Romania and the European Union, agreed to provide €659.5 million in aid to Moldova. ",
            "Moldova has a critical view of Russia's invasion, due toits own internal conflictwith Russian-backedTransnistria. The government of Moldova is providing free bus rides, and Romania has assisted Moldova with moving people onwards into Romania, in order to relieve the pressure in Moldova. On 12 March, Germany agreed to take 2,500 refugees who were in Moldova. On 5 March, Germany announced it will take an additional 12,000 refugees. ",
            "Some Ukrainian refugees have also gone to the unrecognized breakaway state of Transnistria. The state-owned newspaperNovosti Pridnestrovyareported on 4 April that a total of around 27,300 Ukrainian citizens had arrived in Transnistria, of whom 21,000 had applied for temporary residence permits. ",
            "As of 8 March, Slovakia had taken in over 140,000 people.  By 26 July, 627,555 Ukrainian refugees had entered Slovakia. However, most of the refugees continued further west, mainly to the Czech Republic. About 80,000 refugees have settled so far in Slovakia. ",
            "According toBelarusian governmentfigures, 30,092 had gone to Belarus by 29 May. "
        ]
    },
    {
        "heading": "Other European countries",
        "paragraphs": [
            "Ukraine has anAssociation Agreementwith theEuropean Unionand since 2017 Ukrainians withbiometric passportshave had the right to 90 days visa-free stay in the Schengen Area.  Following the invasion of Ukraine, theCommissionhas called upon member states to authorise the entry and stay of those without biometric passports on humanitarian grounds, and member states had done so since the refugees started to arrive across the borders.  ",
            "On 4 March, theCouncil of the EUunanimously agreed to implement theTemporary Protection Directivefor the first time in its history, so that refugees fleeing from Ukraine do not have to go through the standardEuropean Union asylum procedure.  Temporary protection is an emergency mechanism which gives the right to stay in an EU member state for an initial period of one year, which may be extended for up to a maximum of three years. The beneficiaries enjoy harmonised rights across the EU such as residence, access to the labour market and housing, medical assistance, and access to education for children. The Council did not adopt a system of quotas of displaced persons, but left it to the beneficiaries to choose their destination freely. ",
            "TheAustrian Interior MinisterGerhard Karnerfrom theÖVPand the FederalChancellorKarl Nehammerannounced that Austria was willing to take in refugees from Ukraine. All refugees are allowed to stay in the country for 90 days. Of 150,000 Ukrainian refugees having arrived in Austria, about 7,000 have applied for asylum, with most proceeding to other countries. ",
            "Ukraine is the leading country of origin for the refugee caseload in Azerbaijan, with 4,206 out of the country's officially registered 5,771 refugees being Ukrainians according to UNHCR data as of December 2023. ",
            "On 25 February, Belgian State Secretary for Asylum and MigrationSammy Mahdicalled for Europe to coordinate the reception. Two days later, Development MinisterMeryame Kitirannounced that three million euros would be allocated for additional humanitarian aid to Ukraine. By 17 March, 10,000 refugees had registered for temporary protection in Belgium. By 14 April, 30,807 refugees had been registered in Belgium. ",
            "Up to 5 March, roughly 25,000 Ukrainian refugees had arrived in Bulgaria. By 12 March, their number was nearly 70,000. By 28 March, about 125,500. By 16 April, 185,055 Ukrainian citizens had entered Bulgaria, 87,439 remained in the country, of whom approximately 25,000 were children. The chairman of the State Agency for Refugees told the Bulgarian National Radio that as of 24 August, 91,903 Ukrainian refugees remained in Bulgaria, with nearly 40% of them being children. ",
            "From the start of the Russian invasion to 4 September, 21,676 Ukrainian refugees entered Croatia, of whom over 49.9% were women, over 33.5% children and nearly 16.6% men. ",
            "By 9 March, around 3,000 Ukrainian refugees had entered Cyprus since the day after the Russian invasion, the Cypriot interior ministry reported; 19 of these had sought asylum. By April 2022 their number was around 10,000, while by April 2023 it had reached 17,000. According to Eurostat, Cyprus had the highest ratio across EU member states of Ukrainian citizens granted temporary protection for February 2023. In April 2024 the number was 18,500. ",
            "The Czech Republic is providing financial, humanitarian and other types of aid to Ukrainian refugees as well as state accommodation and free education for their children. The Czech Republic had received over 100,000 Ukrainian refugees by 7 March 2022, approximately 200,000 by 10 March 2022, over 270,000 by 17 March 2022, with the number rising to over 300,000 by 23 March 2022 and relatively slower rise afterwards. By 1 April 2023, altogether 504,107 Ukrainian individuals had been granted temporary protection in the country, of whom 325,742 had applied for extension of their refugee status beyond March 2023. 68% of the refugees were of working age, of whom 65% were female and 35% male, 28% were children and 4% elderly. In summer 2022, the country hosted the largest number of Ukrainian refugees per capita of any European country.  ",
            "A network of Regional Centres for Help and Assistance to Ukraine (Krajská asistenční centra pomoci Ukrajině) was created in the regional capitals of the country to help refugees obtain registration, accommodation, health insurance or other assistance.  On 17 March 2022, a law known asLex Ukrajinawas passed byParliamentto make it easier for refugees to obtain residence permits and access healthcare, which was followed by passing four follow-up laws in the following year. ",
            "Also on 17 March 2022, some media, including Associated Press and BBC News, incorrectly reported that theCzech Prime Ministerhad said: \"Czech Republic can no longer accept refugees from Ukraine\".  However, someone had mistranslated his Czech quote: \"We are at the very limit of what we are capable of absorbing without any major problems (...) we must continue in the steps that will allow us to cope with more high numbers\". The BBC later corrected the mistranslation.  ",
            "By 25 March, the Danish authorities had registered around 24,000 Ukrainians as having arrived in Denmark, with roughly half being children. Because of the visa-free rules for Ukrainians and the borders being largely open, with only sporadic controls, the exact number is unknown.  The authorities have projected that the number may eventually surpass 100,000 if the war is drawn out. Ukrainian citizens, their close relatives and non-Ukrainians that already had refugee status in Ukraine can receive a two-year residence permit (with the possibility of extension) without having to first request asylum.  By 1 April, about 30,000 refugees had reached Denmark according to the authorities amid expectations that the number will rise to around 40,000 afterEaster.  ",
            "By 18 March, 25,190 refugees, of whom over a third were children, had arrived in Estonia. Of the total, 6,437 refugees were transiting, leaving 18,753 who planned to stay in Estonia. By 31 March, 25,347 refugees, of whom about 40 percent were children had entered Estonia. Thegovernmentreceived 13,289 applications for temporary protection. ",
            "By 3 July, 49,016 Ukrainian refugees had entered Estonia. ",
            "From the start of the Russian invasion up to 30 March, around 15,000 Ukrainian refugees had entered Finland according to the Finnish Immigration Service. The authorities have estimated that up to 100,000 are likely to arrive in the country. ",
            "On 10 March, the Interior Ministry reported that 7,251 people had arrived in France from Ukraine, 6,967 of whom were Ukrainian nationals. By 16 March, at least 17,000 Ukrainian refugees had entered France, according toFrench interior ministerGérald Darmanin. On 24 March, Prime MinisterJean Castexvisiting the new reception center for Ukrainian refugees in Nice on Thursday, and said that 30,000 Ukrainian refugees had entered France since 25 February. As of 30 March, about 45,000 Ukrainians, mainly women and children, had arrived in France. ",
            "As of 27 April, more than 70,000 refugees were benefiting from the subsidy for asylum seekers (Ada) in France, and by 24 May, more than 85,000 according to the French Office for Immigration and integration. By 29 May this figure was believed to be around 93,000. The number was expected to reach 100,000 during June said prefect Joseph Zimet, As of 4 July, more than 100,000 refugees were benefiting from the subsidy for asylum seekers (Ada) in France. ",
            "A portal called \"Je m'engage pour l'Ukraine\" (I am committed to Ukraine) was launched with state support, aiming to coordinate help from French citizens.  ",
            "The French portal to help Ukrainian citizens who choose France has changed its name \"Pour l'Ukraine\" - \"For Ukraine\" in French.\nFrance is fully in solidarity with the Ukrainians and mobilized to facilitate their reception in France. The \"Pour l'Ukraine\" portal offers all the useful information to support them in their first days in France. It also allows citizens wishing to mobilize alongside them, to access devices near their homes. ",
            "Polls show that 85% of the French public are in favour of helping Ukrainian refugees. ",
            "Georgia suffered similar experiences during theRusso-Georgian Warand Georgians have thus been generous towards the people of Ukrainian refugees.  According to the UN Refugee Agency data, as of January 2023, Georgia officially recorded 25,101 Ukrainian refugees but the full number of unregistered Ukrainians in the country is unknown.",
            "Georgia has also opened facilities in several cities for Ukrainian children so they could learn in their own language.  The Georgian government has set up shelters for Ukrainians has sent up to 1,000 tons of humanitarian aid to the country and \"shelters up to 28,000 Ukrainians\" said Prime MinisterIrakli Garibashvilion May 27, 2022. He noted the Government has allocated US$7 million to care for the Ukrainian refugees, and will allot the same amount for aid to Ukraine through 2022. ",
            "The first refugees from Ukraine arrived inBrandenburgon the evening of 25 February, and the federal state was initially preparing for some 10,000 people. Other states pledged their help. In addition,Mecklenburg-Vorpommerndecided to stop theforced returnof people to Ukraine. ",
            "On 8 March, a legal norm was enacted (Ukraine-Aufenthalts-Übergangsverordnung), which temporarily legalizes the entry and residence of Ukrainians and third-country nationals in Germany who were legally resident in Ukraine at the beginning of the Russian attack on 24 February.  ",
            "Deutsche Bahn, the German national railway company, allowed refugees with a Ukrainian passport or ID card to travel free of charge on long-distance trains from Poland to Germany. The company also gave out free tickets to refugees who wanted to continue to another destination; by 17 March, more than 100,000 had been issued. TheAssociation of German Transport Companiesdecided to also cancel charges for all short-distance travel with buses and trains for Ukrainian refugees within Germany. ",
            "German media debated whether there was a difference in the portrayal of refugees from Ukraine compared to those from other countries, particularly those arriving during the2015 European migrant crisis.   ",
            "According to theFederal Ministry of the Interior and Community, 37,786 war refugees from Ukraine had registered in Germany by midday on 6 March; by March 14 the number had reached almost 147,000. By 23 March, almost 239,000 refugees had entered Germany. The interior ministry said that by 10 March, 300,000 private homes had offered accommodation. Temporary shelters were built in places such as the formerBerlin Tegel Airportand Terminal 5 ofBerlin Brandenburg Airport. ",
            "On 1 March, theGreek governmentwas considering evacuating the 100,000ethnic GreeksfromMariupoland its surrounding area. Many early refugees were from Ukraine's sizeable ethnic Greek community. By 4 April, over 16,700 Ukrainian refugees had arrived in Greece of whom 5,117 were minors according to government officials. ",
            "Between 1 January and 25 April, 845 Ukrainians applied for asylum in Iceland. More may have arrived already, who have not yet applied for asylum. As of 13 April, 748 Ukrainians had applied for asylum, of whom 26 percent were under the age of 18. ",
            "In early March, theIrish governmentannounced that it expected to receive over 100,000 refugees. However this was later increased to 200,000. 21,000 refugees had arrived by 11 April, of whom about 13,000 were being accommodated in State-provided accommodation. Government expect 40,000 Ukrainians by the end of April. By mid-November over 58,000 Ukrainians had come to Ireland, equivalent to over 1% of the population of Ireland. November 2022 also saw the beginning of theIrish anti-immigration protests, which saw pockets of protests against the arrival of refugees. As of March 2023[update], almost 60,000 Ukrainians had been provided with state accommodation.Roderic O'Gorman, theMinister for Children, Equality, Disability, Integration and Youthsaid he \"accepts\" the shortage of accommodation, which was brought up by some protestors. ",
            "Up to 9 March 2022, 23,872 Ukrainian refugees had arrived in Italy, according toPrime MinisterMario Draghi, mainly arriving via the Italian-Slovenian border. By 12 March, three days later, this number had increased to 34,851. By 7 April, the number was 86,066, and 137,385 by 21 June. ",
            "Starting from March 2022, assets seized from themafiaby the Italian government have begun housing Ukrainian refugees.  ",
            "The Latvian Interior Ministry had prepared a plan in case of a large influx of people from Ukraine as early as 14 February. On 24 February, thegovernmentapproved a contingency plan to receive and accommodate approximately 10,000 refugees from Ukraine. Severalnon-governmental organizations,municipalities, schools and other institutions also pledged to provide accommodation. On 27 February, around 20 volunteer professional drivers departed toLublinwith supply donations, bringing Ukrainian refugees on their way back. ",
            "The first refugees began arriving on 26 February and by 2 March Latvia had taken in more than 1,000 Ukrainian refugees. On 2 March, an official designated portal in Latvian, Ukrainian, English and Russian called \"Ukraine to Latvia\" was launched and on 7 March, with 3,000 to 4,000 Ukrainian refugees having arrived in Latvia, a Ukrainian refugee help center was opened in theRiga Congress Hall[lv]. By 9 March,humanitarian visashad been issued to 67 Ukrainian citizens. To deal with the increasingly large numbers of refugees, a second Ukrainian refugee help center is scheduled to be opened in the former building ofRiga Technical Universityon 14 March. As of 20 March, 6,253 Ukrainian refugees are registered in Riga. From the start of the Russian invasion up to 23 March, 12,000 Ukrainian refugees had entered Latvia. From the start of the Russian invasion up to 5 June, 31,960 Ukrainian refugees had entered Latvia. ",
            "From the start of the Russian invasion up to 23 May, almost 53,700 Ukrainian refugees had entered Lithuania, including 21,300 children, of whom almost 5,600 were under the age of six as well as 2,500 Ukrainian refugees aged 65 and over. ",
            "The Ministry of Foreign Affairs of Luxembourg welcomed the European regulations and in early March 2022 set up a \"first reception centre\" inLuxembourg City. As of April 2022, around 5,000 Refugees were in Luxembourg. ",
            "Prior to the invasion, Ukrainians in search of safety could already fly to the Netherlands and stay for three months. During this time, they had to find their own accommodation as asylum centers were already \"overcrowded\". State Secretary for MigrationEric van der Burgsaid that the principle had always been emphasized that refugees should be received in their own region, if possible but that \"now Europe is the region.\" As of 27 February, fewer than 50 refugees had arrived in the Netherlands from Ukraine. ",
            "However, by 8 March, 325 Ukrainian refugees had arrived inRotterdamalone. A local official said that Rotterdam would receive more Ukrainians than the thousand who had been initially expected, \"our people are working hard to find places, and they won't stop at a thousand.\" ",
            "The Dutchcabinetwanted to ensure 50,000 places for refugees from Ukraine according to a letter from Justice and Security MinisterYesilgöz, \"thesafety regionswill coordinate the implementation, together with municipalities, of reception locations for at least 1,000 refugees from Ukraine per region within two weeks\". Then, in a third phase, the same number would again be admitted. ",
            "By 16 March, the municipality ofAmsterdamhad acquired ships harboured in theJava-eilandto lodge 300 refugees as a way to extend their existing capability. ",
            "By late December 2022, 85,210 refugees were registered in the Netherlands. ",
            "Ukrainian refugees have receivedfree public transport.Ruter, Oslo'spublic transportauthority, has provided free rides since 4 March 2022.Vy, a railway company, provides free train rides to reception centres.Vestlandcounty also provide free public transport. ",
            "As of 25 April, Portugal had received 33,106 refugees from Ukraine. The majority of the refugees are Ukrainian citizens, while 5% are non-Ukrainian nationals living in Ukraine at the time of the invasion. There were 22,208 women refugees, 10,898 men and 11,410 minors. As of 6 April, 350 minors had arrived without a parent or legal guardian. In most cases, these minors arrived with close relatives, but 16 of them arrived unaccompanied; this number rose to 45 by 7 April. As of 29 March, 1,800 Portuguese families had offered to provide foster care. The Portuguese authorities expect to find next-of-kin for the majority, and only a tiny number will need permanent adoption. ",
            "Before the 2022 invasion, Portugal already had 27,200 Ukrainian immigrants. As a result of the crisis, the Ukrainian immigrant community has become the second-largest in Portugal, almost doubling to over 52,000 in the month of March. That community helped in organizing the transport of refugees. ",
            "By 6 April, 2,115 Ukrainian refugee children had been enrolled in Portuguese public schools, up from over 600 on 22 March.  Employment wise, as of 6 of April 2022, 359 refugees had been hired, 4,261 registered as looking for work and 2,880 enrolled in Portuguese classes. As of 6 April, Portuguese social security had processed 1,412 requests from Ukrainian refugees. The Portuguese government reiterated that it had set no limit for Ukrainian refugees.  ",
            "As of 25 July, there are 17,875 Ukrainian refugees in Serbia according to the Office of the United Nations High Commissioner for Human Rights. ",
            "From the start of the Russian invasion up to 23 March, more than 3,000 Ukrainian refugees had entered Slovenia, by 28 March 2022, more than 7,000 Ukrainian refugees had entered Slovenia, and by 15 April, this number had risen to 18,415 though the majority were not remaining in Slovenia. ",
            "Spain announced that100,000 Ukrainian citizens already living in the countrywould be fully legalized. This would allow them to \"work legally, so that they can access education, health and social policies\" said Prime MinisterPedro Sánchez. Several other authorities from local to central administration stated the willingness to accept more Ukrainian refugees.  On March 31, 2022, Prime Minister Sánchez announced that 30,000 Ukrainian refugees had officially been granted the temporary protection status, but expected that number to increase to 70,000 in the next days. Many of the refugees were staying with relatives or friends and had not yet notified the authorities. ",
            "The SpanishMinistry of Inclusion, Social Security and Migrationenabled reception, attention and relocation centres (CREADE) for Ukrainian refugees inPozuelo de Alarcón,Barcelona,AlicanteandMálaga, resolving around 40,000 applications for temporary protection over the course of the first three weeks of the conflict. ",
            "Since Russia's invasion of Ukraine on February 24, 2022, Sweden has received approximately 50,000 Ukrainian refugees. In January 2023, 8500 of them had left Sweden again. Meanwhile, new refugees continued to arrive, and by January 2025, there were 46.500 Ukrainian refugees in Sweden. These refugees are covered by the EU'sMass Refugee Directive, which grants them temporary residence permits until March 4, 2026. ",
            "Ukrainian refugees in Sweden have faced significant challenges in adapting to their new lives, including language barriers, difficulties accessing healthcare, and finding employment. There have been concerns about the risk of labor exploitation among Ukrainian refugees, particularly due to their vulnerable legal and economic situation. There have also been reports indicating that female Ukrainian refugees have been subjected to sexual exploitation. ",
            "However, their situation is gradually improving. There have been positive developments in almost all aspects. For example, there has been an increase in the rates of employment and the proportion of Ukrainian refugees who have acquired Swedish language skills. Many Ukrainians are content with their life in Sweden and grateful for the support they have received. Since November 2024, new regulations have allowed a large group that was previously ineligible to now register as residents. This means, among other things, that they will have broader access to healthcare services beyond the emergency services that were initially provided. ",
            "It was already possible for a Ukrainian citizen (with abiometric passport) to enterSwitzerlandwithout a visa, the maximum stay was three months. Justice MinisterKarin Keller-Sutterannounced on 28 February that in future refugees without passports would be welcome too and residence would no longer be time limited. The federal government and the cantons would provide accommodation for 9,000 refugees. On 11 March, the head of the Justice ministryKarin Keller-Suttersaid that 2,100 refugees have already been registered in Switzerland and up to 60,000 refugees could arrive in total. As of 5 April, 24,837 refugees had been registered and 18,149 of them had already received S permits.  By October 2022, there were about 70,000 refugees in Switzerland. ",
            "Britain had issued about 1,000 visas by 13 March and was criticised for placing too many bureaucratic obstacles to entry to the UK for refugees by both international and UK sources, and for only granting admission to refugees who already had family in the UK.   On 4 March the United Kingdom announced that British nationals and Ukrainian residents of the UK would be allowed to bring in members of their extended family from Ukraine.  Prime MinisterBoris Johnsonstated that the country could take in 200,000 Ukrainian refugees. On 7 March 2022, French Interior MinisterGerald Darmaninsaid that many Ukrainian refugees had been turned away by British officials inCalaisand told to obtain visas at UK consulates in Paris or Brussels.  Emmanuel Macronalso criticised the United Kingdom for not helping Ukrainian refugees enough, specifically criticising Britain's visa policy which required applicants to apply for visas in person in Brussels or Paris before entering Britain. ",
            "On 12 March,Michael Goveannounced the \"Homes for Ukraine\" scheme whereby Britons who offered their home to Ukrainian refugees would receive £350 a month.  ",
            "On 28 March the Home Office announced it had issued 21,600 visas under the Ukraine Family Scheme, under which refugees could join close family members already resident in the UK. The government was criticised however for the slow and bureaucratic procedures in the \"Homes for Ukraine\" scheme previously announced by Gove. The heads of the Refugee Council, the British Red Cross, Save the Children and Oxfam made a statement warning that the system was \"causing great distress to already traumatised Ukrainians\". 2,500 applications for visas under this scheme had been approved by 30 March. In April 2022,The Timesrevealed that female refugees may be at risk of being exploited by UK men offering to be their hosts, with some proposing sexual relationship or even marriage. On 13 April, UNHCR asked the United Kingdom to stop pairing single British men with lone Ukrainian women refugees under the \"Homes for Ukraine\" scheme because the women were at risk of sexual exploitation. ",
            "By 8 April, a total of 12,000 Ukrainian refugees had entered Britain. 1,200 of them under the \"Homes for Ukraine\" scheme for those who are sponsored by UK hosts and 10,800 under the Ukrainian family scheme for those with prior family connections to the UK. The British government had received 79,800 applications for visas from Ukrainians and had issued 40,900 up to 7 April, but only 21,600 refugees had actually entered the UK by 22 April and 27,100 by 22 April under both schemes. By 29 May this figure had reached 65,700. "
        ]
    },
    {
        "heading": "Other countries",
        "paragraphs": [
            "In May 2022, the first private plane carrying refugees arriving under humanitarian visas arrived in Buenos Aires carrying 9 passengers. The Argentine government has stated its intent to continue such flights. ",
            "In the wake of the Russian invasion in February,Prime MinisterScott Morrisonsaid that visa applications from Ukrainian nationals would be sent \"to the top of the pile\". Several Australians have opened their homes to host Ukrainian refugees, with more than 4,000 visas having been processed. On 20 March, the federal government announced that Ukrainians who arrive or are already in the country will be allowed temporary humanitarian visas, which allows them to work, study, and accesshealthcare. By 20 March, about 5,000 Ukrainians have been granted visas to travel to Australia, and 750 have arrived. ",
            "On 3 March, Brazil announced that Ukrainians would receive humanitarian visas as refugees, with a period of 5 months to apply for asylum. The country has around600,000 people of Ukrainian descent, about 38,000 of whom live inPrudentópolis, according to the Ukrainian-Brazilian Central Representation. From 3 February until 19 March, Brazil had received almost 900 Ukrainian refugees according to Brazilian police. On 22 March, the country's police reported that 1,100 Ukrainians had landed in Brazil up to that date. ",
            "On 3 March 2022, theGovernment of Canadaannounced a plan to permanently reunify Canadian citizens with their Ukrainian family members. Immigration, Refugees and Citizenship Canadastated the country will allow an unlimited number of Ukrainians to apply to temporarily stay in Canada and provide work permits for Ukrainians that have either been accepted under these migration schemes or cannot safely return to Ukraine.  On 17 March 2022, the Government launched theCanada-Ukraine Authorization for Emergency Travel(CUAET), which gives Ukrainians and their families a visa to come to Canada temporarily, and allows them to work and study there for up to three years. There is no limit to the number of people who can apply, and applicants who are overseas can apply online and provide their biometrics (fingerprints and a photo).  The online application takes 14 days to process. Ukrainians approved under the CUAET will be able to travel to Canada up until March 31 of 2024. Afterward, they will be subject to the standard immigration measures available to others around the world. ",
            "Canada is home to nearly 1.4 million Ukrainian-Canadians, making Canada the second-largestpopulation of the Ukrainian diaspora, after Russia. Between 17 March and 8 July 2022, 1,084,599 applications through CUAET were received, of which 784,272 were approved, with 164,626 having arrived in Canada under said program. In March 2022 Canada announced it was investing an additionalCA$117 million in the implementation of new immigration programs for Ukrainian refugees. ",
            "People coming to Canada from Ukraine under the CUAET scheme are legally considered to be temporary residents rather than refugees. They are granted the right to work or study in Canada for three years but do not get the right to automatic permanent residency as refugees do. This policy was adopted to simplify and speed up the application process. ",
            "When the conflict broke out, there were an estimated 16,000 to 20,000 Ukrainian tourists, now refugees, in Egypt.  TheEgyptian governmentassisted them to leave Egypt, with free flights to Poland, Slovakia, and Hungary – as of 4 March, almost 4,000 had left the country. ",
            "As of 22 May, 36,600 Ukrainians had arrived in Israel, of whom 18,600had the right to enter Israel. ",
            "As of 23 March, more than 15,200 Ukrainian refugees had arrived in Israel, of whom only 4,200 would have otherwise been eligible for citizenship In addition, another 20,000 Ukrainians who were already inside Israel when the conflict broke out (on tourist visas or illegally in the country) were also regarded as refugees and given permission to stay. On July 3, 2022, theSupreme Court of Israelabolished the quotas on Ukrainian refugees in Israel and allowed unlimited entry of refugees into Israel. The President of Ukraine welcomed the decision and said it is a sign of \"a true, developed democracy\" ",
            "As of January 2023, 15,000 Ukrainian refugees remained in Israel, of the about 47,000 Ukrainians who had traveled to Israel since the start of the invasion but who are not entitled to citizenship under Israel'sLaw of Return. None of the 15,000 had been granted refugee status by Israel. ",
            "Japan opened its borders to refugees from Ukraine fleeing the war on March 15 2022. On 12 March,Chief Cabinet Secretary,Hirokazu Matsunoconfirmed that 29 Ukrainians had entered Japan to seek shelter with friends or relatives inHiroshima. ",
            "As of 6 April 2022, 437 Ukrainian refugees had entered Japan, reaching 1222 by 8 June 2022. The largest number of Ukrainian refugees were inTokyo(215 people),Fukuoka(92 people) andKanagawa(70 people), 284 being under the age of 18 according to the prefectures. ",
            "In 30 November 2022 the number of refugees reached 2158, the highest number being in Tokyo (545 people), Osaka (154 people), Kanagawa (139 people), Fukuoka (122 people) andHyōgo(105 people), 417 were under the age of 18, 1463 between the ages of 18 and 61 and 278 over 61. ",
            "Mexico has been the Latin American country that has received the most Ukrainians since February 2022. [unreliable source?]",
            "New Zealandpromised to accept 4,000 Ukrainian refugees. By July 2022, 227 Ukrainians had arrived in New Zealand. ",
            "The Philippines'Department of Justicestated that the country would be willing to accept Ukrainian refugees and asylum seekers as a response to the Russian invasion of Ukraine. PresidentRodrigo Duterteon 28 February 2022 institutionalized the Philippines policy to protect refugees, stateless persons and asylum seekers under international law. ",
            "Early in the conflictthe governmentannounced that it would grant and extend free visas by two months for over 15,000 Russians and Ukrainians who are stranded in Sri Lanka due to the ongoing conflict.   ",
            "On 3 March, Turkey announced that 20,000 Ukrainian refugees had entered Turkey since the Russian invasion. Interior MinisterSüleyman Soylusaid that Turkey was glad to welcome them. By March 8, official figures put the number of Ukrainian refugees in the country at 20,550, of whom 551 were ofCrimean TatarorMeskhetian Turkorigin.  The Ukrainian winner of the2016 Eurovision Song Contest,Jamala, who is of Crimean Tatar origin, also sought refuge in Turkey. By 23 March, the number of Ukrainian refugees had risen above 58,000.  As of 25 April, the number of Ukrainian refugees in Turkey exceeded 85,000. ",
            "The United States announced on 4 March 2022, that Ukrainians would be providedTemporary Protected Status. This was estimated to impact 30,000 Ukrainian nationals in the United States.  On 24 March 2022, US PresidentBidenannounced that up to 100,000 Ukrainian refugees would be accepted into the United States; especially, focusing on those with family already in the country. As of June 2022, only 300 Ukrainians had been resettled under theU.S. Refugee Admissions Program, and most Ukrainian refugees came to the United States on visas they held or by crossing theU.S.-Mexico border. By late 2022 approximately 85,000 Ukrainians had utilized the \"Uniting for Ukraine\" program which allows refugees with an American sponsor to remain in America for two years. On 21 December 2022, PresidentJoe Bidenannounced during his meeting withVolodymyr Zelenskyythat the U.S. had accepted roughly 221,000Ukrainianrefugees via earlier Title 42 encounters, Uniting for Ukraine and other organisations. On 18 August 2023, the Biden administration announced it would extend Temporary Protected Status from October 19, 2023, to April 19, 2025. In January 2025, President Biden's administration extended Temporary Protected Status for Ukrainians until October 2026. However, this temporary protection is only available to Ukrainians who had arrived in the US by August 2023.  ",
            "On 20 January 2025, newly inaugurated PresidentDonald Trumpsigned theExecutive OrderSecuring Our Borders. Due to this orderThe Uniting for Ukraine parole programis paused, and is not accepting new applications.  "
        ]
    },
    {
        "heading": "International aid",
        "paragraphs": [
            "Organizations such asUNICEF, theUnited Nations Refugee Agency,International Rescue Committeeand others began accepting monetary donations to help refugees and those affected by the crisis. Others such asThe Kyiv IndependentbeganGoFundMecampaigns to raise money for specific causes or calls for physical items to be donated.  ",
            "On 10 May, the USHouse of Representativespassed legislation that would provide $900 million for housing, education and other help for Ukrainian refugees in the United States. ",
            "UNICEF is helping the Ukrainian children and refugees also by providing essential health services, safe drinking water supplies, education and protection. "
        ]
    },
    {
        "heading": "Human trafficking concerns",
        "paragraphs": [
            "TheCouncil of Europe'sGroup of Experts on Action against Trafficking in Human Beings(GRETA) and aid organizations such as theHuman Trafficking FoundationandWorld Visionwarned that refugees are at risk of falling intohuman trafficking, exploitation and violence, including sexual violence.   ",
            "Concerns about human trafficking and sexual violence have been realized during the refugee crisis, with spotty documentation and identification, language barriers and the large numbers of refugees creating opportunities for traffickers.   A Ukrainian refugee who stayed to help at a border location told reporters of calling the police on three men holding transportation signs, who were later arrested for looking for women for thesex trade. Another refugee spoke of men who attempted to coerce her and her children into a van full of only women, and refused to show her proof of identification and attempted to intimidate her from other travel options. At least one man was arrested on suspicions of raping a 19-year-old refugee after promising her work and shelter. ",
            "La Stradaworked on a case where Ukrainian girls were offered tickets toMexico,Turkeyand theUnited Arab Emirateswithout ever meeting the men who invited them. European Commissioner for Home AffairsYlva Johanssonsaid: \"We have some indications on online services that the demand for Ukrainian women for sexual purposes has gone up.\" According toUSA Today, \"there has been a skyrocketing increase in all forms of illegal trafficking of women and girls in the region – and also boys – including forced sex and labor,prostitution,pornographyand other forms of sexual exploitation... In recent weeks, online searches for Ukrainian women and keywords like escorts, porn or sex have shot up dramatically in European countries, according to theOrganization for Security and Co-operation in Europe(OSCE).\" ",
            "Polish, Romanian and Slovakian law enforcement deployed patrols to border crossings to look out for criminal activity.  Both men and women have attempted to procure female refugees at stations. The Polish government passed an amendment which raised the minimum sentence of human trafficking from 3 years to 10 years, and the sex trafficking of children from 10 years to 25 years. In Berlin, German authorities advised refugees not to accept help directly from people at train stations, and for Germans to register their offers of help on coordinated websites rather than approaching refugees directly. German police also increased the number of uniformed and undercover police officers at train stations, and asked volunteers to report suspicious activity at train stations. ",
            "UNICEF and UNHCR raised concerns about minors who were traveling unaccompanied, and urged neighbouring countries to identify and register the children before sending them to relocation services. They also highlighted a number of institutional care and boarding schools in Ukraine which held about 10,000 students that have been caught up in the invasion. In some countries, accommodation has been created specifically for orphaned children in foster homes or orphanages.  UNICEF set up \"Blue Dot\" safe spaces in neighboring countries, which included support for unaccompanied children. In addition, some protection for separated and unaccompanied minors is now provided through a system of temporary guardianship in the country where the children arrive, which Poland among other countries has set up under new legislation. "
        ]
    },
    {
        "heading": "Deportations",
        "paragraphs": [
            "According to Ukrainian authorities, thousands of refugees arriving in Russia have beenforcibly relocatedusing 'filtration centres', evoking the memory ofSoviet era population transfersand prior Russian use of such centres in theChechen War of Independence. Forcible deportation by a warring party is a human rights violation, and experts warn that the forcible transfer of Ukrainian children for \"adoption\" in Russia is agenocidal act. ",
            "RIA Novosti and Ukrainian officials stated that thousands were dispatched to filtration centres in Penza Oblast,  Taganrog, Donetsk,Ryazan,Yaroslavland the Russian-occupied Ukrainian cities ofDokuchaievsk, Izium  and Bezimenne. The Ukrainian government claimed that 400,000 Ukrainian citizens have been forcibly taken to Russia where \"some could be sent as far as thePacific Oceanisland ofSakhalinand are being offered jobs on condition they don't leave for two years\", while \"the Kremlin\" claimed the relocated people wanted to go to Russia. It was reported that underground networks of Russians and Russian exiles, had been helping Ukrainian refugees to leave Russia and Russian controlled areas. More than 20,000 Ukrainians have entered Estonia from Russia since the war began. ",
            "Human Rights Watch,  theUN Human Rights Office,  Amnesty International, theUnited States Department of State,  andThe Intercepthave reported Russian deportations of Ukrainians. According to the U.S. State Department, the number of Ukrainians who have been deported or forcibly transferred into Russia is between 900,000 and 1.6 million, citing various sources including the Russian government. "
        ]
    },
    {
        "heading": "Mobilization in Ukraine",
        "paragraphs": [
            "As of 26 April 2024, thePolish governmentoffered and theLithuaniangovernment considered repatriating Ukrainian men of military age living in their countries to Ukraine to bedrafted into the Ukrainian military. It is estimated that there may be as many as 400,000 Ukrainian men living in Poland alone. More than 650,000 Ukrainian men are registered as refugees in the European Union, Norway, Switzerland, and Liechtenstein. ",
            "Lithuanian PresidentGitanas Nausėda, Prime MinisterIngrida Šimonytėand Defence MinisterLaurynas Kasčiūnasvoiced support for the repatriation of military-age Ukrainian men to Ukraine. ",
            "In April 2024, the Ukrainian government banned the issuance of new passports and the provision of non-emergency consular services for Ukrainian men of military age abroad. Ukrainian men between the ages of 18 and 60 are not allowed to leave the country,   but it is estimated that 600,000–850,000 Ukrainian men fled to Europe after the Russian invasion. "
        ]
    },
    {
        "heading": "Racial discrimination",
        "paragraphs": [
            "A few days into the crisis, claims of discrimination by border guards and other authorities against non-European andRomani peoplewere reported by some of those fleeing Ukraine. There were reports of people being forced to move to the backs of queues, deboarded from buses, prevented from crossing the border, and, in one report, being beaten by guards.      Some Indians in Ukraine said they were targeted after India chose to abstain from condemning Russia at the UN.  Some Indians and Africans were reportedly harassed and threatened by Polish nationalists after crossing into Poland. On 1 March,Filippo Grandi, of UNHCR, acknowledged that discrimination against non-Ukrainians had occurred at some borders, but he did not believe it was from state policies.  ",
            "TheAfrican Unioncalled attempts to prevent Africans from crossing the borderracistand not in line withinternational law.  On March 2, Ukrainian foreign ministerDmytro Kulebastated that Africans \"need to have equal opportunity\" to leave the country and he also stated that \"Ukraine's government spares no effort to solve the problem.\"  On 3 March, Russian presidentVladimir Putinheld talks with Indian prime ministerNarendra Modiand told him that he had instructed Russian soldiers to \"ensure the safe exit of Indian nationals from the armed conflict zone.\" ",
            "In 2020, Ukraine had over 76,000 foreign students, withIndiaand African countries each making up one quarter of the total number. With their affordable tuition, straightforward visa requirements, and the possibility of permanent residency, Ukrainian universities were seen as an entry point to the European job market. Afghansconstitute the largest immigrant group in the country, having arrived as early as the 1980s. Andriy Demchenko, a spokesperson for theUkrainian border guard, said that allegations of segregation at the borders are untrue. On 28 February,Krzysztof Szczerski, Poland's ambassador to the UN, reported that the refugees who were admitted from Ukraine on that day alone represented 125 countries. Since then, EU CommissionerYlva Johanssonhas stated that its borders are open to people in Ukraine from third countries who want to travel to their home countries, and individuals in need of protection can apply for asylum.  ",
            "On 2 March, the German embassy as well as the EU delegation in Kenya called for verification of the postings on Kenyan social media, cautioning that unsubstantiated claims had been spread.  According to German TV stationTagesschau, such allegations are grave because they are in line with the narrative of Vladimir Putin, who has justified his attack on Ukraine with, the need to free the country from \"Nazis\". On Polish social media, the amount of both pro-Russian and racist content saw an increase following the invasion, andfake newsabout supposed crimes which were committed by, or against refugees were partially spread bypro-Kremlin accounts.    ",
            "Differences between the policies, border treatment andmedia portrayalof Ukrainian refugees compared to other groups, in particular those during the2015 European migrant crisis, have been criticised. Specific issues include alleged harsher treatment and more restrictions placed onSyrian,Afghan,Iraqi, and other refugees, in contrast to the relatively liberal and welcoming response to native Ukrainian refugees.   Portrayal by some Western media and politicians of Ukraine as a country \"where you wouldn't expect that\" [war] and its people as \"white\", \"Christian\", \"relatively civilized\", \"relatively European\", \"like us\", and having \"blue eyes and blonde hair\" has also been criticised.  Kenan Maliknoted that there is an irony in such Western reporting, highlighting a long history of bigotry towardsSlavs, of viewing them as primitive, being \"a born slave\", and of hostile attitudes towards Slavs bywhite supremacistshistorically. ",
            "Professor Serena Parekh suggested that besides racism there are other factors explaining the different treatment in earlier crises: including that current Ukrainian refugees are almost entirely women, children and elderly people. Under the purview of the visa liberalisation agreement in force since 2017, Ukrainians withbiometric passportswere already allowed to enter theSchengen zoneand stay for up to 90 days within any 180 days period without a visa; therefore, there was never any question of whether they should be allowed to enter any Schengen zone country. The welcoming approach witnessed inCentral and Eastern Europehas been further explained by its geographical and language proximity to Ukraine, large Ukrainian diasporas, shared history and traumatizing experiences ofSovietaggression and occupation. ",
            "Romani peoplehave suffered since they often lack the civil status documentation needed to access humanitarian assistance. Some local officials have allegedly refused to accommodate Romani refugees from Ukraine in their territories. "
        ]
    },
    {
        "heading": "Pets and zoo animals",
        "paragraphs": [
            "Domestic animals and animals inzooswere caught up in the invasion, with many border crossing regulations ofmicrochippingandvaccinationsin effect. Pets entering the EU from a third country would normally have to include an identification document orpet passportthat includes information on anti-rabies vaccinations and any other preventative health measures. Additionally, dogs, cats andferretsmust undergo arabiesantibodytitration test. Many EU authorities and governments of neighboring countries have since removed or relaxed the requirements needed for pets to cross the borders with their owners.  ",
            "While some delayed leaving Ukraine in order to leave with their pets, others were forced to give their pets to shelters or leave them with relatives who were staying behind. Some international organizations, such as theInternational Fund for Animal WelfareandPETAand independent organizations or sanctuaries, have offered support in the form of food, veterinary supplies for the animals and wages along with housing for the caretakers. Others who work with animal shelters or theKyiv Zoohave refused to evacuate, when it would be impossible to safely evacuate all the animals due to their numbers or size.  The Feldman Ecopark Zoo (outsideKharkiv) reported the death and wounding of some of their animals due to damage to their facilities. A lion and a wolf were evacuated from a zoo inZaporizhzhia, Ukraine to a zoo inRădăuți, Romania. "
        ]
    },
    {
        "heading": "External links",
        "table": [
            [
                "Sovereign states",
                "AlbaniaAndorraArmeniaAustriaAzerbaijanBelarusBelgiumBosnia and HerzegovinaBulgariaCroatiaCyprusCzech RepublicDenmarkEstoniaFinlandFranceGeorgiaGermanyGreeceHungaryIcelandIrelandItalyKazakhstanLatviaLiechtensteinLithuaniaLuxembourgMaltaMoldovaMonacoMontenegroNetherlandsNorth MacedoniaNorwayPolandPortugalRomaniaRussiaSan MarinoSerbiaSlovakiaSloveniaSpainSwedenSwitzerlandTurkeyUkraineUnited Kingdom"
            ],
            [
                "States with limitedrecognition",
                "AbkhaziaKosovoNorthern CyprusSouth OssetiaTransnistria"
            ],
            [
                "Dependencies andother entities",
                "ÅlandFaroe IslandsGibraltarGuernseyIsle of ManJerseySvalbard"
            ],
            [
                "Other entities",
                "European Union"
            ]
        ]
    },
    {
        "heading": "External links",
        "table": [
            {
                "vteRussian invasion of Ukraine": "Part of theRusso-Ukrainian War"
            },
            [
                "OverviewGeneralOutlineTimelinePreludeFeb – Apr 2022Apr – Aug 2022Aug – Nov 2022Nov 2022 – Jun 2023Jun – Aug 2023Sep – Nov 2023Dec 2023 – Mar 2024Apr – Jul 2024Aug – Dec 2024Jan 2025 – presentAerial warfareDefense linesForeign fightersInformation warNaval warfareLegalityMapOrder of battlePeace negotiationsUkraine's Peace FormulaChina peace proposalJune 2024 peace summitProposed no-fly zoneRed linesReparationsTerritorial controlWomenPreludeReactionsDisinformationUkraine bioweapons conspiracy theoryUkraine and weapons of mass destruction2021 Russia–United States summit2021 Black Sea incidentBelarus–European Union border crisis\"On the Historical Unity of Russians and Ukrainians\"Crimea PlatformZapad 2021December 2021 ultimatum2022 Ukraine cyberattacksZametil 2022Union Resolve 2022Stanytsia Luhanska kindergarten bombingBritish–Polish–Ukrainian trilateral pactEvacuation of the Donetsk PR and Luhansk PRMobilization in Donetsk PR and Luhansk PR\"Address concerning the events in Ukraine\"\"On conducting a special military operation\"BackgroundDissolution of the Soviet Union2014 pro-Russian unrest in UkraineAnnexation of CrimeareactionsWar in Donbas2022 timelineMinsk agreementshumanitarian situationinternational recognition of the Donetsk PR and Luhansk PRPutinismFoundations of GeopoliticsNovorossiyaRuscismRussian irredentismRussian imperialismForeignrelationsRussia–UkraineBelarus–UkraineBelarus–RussiaRussia–United StatesUkraine–United StatesRussia–NATOUkraine–NATOenlargement of NATOeastward expansion controversy in Russiaopen door policy",
                "Overview",
                "General",
                "OutlineTimelinePreludeFeb – Apr 2022Apr – Aug 2022Aug – Nov 2022Nov 2022 – Jun 2023Jun – Aug 2023Sep – Nov 2023Dec 2023 – Mar 2024Apr – Jul 2024Aug – Dec 2024Jan 2025 – presentAerial warfareDefense linesForeign fightersInformation warNaval warfareLegalityMapOrder of battlePeace negotiationsUkraine's Peace FormulaChina peace proposalJune 2024 peace summitProposed no-fly zoneRed linesReparationsTerritorial controlWomen",
                "Prelude",
                "ReactionsDisinformationUkraine bioweapons conspiracy theoryUkraine and weapons of mass destruction2021 Russia–United States summit2021 Black Sea incidentBelarus–European Union border crisis\"On the Historical Unity of Russians and Ukrainians\"Crimea PlatformZapad 2021December 2021 ultimatum2022 Ukraine cyberattacksZametil 2022Union Resolve 2022Stanytsia Luhanska kindergarten bombingBritish–Polish–Ukrainian trilateral pactEvacuation of the Donetsk PR and Luhansk PRMobilization in Donetsk PR and Luhansk PR\"Address concerning the events in Ukraine\"\"On conducting a special military operation\"",
                "Background",
                "Dissolution of the Soviet Union2014 pro-Russian unrest in UkraineAnnexation of CrimeareactionsWar in Donbas2022 timelineMinsk agreementshumanitarian situationinternational recognition of the Donetsk PR and Luhansk PRPutinismFoundations of GeopoliticsNovorossiyaRuscismRussian irredentismRussian imperialism",
                "Foreignrelations",
                "Russia–UkraineBelarus–UkraineBelarus–RussiaRussia–United StatesUkraine–United StatesRussia–NATOUkraine–NATOenlargement of NATOeastward expansion controversy in Russiaopen door policy"
            ],
            {
                "vteRussian invasion of Ukraine": "Overview"
            },
            [
                "General",
                "OutlineTimelinePreludeFeb – Apr 2022Apr – Aug 2022Aug – Nov 2022Nov 2022 – Jun 2023Jun – Aug 2023Sep – Nov 2023Dec 2023 – Mar 2024Apr – Jul 2024Aug – Dec 2024Jan 2025 – presentAerial warfareDefense linesForeign fightersInformation warNaval warfareLegalityMapOrder of battlePeace negotiationsUkraine's Peace FormulaChina peace proposalJune 2024 peace summitProposed no-fly zoneRed linesReparationsTerritorial controlWomen"
            ],
            [
                "Prelude",
                "ReactionsDisinformationUkraine bioweapons conspiracy theoryUkraine and weapons of mass destruction2021 Russia–United States summit2021 Black Sea incidentBelarus–European Union border crisis\"On the Historical Unity of Russians and Ukrainians\"Crimea PlatformZapad 2021December 2021 ultimatum2022 Ukraine cyberattacksZametil 2022Union Resolve 2022Stanytsia Luhanska kindergarten bombingBritish–Polish–Ukrainian trilateral pactEvacuation of the Donetsk PR and Luhansk PRMobilization in Donetsk PR and Luhansk PR\"Address concerning the events in Ukraine\"\"On conducting a special military operation\""
            ],
            [
                "Background",
                "Dissolution of the Soviet Union2014 pro-Russian unrest in UkraineAnnexation of CrimeareactionsWar in Donbas2022 timelineMinsk agreementshumanitarian situationinternational recognition of the Donetsk PR and Luhansk PRPutinismFoundations of GeopoliticsNovorossiyaRuscismRussian irredentismRussian imperialism"
            ],
            [
                "Foreignrelations",
                "Russia–UkraineBelarus–UkraineBelarus–RussiaRussia–United StatesUkraine–United StatesRussia–NATOUkraine–NATOenlargement of NATOeastward expansion controversy in Russiaopen door policy"
            ],
            [
                "Military engagementsSouthernUkraineSnake Island campaignSiege of MariupolBattle of KhersonCapture of MelitopolBattle of MykolaivBattle of EnerhodarBattle of VoznesenskBattle of HuliaipoleKherson counteroffensiveLiberation of KhersonDnieper campaignDestruction of the Kakhovka Dam2025 spring offensiveEasternUkraineBattle of VolnovakhaBattle of KharkivBattle of IziumBattle of RubizhneBattle of PopasnaBattle of MarinkaBattle of DonbasBattle of the Siverskyi DonetsBattle of SievierodonetskBattle of LysychanskBattle of PiskyBattle of BakhmutBattle of SoledarBattle of VuhledarKharkiv counteroffensiveBattle of Lyman (September–October 2022)Luhansk Oblast campaignKupianskNortheast DonetskBattle of AvdiivkaBattle of Chasiv YarBattle of KrasnohorivkaBattle of OcheretyneBattle of ToretskPokrovsk offensiveBattle of KurakhoveNorthernUkraineCapture of ChernobylRussian Kyiv convoyBattle of KyivBattle of Antonov AirportBattle of HostomelBattle of BuchaBattle of IrpinBattle of MakarivBattle of MoshchunDestruction of the Kozarovychi DamBattle of BrovaryBattle of SlavutychBattle of SumySiege of ChernihivNortheastern border skirmishes2025 Sumy Oblast incursionRussiaBryansk Oblast raidKremlin drone attackMoscow drone strikes2023 Belgorod Oblast incursions30 December 2023 Belgorod shellingFebruary 2024 Belgorod missile strikeMay 2024 Belgorod missile strikeMarch 2024 western Russia incursion2024 Kursk offensiveoccupationBattles for Olgovskiy ForestToropets depot explosions2025 Belgorod Oblast incursionAirstrikesby cityChernihiv strikesDnipro strikesIvano-Frankivsk strikesKharkiv strikesKherson strikesKhmelnytskyi strikesKryvyi Rih strikesKyiv strikesLviv strikesMykolaiv strikesOdesa strikesRivne strikesVinnytsia strikesZaporizhzhia strikesZhytomyr strikesAirstrikeson militarytargetsChuhuiv air base attackMillerovo air base attackChornobaivka (Saky) attacks7 March 2022 Mykolaiv military barracks attackYavoriv military base attack18 March 2022 Mykolaiv military quarters attackBerdiansk port attackSinking of theMoskvaDesna barracks airstrikeAttack on Nova KakhovkaCrimea attacksNovofedorivka explosionsDrone attack on the Sevastopol Naval BaseMissile strike on the Black Sea Fleet headquartersDyagilevo and Engels air bases attacksMakiivka military quarters shellingMachulishchy air base attackZarichne barracks airstrikeResistanceRussian-occupied UkrainePopular Resistance of UkraineBerdiansk Partisan ArmyYellow RibbonAteshBelarus and RussiaAssassination of Vladlen TatarskyCivic CouncilIrpin DeclarationKilling of Darya DuginaNational Republican ArmyMilitary commissariats arsonsUst-Ilimsk military commissariat shootingBlack BridgeRail war in RussiaStop the WagonsCombat Organization of Anarcho-CommunistsRail war in BelarusBusly liaciaćBYPOLCommunity of Railway WorkersCyber PartisansRussianoccupationsFlags used in Russian-occupied UkraineOngoingAnnexation referendumsAnnexation of Donetsk, Kherson, Luhansk and Zaporizhzhia oblastsElections in Russian-occupied UkraineRussian-occupied territories of UkraineAutonomous Republic of Crimea and SevastopolDonetsk OblastKharkiv OblastKherson OblastLuhansk OblastMykolaiv OblastZaporizhzhia OblastSumy Oblast(2025, reentry)PreviousChernihiv OblastKyiv OblastOdesa OblastSumy Oblast(2022)Zhytomyr OblastPotentiallyrelatedBlack Sea drone incidentMystery fires in RussiaNord Stream pipeline sabotageTransnistria attacksZagreb Tu-141 crashOther2022 Crimean Bridge explosion2023 Crimean Bridge explosionAssassination attempts on Volodymyr ZelenskyyChernobyl Nuclear Power Plant drone strikeCoup d'état attempt in UkraineBridges in the Russo-Ukrainian WarDragon droneViolations of non-combatant airspacesMissile explosion in PolandOperation SynytsiaUkraine and electronic warfareUse of long-range weapons by Ukraine in Russia2023 Ukrainian counteroffensive2024 Ukrainian cyberattacks against RussiaWagner Group rebellion",
                "Military engagements",
                "SouthernUkraine",
                "Snake Island campaignSiege of MariupolBattle of KhersonCapture of MelitopolBattle of MykolaivBattle of EnerhodarBattle of VoznesenskBattle of HuliaipoleKherson counteroffensiveLiberation of KhersonDnieper campaignDestruction of the Kakhovka Dam2025 spring offensive",
                "EasternUkraine",
                "Battle of VolnovakhaBattle of KharkivBattle of IziumBattle of RubizhneBattle of PopasnaBattle of MarinkaBattle of DonbasBattle of the Siverskyi DonetsBattle of SievierodonetskBattle of LysychanskBattle of PiskyBattle of BakhmutBattle of SoledarBattle of VuhledarKharkiv counteroffensiveBattle of Lyman (September–October 2022)Luhansk Oblast campaignKupianskNortheast DonetskBattle of AvdiivkaBattle of Chasiv YarBattle of KrasnohorivkaBattle of OcheretyneBattle of ToretskPokrovsk offensiveBattle of Kurakhove",
                "NorthernUkraine",
                "Capture of ChernobylRussian Kyiv convoyBattle of KyivBattle of Antonov AirportBattle of HostomelBattle of BuchaBattle of IrpinBattle of MakarivBattle of MoshchunDestruction of the Kozarovychi DamBattle of BrovaryBattle of SlavutychBattle of SumySiege of ChernihivNortheastern border skirmishes2025 Sumy Oblast incursion",
                "Russia",
                "Bryansk Oblast raidKremlin drone attackMoscow drone strikes2023 Belgorod Oblast incursions30 December 2023 Belgorod shellingFebruary 2024 Belgorod missile strikeMay 2024 Belgorod missile strikeMarch 2024 western Russia incursion2024 Kursk offensiveoccupationBattles for Olgovskiy ForestToropets depot explosions2025 Belgorod Oblast incursion",
                "Airstrikesby city",
                "Chernihiv strikesDnipro strikesIvano-Frankivsk strikesKharkiv strikesKherson strikesKhmelnytskyi strikesKryvyi Rih strikesKyiv strikesLviv strikesMykolaiv strikesOdesa strikesRivne strikesVinnytsia strikesZaporizhzhia strikesZhytomyr strikes",
                "Airstrikeson militarytargets",
                "Chuhuiv air base attackMillerovo air base attackChornobaivka (Saky) attacks7 March 2022 Mykolaiv military barracks attackYavoriv military base attack18 March 2022 Mykolaiv military quarters attackBerdiansk port attackSinking of theMoskvaDesna barracks airstrikeAttack on Nova KakhovkaCrimea attacksNovofedorivka explosionsDrone attack on the Sevastopol Naval BaseMissile strike on the Black Sea Fleet headquartersDyagilevo and Engels air bases attacksMakiivka military quarters shellingMachulishchy air base attackZarichne barracks airstrike",
                "Resistance",
                "Russian-occupied UkrainePopular Resistance of UkraineBerdiansk Partisan ArmyYellow RibbonAteshBelarus and RussiaAssassination of Vladlen TatarskyCivic CouncilIrpin DeclarationKilling of Darya DuginaNational Republican ArmyMilitary commissariats arsonsUst-Ilimsk military commissariat shootingBlack BridgeRail war in RussiaStop the WagonsCombat Organization of Anarcho-CommunistsRail war in BelarusBusly liaciaćBYPOLCommunity of Railway WorkersCyber Partisans",
                "Russian-occupied Ukraine",
                "Popular Resistance of UkraineBerdiansk Partisan ArmyYellow RibbonAtesh",
                "Belarus and Russia",
                "Assassination of Vladlen TatarskyCivic CouncilIrpin DeclarationKilling of Darya DuginaNational Republican ArmyMilitary commissariats arsonsUst-Ilimsk military commissariat shootingBlack BridgeRail war in RussiaStop the WagonsCombat Organization of Anarcho-CommunistsRail war in BelarusBusly liaciaćBYPOLCommunity of Railway WorkersCyber Partisans",
                "Russianoccupations",
                "Flags used in Russian-occupied UkraineOngoingAnnexation referendumsAnnexation of Donetsk, Kherson, Luhansk and Zaporizhzhia oblastsElections in Russian-occupied UkraineRussian-occupied territories of UkraineAutonomous Republic of Crimea and SevastopolDonetsk OblastKharkiv OblastKherson OblastLuhansk OblastMykolaiv OblastZaporizhzhia OblastSumy Oblast(2025, reentry)PreviousChernihiv OblastKyiv OblastOdesa OblastSumy Oblast(2022)Zhytomyr Oblast",
                "Flags used in Russian-occupied Ukraine",
                "Ongoing",
                "Annexation referendumsAnnexation of Donetsk, Kherson, Luhansk and Zaporizhzhia oblastsElections in Russian-occupied UkraineRussian-occupied territories of UkraineAutonomous Republic of Crimea and SevastopolDonetsk OblastKharkiv OblastKherson OblastLuhansk OblastMykolaiv OblastZaporizhzhia OblastSumy Oblast(2025, reentry)",
                "Previous",
                "Chernihiv OblastKyiv OblastOdesa OblastSumy Oblast(2022)Zhytomyr Oblast",
                "Potentiallyrelated",
                "Black Sea drone incidentMystery fires in RussiaNord Stream pipeline sabotageTransnistria attacksZagreb Tu-141 crash",
                "Other",
                "2022 Crimean Bridge explosion2023 Crimean Bridge explosionAssassination attempts on Volodymyr ZelenskyyChernobyl Nuclear Power Plant drone strikeCoup d'état attempt in UkraineBridges in the Russo-Ukrainian WarDragon droneViolations of non-combatant airspacesMissile explosion in PolandOperation SynytsiaUkraine and electronic warfareUse of long-range weapons by Ukraine in Russia2023 Ukrainian counteroffensive2024 Ukrainian cyberattacks against RussiaWagner Group rebellion"
            ],
            {
                "vteRussian invasion of Ukraine": "Military engagements"
            },
            [
                "SouthernUkraine",
                "Snake Island campaignSiege of MariupolBattle of KhersonCapture of MelitopolBattle of MykolaivBattle of EnerhodarBattle of VoznesenskBattle of HuliaipoleKherson counteroffensiveLiberation of KhersonDnieper campaignDestruction of the Kakhovka Dam2025 spring offensive"
            ],
            [
                "EasternUkraine",
                "Battle of VolnovakhaBattle of KharkivBattle of IziumBattle of RubizhneBattle of PopasnaBattle of MarinkaBattle of DonbasBattle of the Siverskyi DonetsBattle of SievierodonetskBattle of LysychanskBattle of PiskyBattle of BakhmutBattle of SoledarBattle of VuhledarKharkiv counteroffensiveBattle of Lyman (September–October 2022)Luhansk Oblast campaignKupianskNortheast DonetskBattle of AvdiivkaBattle of Chasiv YarBattle of KrasnohorivkaBattle of OcheretyneBattle of ToretskPokrovsk offensiveBattle of Kurakhove"
            ],
            [
                "NorthernUkraine",
                "Capture of ChernobylRussian Kyiv convoyBattle of KyivBattle of Antonov AirportBattle of HostomelBattle of BuchaBattle of IrpinBattle of MakarivBattle of MoshchunDestruction of the Kozarovychi DamBattle of BrovaryBattle of SlavutychBattle of SumySiege of ChernihivNortheastern border skirmishes2025 Sumy Oblast incursion"
            ],
            [
                "Russia",
                "Bryansk Oblast raidKremlin drone attackMoscow drone strikes2023 Belgorod Oblast incursions30 December 2023 Belgorod shellingFebruary 2024 Belgorod missile strikeMay 2024 Belgorod missile strikeMarch 2024 western Russia incursion2024 Kursk offensiveoccupationBattles for Olgovskiy ForestToropets depot explosions2025 Belgorod Oblast incursion"
            ],
            [
                "Airstrikesby city",
                "Chernihiv strikesDnipro strikesIvano-Frankivsk strikesKharkiv strikesKherson strikesKhmelnytskyi strikesKryvyi Rih strikesKyiv strikesLviv strikesMykolaiv strikesOdesa strikesRivne strikesVinnytsia strikesZaporizhzhia strikesZhytomyr strikes"
            ],
            [
                "Airstrikeson militarytargets",
                "Chuhuiv air base attackMillerovo air base attackChornobaivka (Saky) attacks7 March 2022 Mykolaiv military barracks attackYavoriv military base attack18 March 2022 Mykolaiv military quarters attackBerdiansk port attackSinking of theMoskvaDesna barracks airstrikeAttack on Nova KakhovkaCrimea attacksNovofedorivka explosionsDrone attack on the Sevastopol Naval BaseMissile strike on the Black Sea Fleet headquartersDyagilevo and Engels air bases attacksMakiivka military quarters shellingMachulishchy air base attackZarichne barracks airstrike"
            ],
            [
                "Resistance",
                "Russian-occupied UkrainePopular Resistance of UkraineBerdiansk Partisan ArmyYellow RibbonAteshBelarus and RussiaAssassination of Vladlen TatarskyCivic CouncilIrpin DeclarationKilling of Darya DuginaNational Republican ArmyMilitary commissariats arsonsUst-Ilimsk military commissariat shootingBlack BridgeRail war in RussiaStop the WagonsCombat Organization of Anarcho-CommunistsRail war in BelarusBusly liaciaćBYPOLCommunity of Railway WorkersCyber Partisans",
                "Russian-occupied Ukraine",
                "Popular Resistance of UkraineBerdiansk Partisan ArmyYellow RibbonAtesh",
                "Belarus and Russia",
                "Assassination of Vladlen TatarskyCivic CouncilIrpin DeclarationKilling of Darya DuginaNational Republican ArmyMilitary commissariats arsonsUst-Ilimsk military commissariat shootingBlack BridgeRail war in RussiaStop the WagonsCombat Organization of Anarcho-CommunistsRail war in BelarusBusly liaciaćBYPOLCommunity of Railway WorkersCyber Partisans"
            ],
            [
                "Russian-occupied Ukraine",
                "Popular Resistance of UkraineBerdiansk Partisan ArmyYellow RibbonAtesh"
            ],
            [
                "Belarus and Russia",
                "Assassination of Vladlen TatarskyCivic CouncilIrpin DeclarationKilling of Darya DuginaNational Republican ArmyMilitary commissariats arsonsUst-Ilimsk military commissariat shootingBlack BridgeRail war in RussiaStop the WagonsCombat Organization of Anarcho-CommunistsRail war in BelarusBusly liaciaćBYPOLCommunity of Railway WorkersCyber Partisans"
            ],
            [
                "Russianoccupations",
                "Flags used in Russian-occupied UkraineOngoingAnnexation referendumsAnnexation of Donetsk, Kherson, Luhansk and Zaporizhzhia oblastsElections in Russian-occupied UkraineRussian-occupied territories of UkraineAutonomous Republic of Crimea and SevastopolDonetsk OblastKharkiv OblastKherson OblastLuhansk OblastMykolaiv OblastZaporizhzhia OblastSumy Oblast(2025, reentry)PreviousChernihiv OblastKyiv OblastOdesa OblastSumy Oblast(2022)Zhytomyr Oblast",
                "Flags used in Russian-occupied Ukraine",
                "Ongoing",
                "Annexation referendumsAnnexation of Donetsk, Kherson, Luhansk and Zaporizhzhia oblastsElections in Russian-occupied UkraineRussian-occupied territories of UkraineAutonomous Republic of Crimea and SevastopolDonetsk OblastKharkiv OblastKherson OblastLuhansk OblastMykolaiv OblastZaporizhzhia OblastSumy Oblast(2025, reentry)",
                "Previous",
                "Chernihiv OblastKyiv OblastOdesa OblastSumy Oblast(2022)Zhytomyr Oblast"
            ],
            {
                "vteRussian invasion of Ukraine": "Flags used in Russian-occupied Ukraine"
            },
            [
                "Ongoing",
                "Annexation referendumsAnnexation of Donetsk, Kherson, Luhansk and Zaporizhzhia oblastsElections in Russian-occupied UkraineRussian-occupied territories of UkraineAutonomous Republic of Crimea and SevastopolDonetsk OblastKharkiv OblastKherson OblastLuhansk OblastMykolaiv OblastZaporizhzhia OblastSumy Oblast(2025, reentry)"
            ],
            [
                "Previous",
                "Chernihiv OblastKyiv OblastOdesa OblastSumy Oblast(2022)Zhytomyr Oblast"
            ],
            [
                "Potentiallyrelated",
                "Black Sea drone incidentMystery fires in RussiaNord Stream pipeline sabotageTransnistria attacksZagreb Tu-141 crash"
            ],
            [
                "Other",
                "2022 Crimean Bridge explosion2023 Crimean Bridge explosionAssassination attempts on Volodymyr ZelenskyyChernobyl Nuclear Power Plant drone strikeCoup d'état attempt in UkraineBridges in the Russo-Ukrainian WarDragon droneViolations of non-combatant airspacesMissile explosion in PolandOperation SynytsiaUkraine and electronic warfareUse of long-range weapons by Ukraine in Russia2023 Ukrainian counteroffensive2024 Ukrainian cyberattacks against RussiaWagner Group rebellion"
            ],
            [
                "War crimesGeneralAccusations of genocide in DonbasAllegations of genocide of Ukrainianschild abductionsAttacks on hospitalsCluster munitionsIncendiary weaponsLandminesRussian filtration campsRussian mobile crematoriumsRussian theft of Ukrainian grainRussian torture chambersLootingSexual violenceMistreatment of prisoners of warAttacks onciviliansFebruary 2022 Kharkiv cluster bombingKharkiv government building airstrike3 March Chernihiv bombingIrpin refugee column shellingMariupol hospital airstrikeStara Krasnianka care house attackMykolaiv cluster bombingMarch 2022 Donetsk attack2022 Borodianka airstrikesChernihiv breadline attackMariupol theatre airstrikeKyiv shopping centre bombingSumykhimprom ammonia leakMarch 2022 Kharkiv cluster bombingMykolaiv government building missile strikeBucha massacreKramatorsk railway station attackApril 2022 Kharkiv cluster bombingBilohorivka school bombingShooting of Andrii BohomazMaisky Market attackKremenchuk shopping mall attackSerhiivka missile strikeChasiv Yar missile strikeOlenivka prison massacreKharkiv dormitories missile strikeChaplyne railway station attackIzium mass gravesSeptember 2022 Donetsk attackZaporizhzhia civilian convoy attackKupiansk civilian convoy shellingZaporizhzhia residential building airstrikeRussian strikes against Ukrainian infrastructure2023 Dnipro residential building airstrikeSloviansk airstrikeUman missile strikeKramatorsk restaurant missile strikeLyman cluster bombing2023 Pokrovsk missile strikeChernihiv missile strikeKostiantynivka missile strikeHroza missile attackVolnovakha massacreDecember 2023 strikes2024 Pokrovsk missile strike2024 Donetsk attackLysychansk missile strike6 March 2024 Odesa strikeMarch 2024 strikesMay 2024 Kharkiv strikes8 July 2024 strikes2024 Kostiantynivka supermarket missile attack26 August 2024 strikesSeptember 2024 Poltava strikeNovember 2024 strikes2025 Sumy airstrikeCrimesagainstsoldiersTorture of Russian soldiers in Mala RohanTorture and castration of a Ukrainian POW in PryvilliaRape of Donetsk People's Republic soldiers by KadyrovitesMurder of Yevgeny NuzhinMakiivka surrender incidentExecution of Oleksandr Matsievskyi2022 Ukrainian prisoner of war beheadingLegal casesICC investigationArrest warrantsICJ court caseTask Force on AccountabilityUniversal jurisdictionCrime of aggressionCriminal proceedingsVadim ShishimarinAlexander Bobikin and Alexander IvanovAnton Cherednik",
                "War crimes",
                "General",
                "Accusations of genocide in DonbasAllegations of genocide of Ukrainianschild abductionsAttacks on hospitalsCluster munitionsIncendiary weaponsLandminesRussian filtration campsRussian mobile crematoriumsRussian theft of Ukrainian grainRussian torture chambersLootingSexual violenceMistreatment of prisoners of war",
                "Attacks oncivilians",
                "February 2022 Kharkiv cluster bombingKharkiv government building airstrike3 March Chernihiv bombingIrpin refugee column shellingMariupol hospital airstrikeStara Krasnianka care house attackMykolaiv cluster bombingMarch 2022 Donetsk attack2022 Borodianka airstrikesChernihiv breadline attackMariupol theatre airstrikeKyiv shopping centre bombingSumykhimprom ammonia leakMarch 2022 Kharkiv cluster bombingMykolaiv government building missile strikeBucha massacreKramatorsk railway station attackApril 2022 Kharkiv cluster bombingBilohorivka school bombingShooting of Andrii BohomazMaisky Market attackKremenchuk shopping mall attackSerhiivka missile strikeChasiv Yar missile strikeOlenivka prison massacreKharkiv dormitories missile strikeChaplyne railway station attackIzium mass gravesSeptember 2022 Donetsk attackZaporizhzhia civilian convoy attackKupiansk civilian convoy shellingZaporizhzhia residential building airstrikeRussian strikes against Ukrainian infrastructure2023 Dnipro residential building airstrikeSloviansk airstrikeUman missile strikeKramatorsk restaurant missile strikeLyman cluster bombing2023 Pokrovsk missile strikeChernihiv missile strikeKostiantynivka missile strikeHroza missile attackVolnovakha massacreDecember 2023 strikes2024 Pokrovsk missile strike2024 Donetsk attackLysychansk missile strike6 March 2024 Odesa strikeMarch 2024 strikesMay 2024 Kharkiv strikes8 July 2024 strikes2024 Kostiantynivka supermarket missile attack26 August 2024 strikesSeptember 2024 Poltava strikeNovember 2024 strikes2025 Sumy airstrike",
                "Crimesagainstsoldiers",
                "Torture of Russian soldiers in Mala RohanTorture and castration of a Ukrainian POW in PryvilliaRape of Donetsk People's Republic soldiers by KadyrovitesMurder of Yevgeny NuzhinMakiivka surrender incidentExecution of Oleksandr Matsievskyi2022 Ukrainian prisoner of war beheading",
                "Legal cases",
                "ICC investigationArrest warrantsICJ court caseTask Force on AccountabilityUniversal jurisdictionCrime of aggressionCriminal proceedingsVadim ShishimarinAlexander Bobikin and Alexander IvanovAnton Cherednik"
            ],
            {
                "vteRussian invasion of Ukraine": "War crimes"
            },
            [
                "General",
                "Accusations of genocide in DonbasAllegations of genocide of Ukrainianschild abductionsAttacks on hospitalsCluster munitionsIncendiary weaponsLandminesRussian filtration campsRussian mobile crematoriumsRussian theft of Ukrainian grainRussian torture chambersLootingSexual violenceMistreatment of prisoners of war"
            ],
            [
                "Attacks oncivilians",
                "February 2022 Kharkiv cluster bombingKharkiv government building airstrike3 March Chernihiv bombingIrpin refugee column shellingMariupol hospital airstrikeStara Krasnianka care house attackMykolaiv cluster bombingMarch 2022 Donetsk attack2022 Borodianka airstrikesChernihiv breadline attackMariupol theatre airstrikeKyiv shopping centre bombingSumykhimprom ammonia leakMarch 2022 Kharkiv cluster bombingMykolaiv government building missile strikeBucha massacreKramatorsk railway station attackApril 2022 Kharkiv cluster bombingBilohorivka school bombingShooting of Andrii BohomazMaisky Market attackKremenchuk shopping mall attackSerhiivka missile strikeChasiv Yar missile strikeOlenivka prison massacreKharkiv dormitories missile strikeChaplyne railway station attackIzium mass gravesSeptember 2022 Donetsk attackZaporizhzhia civilian convoy attackKupiansk civilian convoy shellingZaporizhzhia residential building airstrikeRussian strikes against Ukrainian infrastructure2023 Dnipro residential building airstrikeSloviansk airstrikeUman missile strikeKramatorsk restaurant missile strikeLyman cluster bombing2023 Pokrovsk missile strikeChernihiv missile strikeKostiantynivka missile strikeHroza missile attackVolnovakha massacreDecember 2023 strikes2024 Pokrovsk missile strike2024 Donetsk attackLysychansk missile strike6 March 2024 Odesa strikeMarch 2024 strikesMay 2024 Kharkiv strikes8 July 2024 strikes2024 Kostiantynivka supermarket missile attack26 August 2024 strikesSeptember 2024 Poltava strikeNovember 2024 strikes2025 Sumy airstrike"
            ],
            [
                "Crimesagainstsoldiers",
                "Torture of Russian soldiers in Mala RohanTorture and castration of a Ukrainian POW in PryvilliaRape of Donetsk People's Republic soldiers by KadyrovitesMurder of Yevgeny NuzhinMakiivka surrender incidentExecution of Oleksandr Matsievskyi2022 Ukrainian prisoner of war beheading"
            ],
            [
                "Legal cases",
                "ICC investigationArrest warrantsICJ court caseTask Force on AccountabilityUniversal jurisdictionCrime of aggressionCriminal proceedingsVadim ShishimarinAlexander Bobikin and Alexander IvanovAnton Cherednik"
            ],
            [
                "ReactionsStatesandofficialentitiesGeneralSanctionspeople and organizationsrestrictions on transit to Kaliningrad OblastMilitary aidEuropean Union Military Assistance Mission in support of UkrainePeople's BayraktarSignmyrocket.comHumanitarian aidSanctioned yachtsRelations with RussiaUkraineApplication to NATOBe Brave Like UkraineBrave1Bring Kids Back UABan on Russia-associated religious groupsCoordination Headquarters for the Treatment of Prisoners of WarDecolonization and derussification lawDeltaDestroyed Russian military equipment exhibitionFor Courage and Bravery (Ukraine)Grain From UkraineHeadquarters of the Supreme Commander-in-ChiefHero CityI Want to LiveInternational Legionand other foreign unitsBelarusian Volunteer CorpsTerror BattalionBlack Maple CompanyCanadian-Ukrainian BrigadeFreedom of Russia LegionGerman Volunteer CorpsKarelian National BattalionKastuś Kalinoŭski RegimentNorman BrigadePahonia RegimentPolish Volunteer CorpsRomanian Battlegroup GeticaRussian Volunteer CorpsSeparate Special Purpose BattalionSibir BattalionTuran BattalionInternational Sponsors of WarForced confiscation law of Russian property[ru;uk]Look for Your OwnLukoil sanctionsMartial lawMobilizationMedia Center UkraineNational Council for the Recovery of Ukraine from the War[uk]National Multi-Subject Test[uk]North Korea–Ukraine relationsPoints of InvincibilityRecognition of IchkeriaRescuer CitySave Ukrainian Culture[uk]Syria–Ukraine relationsUkrainian Freedom OrchestraUnited24United NewsRussiahighways in the annexed territoriesA290A291 \"Tavrida\"R260R280 \"Novorossiya\"2022 Moscow rally2023 Moscow rally2022 Moscow Victory Day Parade2023 Moscow Victory Day Parade2024 Moscow Victory Day Parade2023 Presidential Address to the Federal AssemblyBlockade of Ukraine[ru]Bohdan Khmelnytsky BattalionCensorship in Russia[ru]ChechnyaPro-Ukrainian Chechen fightersConmemorative Medal \"Participant of a Special Military Operation\"[ru]Conversations about Important ThingsKrasovsky caseLegalization of parallel imports[ru]Manifesto of the South Russian People's CouncilMartial lawMasha Moskalyova caseMetropolis of CrimeaMikhail Simonov caseMobilizationRecruitment of irregular forces[ru]Operation DoppelgängerOpinion polling[ru]Orthodox Christmas truce proposalWagner Group–Ministry of Defense conflictRussian Orthodox clergymen appeal against warSalvation Committee for Peace and OrderSpecial Coordinating CouncilUkraine bioweapons conspiracy theoryUnfriendly countries listWar censorship lawsWe Are Together. Sports\"What Russia Should Do with Ukraine\"United States2022 Joe Biden speech in Warsaw2022 State of the Union AddressConsolidated Appropriations Act, 2022Consolidated Appropriations Act, 2023Disinformation Governance BoardExecutive Order 14071Pentagon document leaksTask Force KleptoCaptureUkraine Defense Contact GroupUkraine Democracy Defense Lend-Lease ActUkraine Security Assistance InitiativeOther countriesBelarusCanadaCanada–Ukraine authorization for emergency travelChinaCloser ties with RussiaChinese peace planHong KongCroatiaDenmarkDanish European Union defence opt-out referendumFranceMission AigleGeorgiaGermanyGerman Taurus controversyTaurus leakZeitenwende speechHungaryIndiaOperation GangaIranCloser ties with RussiaIsraelOperation Israel GuaranteesLithuaniaMoldovaNew ZealandRussia Sanctions ActNorth KoreaPolandborder crisis with UkraineSyria[ru]TaiwanUnited KingdomEconomic Crime ActHomes for UkraineOperation Interflex2025 London Summit on UkraineCoalition of the willingUnited NationsEmergency special sessionResolution ES-11/1Resolution ES-11/2Resolution ES-11/3Resolution ES-11/4Resolution ES-11/5Resolution ES-11/6Resolution ES-11/7Security Council Resolution 2623Resolution A/RES/77/229Easter truceInternationalorganizationsAccession of Moldova to the EUAccession of Ukraine to the EUBrussels summitEuropean Political Community1st summit2nd summit3rd summitMadrid summitNATO virtual summitOperation OscarRamstein Air Base meetingEU–Ukraine SummitREPowerEUSteadfast Defender 2024SWIFT ban against Russian banksUkraine Recovery ConferenceVersailles declaration2023 Vilnius summit15th BRICS summit2024 Washington summitWeimar+OtherConsecration of RussiaF-16 training coalitionFinland–NATO relationsFinland–Russia border barrierIron diplomacyProposed Russian annexation of South OssetiaRecognition of Russia as a terrorist stateRemoval of monuments and memorialsStreets renamedUkraine Square, OsloServing heads of state and government that have visited Ukraine during the invasionSweden–NATO relationsSwedish anti-terrorism billPublicProtestsIn Ukrainein Russian-occupied Ukrainedemolition of monuments to Alexander PushkinArmWomenNowUkrainian Artistic FrontIn RussiaAngry patriotsClub of Angry PatriotsAnti-War CommitteeSuspicious deaths of Russian businesspeopleCongress of People's DeputiesCouncil of Mothers and WivesFeminist Anti-War ResistanceFlower protestsMarina OvsyannikovaRussian Action CommitteeNorth Caucasian protests2022 Russian Far East protestsState Duma initiative for charging Vladimir Putin of high treasonWhite-blue-white flagIn BelarusIn ChinaGreat Translation MovementIn Czech RepublicCzech Republic First!CompaniesAddress of the Russian Union of RectorsBoycott of Russia and Belarus\"Do not buy Russian goods!\"E.N.O.T. Corp.Igor MangushevMcDonald's in RussiaVkusno i tochkaNashStore[ru]People's SatelliteStarlink satellitesStop Bloody EnergyWagner GroupAndrey Aleksandrovich MedvedevDeath of Nemes TarimoYale CELI List of CompaniesTechnologyAnonymous and the invasionalerts.in.uaDDoS attacks on RomaniaDeepStateMap.LiveIT Army of UkraineKillnetLiveuamapOpen-source intelligencepeacenotwarRussian Asset TrackerSquad303[pl]Ukraine Siren AlertsWikipediathreat to block in Russiadetention of Mark BernsteinSpiesDiplomatic expulsions during the Russo-Ukrainian WarRussian spies in the Russo-Ukrainian WarOtherAssociation of Azovstal Defenders' FamiliesBlack Sea Grain InitiativeCollaboration with RussiaWe Are Together with RussiaConcert for UkraineFree Buryatia FoundationFree Nations of Post-Russia ForumGame4UkraineGet LostGlobal Tour for PeaceGo by the ForestGuide to the Free WorldMozart GroupOlena Zelenska FoundationOpen letter from Nobel laureatesPavel Sudoplatov BattalionRubikus.HelpUARuslan Shostak Charitable FoundationRussia's War Crimes HouseSave UkraineSaving Ukrainian Cultural Heritage OnlineSerhiy Prytula Charity FoundationSpain letter bomb attacksYermak-McFaul Expert Group on Russian SanctionsPavel FilatyevTrue RussiaVolos DeclarationWimbledon ban",
                "Reactions",
                "Statesandofficialentities",
                "GeneralSanctionspeople and organizationsrestrictions on transit to Kaliningrad OblastMilitary aidEuropean Union Military Assistance Mission in support of UkrainePeople's BayraktarSignmyrocket.comHumanitarian aidSanctioned yachtsRelations with RussiaUkraineApplication to NATOBe Brave Like UkraineBrave1Bring Kids Back UABan on Russia-associated religious groupsCoordination Headquarters for the Treatment of Prisoners of WarDecolonization and derussification lawDeltaDestroyed Russian military equipment exhibitionFor Courage and Bravery (Ukraine)Grain From UkraineHeadquarters of the Supreme Commander-in-ChiefHero CityI Want to LiveInternational Legionand other foreign unitsBelarusian Volunteer CorpsTerror BattalionBlack Maple CompanyCanadian-Ukrainian BrigadeFreedom of Russia LegionGerman Volunteer CorpsKarelian National BattalionKastuś Kalinoŭski RegimentNorman BrigadePahonia RegimentPolish Volunteer CorpsRomanian Battlegroup GeticaRussian Volunteer CorpsSeparate Special Purpose BattalionSibir BattalionTuran BattalionInternational Sponsors of WarForced confiscation law of Russian property[ru;uk]Look for Your OwnLukoil sanctionsMartial lawMobilizationMedia Center UkraineNational Council for the Recovery of Ukraine from the War[uk]National Multi-Subject Test[uk]North Korea–Ukraine relationsPoints of InvincibilityRecognition of IchkeriaRescuer CitySave Ukrainian Culture[uk]Syria–Ukraine relationsUkrainian Freedom OrchestraUnited24United NewsRussiahighways in the annexed territoriesA290A291 \"Tavrida\"R260R280 \"Novorossiya\"2022 Moscow rally2023 Moscow rally2022 Moscow Victory Day Parade2023 Moscow Victory Day Parade2024 Moscow Victory Day Parade2023 Presidential Address to the Federal AssemblyBlockade of Ukraine[ru]Bohdan Khmelnytsky BattalionCensorship in Russia[ru]ChechnyaPro-Ukrainian Chechen fightersConmemorative Medal \"Participant of a Special Military Operation\"[ru]Conversations about Important ThingsKrasovsky caseLegalization of parallel imports[ru]Manifesto of the South Russian People's CouncilMartial lawMasha Moskalyova caseMetropolis of CrimeaMikhail Simonov caseMobilizationRecruitment of irregular forces[ru]Operation DoppelgängerOpinion polling[ru]Orthodox Christmas truce proposalWagner Group–Ministry of Defense conflictRussian Orthodox clergymen appeal against warSalvation Committee for Peace and OrderSpecial Coordinating CouncilUkraine bioweapons conspiracy theoryUnfriendly countries listWar censorship lawsWe Are Together. Sports\"What Russia Should Do with Ukraine\"United States2022 Joe Biden speech in Warsaw2022 State of the Union AddressConsolidated Appropriations Act, 2022Consolidated Appropriations Act, 2023Disinformation Governance BoardExecutive Order 14071Pentagon document leaksTask Force KleptoCaptureUkraine Defense Contact GroupUkraine Democracy Defense Lend-Lease ActUkraine Security Assistance InitiativeOther countriesBelarusCanadaCanada–Ukraine authorization for emergency travelChinaCloser ties with RussiaChinese peace planHong KongCroatiaDenmarkDanish European Union defence opt-out referendumFranceMission AigleGeorgiaGermanyGerman Taurus controversyTaurus leakZeitenwende speechHungaryIndiaOperation GangaIranCloser ties with RussiaIsraelOperation Israel GuaranteesLithuaniaMoldovaNew ZealandRussia Sanctions ActNorth KoreaPolandborder crisis with UkraineSyria[ru]TaiwanUnited KingdomEconomic Crime ActHomes for UkraineOperation Interflex2025 London Summit on UkraineCoalition of the willingUnited NationsEmergency special sessionResolution ES-11/1Resolution ES-11/2Resolution ES-11/3Resolution ES-11/4Resolution ES-11/5Resolution ES-11/6Resolution ES-11/7Security Council Resolution 2623Resolution A/RES/77/229Easter truceInternationalorganizationsAccession of Moldova to the EUAccession of Ukraine to the EUBrussels summitEuropean Political Community1st summit2nd summit3rd summitMadrid summitNATO virtual summitOperation OscarRamstein Air Base meetingEU–Ukraine SummitREPowerEUSteadfast Defender 2024SWIFT ban against Russian banksUkraine Recovery ConferenceVersailles declaration2023 Vilnius summit15th BRICS summit2024 Washington summitWeimar+OtherConsecration of RussiaF-16 training coalitionFinland–NATO relationsFinland–Russia border barrierIron diplomacyProposed Russian annexation of South OssetiaRecognition of Russia as a terrorist stateRemoval of monuments and memorialsStreets renamedUkraine Square, OsloServing heads of state and government that have visited Ukraine during the invasionSweden–NATO relationsSwedish anti-terrorism bill",
                "General",
                "Sanctionspeople and organizationsrestrictions on transit to Kaliningrad OblastMilitary aidEuropean Union Military Assistance Mission in support of UkrainePeople's BayraktarSignmyrocket.comHumanitarian aidSanctioned yachtsRelations with Russia",
                "Ukraine",
                "Application to NATOBe Brave Like UkraineBrave1Bring Kids Back UABan on Russia-associated religious groupsCoordination Headquarters for the Treatment of Prisoners of WarDecolonization and derussification lawDeltaDestroyed Russian military equipment exhibitionFor Courage and Bravery (Ukraine)Grain From UkraineHeadquarters of the Supreme Commander-in-ChiefHero CityI Want to LiveInternational Legionand other foreign unitsBelarusian Volunteer CorpsTerror BattalionBlack Maple CompanyCanadian-Ukrainian BrigadeFreedom of Russia LegionGerman Volunteer CorpsKarelian National BattalionKastuś Kalinoŭski RegimentNorman BrigadePahonia RegimentPolish Volunteer CorpsRomanian Battlegroup GeticaRussian Volunteer CorpsSeparate Special Purpose BattalionSibir BattalionTuran BattalionInternational Sponsors of WarForced confiscation law of Russian property[ru;uk]Look for Your OwnLukoil sanctionsMartial lawMobilizationMedia Center UkraineNational Council for the Recovery of Ukraine from the War[uk]National Multi-Subject Test[uk]North Korea–Ukraine relationsPoints of InvincibilityRecognition of IchkeriaRescuer CitySave Ukrainian Culture[uk]Syria–Ukraine relationsUkrainian Freedom OrchestraUnited24United News",
                "Russia",
                "highways in the annexed territoriesA290A291 \"Tavrida\"R260R280 \"Novorossiya\"2022 Moscow rally2023 Moscow rally2022 Moscow Victory Day Parade2023 Moscow Victory Day Parade2024 Moscow Victory Day Parade2023 Presidential Address to the Federal AssemblyBlockade of Ukraine[ru]Bohdan Khmelnytsky BattalionCensorship in Russia[ru]ChechnyaPro-Ukrainian Chechen fightersConmemorative Medal \"Participant of a Special Military Operation\"[ru]Conversations about Important ThingsKrasovsky caseLegalization of parallel imports[ru]Manifesto of the South Russian People's CouncilMartial lawMasha Moskalyova caseMetropolis of CrimeaMikhail Simonov caseMobilizationRecruitment of irregular forces[ru]Operation DoppelgängerOpinion polling[ru]Orthodox Christmas truce proposalWagner Group–Ministry of Defense conflictRussian Orthodox clergymen appeal against warSalvation Committee for Peace and OrderSpecial Coordinating CouncilUkraine bioweapons conspiracy theoryUnfriendly countries listWar censorship lawsWe Are Together. Sports\"What Russia Should Do with Ukraine\"",
                "United States",
                "2022 Joe Biden speech in Warsaw2022 State of the Union AddressConsolidated Appropriations Act, 2022Consolidated Appropriations Act, 2023Disinformation Governance BoardExecutive Order 14071Pentagon document leaksTask Force KleptoCaptureUkraine Defense Contact GroupUkraine Democracy Defense Lend-Lease ActUkraine Security Assistance Initiative",
                "Other countries",
                "BelarusCanadaCanada–Ukraine authorization for emergency travelChinaCloser ties with RussiaChinese peace planHong KongCroatiaDenmarkDanish European Union defence opt-out referendumFranceMission AigleGeorgiaGermanyGerman Taurus controversyTaurus leakZeitenwende speechHungaryIndiaOperation GangaIranCloser ties with RussiaIsraelOperation Israel GuaranteesLithuaniaMoldovaNew ZealandRussia Sanctions ActNorth KoreaPolandborder crisis with UkraineSyria[ru]TaiwanUnited KingdomEconomic Crime ActHomes for UkraineOperation Interflex2025 London Summit on UkraineCoalition of the willing",
                "United Nations",
                "Emergency special sessionResolution ES-11/1Resolution ES-11/2Resolution ES-11/3Resolution ES-11/4Resolution ES-11/5Resolution ES-11/6Resolution ES-11/7Security Council Resolution 2623Resolution A/RES/77/229Easter truce",
                "Internationalorganizations",
                "Accession of Moldova to the EUAccession of Ukraine to the EUBrussels summitEuropean Political Community1st summit2nd summit3rd summitMadrid summitNATO virtual summitOperation OscarRamstein Air Base meetingEU–Ukraine SummitREPowerEUSteadfast Defender 2024SWIFT ban against Russian banksUkraine Recovery ConferenceVersailles declaration2023 Vilnius summit15th BRICS summit2024 Washington summitWeimar+",
                "Other",
                "Consecration of RussiaF-16 training coalitionFinland–NATO relationsFinland–Russia border barrierIron diplomacyProposed Russian annexation of South OssetiaRecognition of Russia as a terrorist stateRemoval of monuments and memorialsStreets renamedUkraine Square, OsloServing heads of state and government that have visited Ukraine during the invasionSweden–NATO relationsSwedish anti-terrorism bill",
                "Public",
                "ProtestsIn Ukrainein Russian-occupied Ukrainedemolition of monuments to Alexander PushkinArmWomenNowUkrainian Artistic FrontIn RussiaAngry patriotsClub of Angry PatriotsAnti-War CommitteeSuspicious deaths of Russian businesspeopleCongress of People's DeputiesCouncil of Mothers and WivesFeminist Anti-War ResistanceFlower protestsMarina OvsyannikovaRussian Action CommitteeNorth Caucasian protests2022 Russian Far East protestsState Duma initiative for charging Vladimir Putin of high treasonWhite-blue-white flagIn BelarusIn ChinaGreat Translation MovementIn Czech RepublicCzech Republic First!CompaniesAddress of the Russian Union of RectorsBoycott of Russia and Belarus\"Do not buy Russian goods!\"E.N.O.T. Corp.Igor MangushevMcDonald's in RussiaVkusno i tochkaNashStore[ru]People's SatelliteStarlink satellitesStop Bloody EnergyWagner GroupAndrey Aleksandrovich MedvedevDeath of Nemes TarimoYale CELI List of CompaniesTechnologyAnonymous and the invasionalerts.in.uaDDoS attacks on RomaniaDeepStateMap.LiveIT Army of UkraineKillnetLiveuamapOpen-source intelligencepeacenotwarRussian Asset TrackerSquad303[pl]Ukraine Siren AlertsWikipediathreat to block in Russiadetention of Mark BernsteinSpiesDiplomatic expulsions during the Russo-Ukrainian WarRussian spies in the Russo-Ukrainian WarOtherAssociation of Azovstal Defenders' FamiliesBlack Sea Grain InitiativeCollaboration with RussiaWe Are Together with RussiaConcert for UkraineFree Buryatia FoundationFree Nations of Post-Russia ForumGame4UkraineGet LostGlobal Tour for PeaceGo by the ForestGuide to the Free WorldMozart GroupOlena Zelenska FoundationOpen letter from Nobel laureatesPavel Sudoplatov BattalionRubikus.HelpUARuslan Shostak Charitable FoundationRussia's War Crimes HouseSave UkraineSaving Ukrainian Cultural Heritage OnlineSerhiy Prytula Charity FoundationSpain letter bomb attacksYermak-McFaul Expert Group on Russian SanctionsPavel FilatyevTrue RussiaVolos DeclarationWimbledon ban",
                "Protests",
                "In Ukrainein Russian-occupied Ukrainedemolition of monuments to Alexander PushkinArmWomenNowUkrainian Artistic FrontIn RussiaAngry patriotsClub of Angry PatriotsAnti-War CommitteeSuspicious deaths of Russian businesspeopleCongress of People's DeputiesCouncil of Mothers and WivesFeminist Anti-War ResistanceFlower protestsMarina OvsyannikovaRussian Action CommitteeNorth Caucasian protests2022 Russian Far East protestsState Duma initiative for charging Vladimir Putin of high treasonWhite-blue-white flagIn BelarusIn ChinaGreat Translation MovementIn Czech RepublicCzech Republic First!",
                "Companies",
                "Address of the Russian Union of RectorsBoycott of Russia and Belarus\"Do not buy Russian goods!\"E.N.O.T. Corp.Igor MangushevMcDonald's in RussiaVkusno i tochkaNashStore[ru]People's SatelliteStarlink satellitesStop Bloody EnergyWagner GroupAndrey Aleksandrovich MedvedevDeath of Nemes TarimoYale CELI List of Companies",
                "Technology",
                "Anonymous and the invasionalerts.in.uaDDoS attacks on RomaniaDeepStateMap.LiveIT Army of UkraineKillnetLiveuamapOpen-source intelligencepeacenotwarRussian Asset TrackerSquad303[pl]Ukraine Siren AlertsWikipediathreat to block in Russiadetention of Mark Bernstein",
                "Spies",
                "Diplomatic expulsions during the Russo-Ukrainian WarRussian spies in the Russo-Ukrainian War",
                "Other",
                "Association of Azovstal Defenders' FamiliesBlack Sea Grain InitiativeCollaboration with RussiaWe Are Together with RussiaConcert for UkraineFree Buryatia FoundationFree Nations of Post-Russia ForumGame4UkraineGet LostGlobal Tour for PeaceGo by the ForestGuide to the Free WorldMozart GroupOlena Zelenska FoundationOpen letter from Nobel laureatesPavel Sudoplatov BattalionRubikus.HelpUARuslan Shostak Charitable FoundationRussia's War Crimes HouseSave UkraineSaving Ukrainian Cultural Heritage OnlineSerhiy Prytula Charity FoundationSpain letter bomb attacksYermak-McFaul Expert Group on Russian SanctionsPavel FilatyevTrue RussiaVolos DeclarationWimbledon ban"
            ],
            {
                "vteRussian invasion of Ukraine": "Reactions"
            },
            [
                "Statesandofficialentities",
                "GeneralSanctionspeople and organizationsrestrictions on transit to Kaliningrad OblastMilitary aidEuropean Union Military Assistance Mission in support of UkrainePeople's BayraktarSignmyrocket.comHumanitarian aidSanctioned yachtsRelations with RussiaUkraineApplication to NATOBe Brave Like UkraineBrave1Bring Kids Back UABan on Russia-associated religious groupsCoordination Headquarters for the Treatment of Prisoners of WarDecolonization and derussification lawDeltaDestroyed Russian military equipment exhibitionFor Courage and Bravery (Ukraine)Grain From UkraineHeadquarters of the Supreme Commander-in-ChiefHero CityI Want to LiveInternational Legionand other foreign unitsBelarusian Volunteer CorpsTerror BattalionBlack Maple CompanyCanadian-Ukrainian BrigadeFreedom of Russia LegionGerman Volunteer CorpsKarelian National BattalionKastuś Kalinoŭski RegimentNorman BrigadePahonia RegimentPolish Volunteer CorpsRomanian Battlegroup GeticaRussian Volunteer CorpsSeparate Special Purpose BattalionSibir BattalionTuran BattalionInternational Sponsors of WarForced confiscation law of Russian property[ru;uk]Look for Your OwnLukoil sanctionsMartial lawMobilizationMedia Center UkraineNational Council for the Recovery of Ukraine from the War[uk]National Multi-Subject Test[uk]North Korea–Ukraine relationsPoints of InvincibilityRecognition of IchkeriaRescuer CitySave Ukrainian Culture[uk]Syria–Ukraine relationsUkrainian Freedom OrchestraUnited24United NewsRussiahighways in the annexed territoriesA290A291 \"Tavrida\"R260R280 \"Novorossiya\"2022 Moscow rally2023 Moscow rally2022 Moscow Victory Day Parade2023 Moscow Victory Day Parade2024 Moscow Victory Day Parade2023 Presidential Address to the Federal AssemblyBlockade of Ukraine[ru]Bohdan Khmelnytsky BattalionCensorship in Russia[ru]ChechnyaPro-Ukrainian Chechen fightersConmemorative Medal \"Participant of a Special Military Operation\"[ru]Conversations about Important ThingsKrasovsky caseLegalization of parallel imports[ru]Manifesto of the South Russian People's CouncilMartial lawMasha Moskalyova caseMetropolis of CrimeaMikhail Simonov caseMobilizationRecruitment of irregular forces[ru]Operation DoppelgängerOpinion polling[ru]Orthodox Christmas truce proposalWagner Group–Ministry of Defense conflictRussian Orthodox clergymen appeal against warSalvation Committee for Peace and OrderSpecial Coordinating CouncilUkraine bioweapons conspiracy theoryUnfriendly countries listWar censorship lawsWe Are Together. Sports\"What Russia Should Do with Ukraine\"United States2022 Joe Biden speech in Warsaw2022 State of the Union AddressConsolidated Appropriations Act, 2022Consolidated Appropriations Act, 2023Disinformation Governance BoardExecutive Order 14071Pentagon document leaksTask Force KleptoCaptureUkraine Defense Contact GroupUkraine Democracy Defense Lend-Lease ActUkraine Security Assistance InitiativeOther countriesBelarusCanadaCanada–Ukraine authorization for emergency travelChinaCloser ties with RussiaChinese peace planHong KongCroatiaDenmarkDanish European Union defence opt-out referendumFranceMission AigleGeorgiaGermanyGerman Taurus controversyTaurus leakZeitenwende speechHungaryIndiaOperation GangaIranCloser ties with RussiaIsraelOperation Israel GuaranteesLithuaniaMoldovaNew ZealandRussia Sanctions ActNorth KoreaPolandborder crisis with UkraineSyria[ru]TaiwanUnited KingdomEconomic Crime ActHomes for UkraineOperation Interflex2025 London Summit on UkraineCoalition of the willingUnited NationsEmergency special sessionResolution ES-11/1Resolution ES-11/2Resolution ES-11/3Resolution ES-11/4Resolution ES-11/5Resolution ES-11/6Resolution ES-11/7Security Council Resolution 2623Resolution A/RES/77/229Easter truceInternationalorganizationsAccession of Moldova to the EUAccession of Ukraine to the EUBrussels summitEuropean Political Community1st summit2nd summit3rd summitMadrid summitNATO virtual summitOperation OscarRamstein Air Base meetingEU–Ukraine SummitREPowerEUSteadfast Defender 2024SWIFT ban against Russian banksUkraine Recovery ConferenceVersailles declaration2023 Vilnius summit15th BRICS summit2024 Washington summitWeimar+OtherConsecration of RussiaF-16 training coalitionFinland–NATO relationsFinland–Russia border barrierIron diplomacyProposed Russian annexation of South OssetiaRecognition of Russia as a terrorist stateRemoval of monuments and memorialsStreets renamedUkraine Square, OsloServing heads of state and government that have visited Ukraine during the invasionSweden–NATO relationsSwedish anti-terrorism bill",
                "General",
                "Sanctionspeople and organizationsrestrictions on transit to Kaliningrad OblastMilitary aidEuropean Union Military Assistance Mission in support of UkrainePeople's BayraktarSignmyrocket.comHumanitarian aidSanctioned yachtsRelations with Russia",
                "Ukraine",
                "Application to NATOBe Brave Like UkraineBrave1Bring Kids Back UABan on Russia-associated religious groupsCoordination Headquarters for the Treatment of Prisoners of WarDecolonization and derussification lawDeltaDestroyed Russian military equipment exhibitionFor Courage and Bravery (Ukraine)Grain From UkraineHeadquarters of the Supreme Commander-in-ChiefHero CityI Want to LiveInternational Legionand other foreign unitsBelarusian Volunteer CorpsTerror BattalionBlack Maple CompanyCanadian-Ukrainian BrigadeFreedom of Russia LegionGerman Volunteer CorpsKarelian National BattalionKastuś Kalinoŭski RegimentNorman BrigadePahonia RegimentPolish Volunteer CorpsRomanian Battlegroup GeticaRussian Volunteer CorpsSeparate Special Purpose BattalionSibir BattalionTuran BattalionInternational Sponsors of WarForced confiscation law of Russian property[ru;uk]Look for Your OwnLukoil sanctionsMartial lawMobilizationMedia Center UkraineNational Council for the Recovery of Ukraine from the War[uk]National Multi-Subject Test[uk]North Korea–Ukraine relationsPoints of InvincibilityRecognition of IchkeriaRescuer CitySave Ukrainian Culture[uk]Syria–Ukraine relationsUkrainian Freedom OrchestraUnited24United News",
                "Russia",
                "highways in the annexed territoriesA290A291 \"Tavrida\"R260R280 \"Novorossiya\"2022 Moscow rally2023 Moscow rally2022 Moscow Victory Day Parade2023 Moscow Victory Day Parade2024 Moscow Victory Day Parade2023 Presidential Address to the Federal AssemblyBlockade of Ukraine[ru]Bohdan Khmelnytsky BattalionCensorship in Russia[ru]ChechnyaPro-Ukrainian Chechen fightersConmemorative Medal \"Participant of a Special Military Operation\"[ru]Conversations about Important ThingsKrasovsky caseLegalization of parallel imports[ru]Manifesto of the South Russian People's CouncilMartial lawMasha Moskalyova caseMetropolis of CrimeaMikhail Simonov caseMobilizationRecruitment of irregular forces[ru]Operation DoppelgängerOpinion polling[ru]Orthodox Christmas truce proposalWagner Group–Ministry of Defense conflictRussian Orthodox clergymen appeal against warSalvation Committee for Peace and OrderSpecial Coordinating CouncilUkraine bioweapons conspiracy theoryUnfriendly countries listWar censorship lawsWe Are Together. Sports\"What Russia Should Do with Ukraine\"",
                "United States",
                "2022 Joe Biden speech in Warsaw2022 State of the Union AddressConsolidated Appropriations Act, 2022Consolidated Appropriations Act, 2023Disinformation Governance BoardExecutive Order 14071Pentagon document leaksTask Force KleptoCaptureUkraine Defense Contact GroupUkraine Democracy Defense Lend-Lease ActUkraine Security Assistance Initiative",
                "Other countries",
                "BelarusCanadaCanada–Ukraine authorization for emergency travelChinaCloser ties with RussiaChinese peace planHong KongCroatiaDenmarkDanish European Union defence opt-out referendumFranceMission AigleGeorgiaGermanyGerman Taurus controversyTaurus leakZeitenwende speechHungaryIndiaOperation GangaIranCloser ties with RussiaIsraelOperation Israel GuaranteesLithuaniaMoldovaNew ZealandRussia Sanctions ActNorth KoreaPolandborder crisis with UkraineSyria[ru]TaiwanUnited KingdomEconomic Crime ActHomes for UkraineOperation Interflex2025 London Summit on UkraineCoalition of the willing",
                "United Nations",
                "Emergency special sessionResolution ES-11/1Resolution ES-11/2Resolution ES-11/3Resolution ES-11/4Resolution ES-11/5Resolution ES-11/6Resolution ES-11/7Security Council Resolution 2623Resolution A/RES/77/229Easter truce",
                "Internationalorganizations",
                "Accession of Moldova to the EUAccession of Ukraine to the EUBrussels summitEuropean Political Community1st summit2nd summit3rd summitMadrid summitNATO virtual summitOperation OscarRamstein Air Base meetingEU–Ukraine SummitREPowerEUSteadfast Defender 2024SWIFT ban against Russian banksUkraine Recovery ConferenceVersailles declaration2023 Vilnius summit15th BRICS summit2024 Washington summitWeimar+",
                "Other",
                "Consecration of RussiaF-16 training coalitionFinland–NATO relationsFinland–Russia border barrierIron diplomacyProposed Russian annexation of South OssetiaRecognition of Russia as a terrorist stateRemoval of monuments and memorialsStreets renamedUkraine Square, OsloServing heads of state and government that have visited Ukraine during the invasionSweden–NATO relationsSwedish anti-terrorism bill"
            ],
            [
                "General",
                "Sanctionspeople and organizationsrestrictions on transit to Kaliningrad OblastMilitary aidEuropean Union Military Assistance Mission in support of UkrainePeople's BayraktarSignmyrocket.comHumanitarian aidSanctioned yachtsRelations with Russia"
            ],
            [
                "Ukraine",
                "Application to NATOBe Brave Like UkraineBrave1Bring Kids Back UABan on Russia-associated religious groupsCoordination Headquarters for the Treatment of Prisoners of WarDecolonization and derussification lawDeltaDestroyed Russian military equipment exhibitionFor Courage and Bravery (Ukraine)Grain From UkraineHeadquarters of the Supreme Commander-in-ChiefHero CityI Want to LiveInternational Legionand other foreign unitsBelarusian Volunteer CorpsTerror BattalionBlack Maple CompanyCanadian-Ukrainian BrigadeFreedom of Russia LegionGerman Volunteer CorpsKarelian National BattalionKastuś Kalinoŭski RegimentNorman BrigadePahonia RegimentPolish Volunteer CorpsRomanian Battlegroup GeticaRussian Volunteer CorpsSeparate Special Purpose BattalionSibir BattalionTuran BattalionInternational Sponsors of WarForced confiscation law of Russian property[ru;uk]Look for Your OwnLukoil sanctionsMartial lawMobilizationMedia Center UkraineNational Council for the Recovery of Ukraine from the War[uk]National Multi-Subject Test[uk]North Korea–Ukraine relationsPoints of InvincibilityRecognition of IchkeriaRescuer CitySave Ukrainian Culture[uk]Syria–Ukraine relationsUkrainian Freedom OrchestraUnited24United News"
            ],
            [
                "Russia",
                "highways in the annexed territoriesA290A291 \"Tavrida\"R260R280 \"Novorossiya\"2022 Moscow rally2023 Moscow rally2022 Moscow Victory Day Parade2023 Moscow Victory Day Parade2024 Moscow Victory Day Parade2023 Presidential Address to the Federal AssemblyBlockade of Ukraine[ru]Bohdan Khmelnytsky BattalionCensorship in Russia[ru]ChechnyaPro-Ukrainian Chechen fightersConmemorative Medal \"Participant of a Special Military Operation\"[ru]Conversations about Important ThingsKrasovsky caseLegalization of parallel imports[ru]Manifesto of the South Russian People's CouncilMartial lawMasha Moskalyova caseMetropolis of CrimeaMikhail Simonov caseMobilizationRecruitment of irregular forces[ru]Operation DoppelgängerOpinion polling[ru]Orthodox Christmas truce proposalWagner Group–Ministry of Defense conflictRussian Orthodox clergymen appeal against warSalvation Committee for Peace and OrderSpecial Coordinating CouncilUkraine bioweapons conspiracy theoryUnfriendly countries listWar censorship lawsWe Are Together. Sports\"What Russia Should Do with Ukraine\""
            ],
            [
                "United States",
                "2022 Joe Biden speech in Warsaw2022 State of the Union AddressConsolidated Appropriations Act, 2022Consolidated Appropriations Act, 2023Disinformation Governance BoardExecutive Order 14071Pentagon document leaksTask Force KleptoCaptureUkraine Defense Contact GroupUkraine Democracy Defense Lend-Lease ActUkraine Security Assistance Initiative"
            ],
            [
                "Other countries",
                "BelarusCanadaCanada–Ukraine authorization for emergency travelChinaCloser ties with RussiaChinese peace planHong KongCroatiaDenmarkDanish European Union defence opt-out referendumFranceMission AigleGeorgiaGermanyGerman Taurus controversyTaurus leakZeitenwende speechHungaryIndiaOperation GangaIranCloser ties with RussiaIsraelOperation Israel GuaranteesLithuaniaMoldovaNew ZealandRussia Sanctions ActNorth KoreaPolandborder crisis with UkraineSyria[ru]TaiwanUnited KingdomEconomic Crime ActHomes for UkraineOperation Interflex2025 London Summit on UkraineCoalition of the willing"
            ],
            [
                "United Nations",
                "Emergency special sessionResolution ES-11/1Resolution ES-11/2Resolution ES-11/3Resolution ES-11/4Resolution ES-11/5Resolution ES-11/6Resolution ES-11/7Security Council Resolution 2623Resolution A/RES/77/229Easter truce"
            ],
            [
                "Internationalorganizations",
                "Accession of Moldova to the EUAccession of Ukraine to the EUBrussels summitEuropean Political Community1st summit2nd summit3rd summitMadrid summitNATO virtual summitOperation OscarRamstein Air Base meetingEU–Ukraine SummitREPowerEUSteadfast Defender 2024SWIFT ban against Russian banksUkraine Recovery ConferenceVersailles declaration2023 Vilnius summit15th BRICS summit2024 Washington summitWeimar+"
            ],
            [
                "Other",
                "Consecration of RussiaF-16 training coalitionFinland–NATO relationsFinland–Russia border barrierIron diplomacyProposed Russian annexation of South OssetiaRecognition of Russia as a terrorist stateRemoval of monuments and memorialsStreets renamedUkraine Square, OsloServing heads of state and government that have visited Ukraine during the invasionSweden–NATO relationsSwedish anti-terrorism bill"
            ],
            [
                "Public",
                "ProtestsIn Ukrainein Russian-occupied Ukrainedemolition of monuments to Alexander PushkinArmWomenNowUkrainian Artistic FrontIn RussiaAngry patriotsClub of Angry PatriotsAnti-War CommitteeSuspicious deaths of Russian businesspeopleCongress of People's DeputiesCouncil of Mothers and WivesFeminist Anti-War ResistanceFlower protestsMarina OvsyannikovaRussian Action CommitteeNorth Caucasian protests2022 Russian Far East protestsState Duma initiative for charging Vladimir Putin of high treasonWhite-blue-white flagIn BelarusIn ChinaGreat Translation MovementIn Czech RepublicCzech Republic First!CompaniesAddress of the Russian Union of RectorsBoycott of Russia and Belarus\"Do not buy Russian goods!\"E.N.O.T. Corp.Igor MangushevMcDonald's in RussiaVkusno i tochkaNashStore[ru]People's SatelliteStarlink satellitesStop Bloody EnergyWagner GroupAndrey Aleksandrovich MedvedevDeath of Nemes TarimoYale CELI List of CompaniesTechnologyAnonymous and the invasionalerts.in.uaDDoS attacks on RomaniaDeepStateMap.LiveIT Army of UkraineKillnetLiveuamapOpen-source intelligencepeacenotwarRussian Asset TrackerSquad303[pl]Ukraine Siren AlertsWikipediathreat to block in Russiadetention of Mark BernsteinSpiesDiplomatic expulsions during the Russo-Ukrainian WarRussian spies in the Russo-Ukrainian WarOtherAssociation of Azovstal Defenders' FamiliesBlack Sea Grain InitiativeCollaboration with RussiaWe Are Together with RussiaConcert for UkraineFree Buryatia FoundationFree Nations of Post-Russia ForumGame4UkraineGet LostGlobal Tour for PeaceGo by the ForestGuide to the Free WorldMozart GroupOlena Zelenska FoundationOpen letter from Nobel laureatesPavel Sudoplatov BattalionRubikus.HelpUARuslan Shostak Charitable FoundationRussia's War Crimes HouseSave UkraineSaving Ukrainian Cultural Heritage OnlineSerhiy Prytula Charity FoundationSpain letter bomb attacksYermak-McFaul Expert Group on Russian SanctionsPavel FilatyevTrue RussiaVolos DeclarationWimbledon ban",
                "Protests",
                "In Ukrainein Russian-occupied Ukrainedemolition of monuments to Alexander PushkinArmWomenNowUkrainian Artistic FrontIn RussiaAngry patriotsClub of Angry PatriotsAnti-War CommitteeSuspicious deaths of Russian businesspeopleCongress of People's DeputiesCouncil of Mothers and WivesFeminist Anti-War ResistanceFlower protestsMarina OvsyannikovaRussian Action CommitteeNorth Caucasian protests2022 Russian Far East protestsState Duma initiative for charging Vladimir Putin of high treasonWhite-blue-white flagIn BelarusIn ChinaGreat Translation MovementIn Czech RepublicCzech Republic First!",
                "Companies",
                "Address of the Russian Union of RectorsBoycott of Russia and Belarus\"Do not buy Russian goods!\"E.N.O.T. Corp.Igor MangushevMcDonald's in RussiaVkusno i tochkaNashStore[ru]People's SatelliteStarlink satellitesStop Bloody EnergyWagner GroupAndrey Aleksandrovich MedvedevDeath of Nemes TarimoYale CELI List of Companies",
                "Technology",
                "Anonymous and the invasionalerts.in.uaDDoS attacks on RomaniaDeepStateMap.LiveIT Army of UkraineKillnetLiveuamapOpen-source intelligencepeacenotwarRussian Asset TrackerSquad303[pl]Ukraine Siren AlertsWikipediathreat to block in Russiadetention of Mark Bernstein",
                "Spies",
                "Diplomatic expulsions during the Russo-Ukrainian WarRussian spies in the Russo-Ukrainian War",
                "Other",
                "Association of Azovstal Defenders' FamiliesBlack Sea Grain InitiativeCollaboration with RussiaWe Are Together with RussiaConcert for UkraineFree Buryatia FoundationFree Nations of Post-Russia ForumGame4UkraineGet LostGlobal Tour for PeaceGo by the ForestGuide to the Free WorldMozart GroupOlena Zelenska FoundationOpen letter from Nobel laureatesPavel Sudoplatov BattalionRubikus.HelpUARuslan Shostak Charitable FoundationRussia's War Crimes HouseSave UkraineSaving Ukrainian Cultural Heritage OnlineSerhiy Prytula Charity FoundationSpain letter bomb attacksYermak-McFaul Expert Group on Russian SanctionsPavel FilatyevTrue RussiaVolos DeclarationWimbledon ban"
            ],
            [
                "Protests",
                "In Ukrainein Russian-occupied Ukrainedemolition of monuments to Alexander PushkinArmWomenNowUkrainian Artistic FrontIn RussiaAngry patriotsClub of Angry PatriotsAnti-War CommitteeSuspicious deaths of Russian businesspeopleCongress of People's DeputiesCouncil of Mothers and WivesFeminist Anti-War ResistanceFlower protestsMarina OvsyannikovaRussian Action CommitteeNorth Caucasian protests2022 Russian Far East protestsState Duma initiative for charging Vladimir Putin of high treasonWhite-blue-white flagIn BelarusIn ChinaGreat Translation MovementIn Czech RepublicCzech Republic First!"
            ],
            [
                "Companies",
                "Address of the Russian Union of RectorsBoycott of Russia and Belarus\"Do not buy Russian goods!\"E.N.O.T. Corp.Igor MangushevMcDonald's in RussiaVkusno i tochkaNashStore[ru]People's SatelliteStarlink satellitesStop Bloody EnergyWagner GroupAndrey Aleksandrovich MedvedevDeath of Nemes TarimoYale CELI List of Companies"
            ],
            [
                "Technology",
                "Anonymous and the invasionalerts.in.uaDDoS attacks on RomaniaDeepStateMap.LiveIT Army of UkraineKillnetLiveuamapOpen-source intelligencepeacenotwarRussian Asset TrackerSquad303[pl]Ukraine Siren AlertsWikipediathreat to block in Russiadetention of Mark Bernstein"
            ],
            [
                "Spies",
                "Diplomatic expulsions during the Russo-Ukrainian WarRussian spies in the Russo-Ukrainian War"
            ],
            [
                "Other",
                "Association of Azovstal Defenders' FamiliesBlack Sea Grain InitiativeCollaboration with RussiaWe Are Together with RussiaConcert for UkraineFree Buryatia FoundationFree Nations of Post-Russia ForumGame4UkraineGet LostGlobal Tour for PeaceGo by the ForestGuide to the Free WorldMozart GroupOlena Zelenska FoundationOpen letter from Nobel laureatesPavel Sudoplatov BattalionRubikus.HelpUARuslan Shostak Charitable FoundationRussia's War Crimes HouseSave UkraineSaving Ukrainian Cultural Heritage OnlineSerhiy Prytula Charity FoundationSpain letter bomb attacksYermak-McFaul Expert Group on Russian SanctionsPavel FilatyevTrue RussiaVolos DeclarationWimbledon ban"
            ],
            [
                "ImpactEffectsAircraft lossesCasualtiesjournalists killedRussian generals killedEconomic impactInflation surge2022 Moldovan energy crisisprotests2025 Moldovan energy crisisRussia–EU gas dispute2022 Nord Stream pipeline sabotageRussian debt default2022 Russian oil price cap2022-2024 German economic crisis2023 Russian oil products sanctions and price capEU natural gas price capEducationEnd of the Whisky WarEnvironmental impactEuropean re-armamentEurovision Song Contest 2022RussiaUkraineEurovision Song Contest 2023Food crisesImpact on theatre[uk]List of notable deathsLukoil oil transit disputeNuclear power plantsZaporizhzhia Nuclear Power Plant crisisNuclear riskReligionRussian emigrationThe ArkShip lossesUkrainian cultural heritageart theft and lootingdamaged cultural sitesTraumaUrengoy–Pomary–Uzhhorod pipeline explosionUkrainian energy crisisViolations of non-combatant airspacesWomenHumanrightsHumanitarian impactUkrainian refugee crisis2025 Amsterdam stabbing attackSobieskiego 100UN Commission of InquiryUN Human Rights Monitoring MissionTerms andphrases\"And now I will show you where the attack on Belarus was prepared from\"\"Anglo-Saxons\"\"Bavovna\"\"Grandpa in his bunker\"\"Good evening, we are from Ukraine\"\"Orc\"\"Putin khuylo!\"\"Khuy Voyne!\"\"Russia is here forever[uk]\"\"Russian warship, go fuck yourself\"\"Slava Ukraini!\"\"Special military operation\"\"To bomb Voronezh\"\"Strength is in truth\"\"Westsplaining\"\"Where have you been for eight years?\"\"Without you\"PopularcultureSongs\"12\"\"Bakhmut Fortress\"\"Bayraktar\"\"Bilia topoli\"\"City of Mary\"\"Flowers of Minefields\"\"Generation Cancellation\"\"Generation Z\"\"I'm Russian\"\"Oyda\"\"Hey, Hey, Rise Up!\"\"Mama ŠČ!\"\"Oi u luzi chervona kalyna\"\"Slava Ukraini!\"\"Stefania\"\"Ukraine\"\"Crushed\"Films20 Days in MariupolA Rising FuryFollow MeInterceptedRussians at WarTurn in the WoundUkraine on Fire 2[uk]OtherBabylon'13Back to the Cold WarBorodianka cat[uk]Ghost of KyivKherson watermelonKrálovec RegionMadonna of KyivNorth Atlantic Fella OrganizationNewspeak in Russia[ru;uk]Patron\"Putler\"\"Putinversteher\"Raccoon of KhersonSaint JavelinSaint Mariuburg[ru;uk]Vasylkiv maiolica roosterVladimir Putin's meeting tableWalk of the Brave\"Z\" military symbol",
                "Impact",
                "Effects",
                "Aircraft lossesCasualtiesjournalists killedRussian generals killedEconomic impactInflation surge2022 Moldovan energy crisisprotests2025 Moldovan energy crisisRussia–EU gas dispute2022 Nord Stream pipeline sabotageRussian debt default2022 Russian oil price cap2022-2024 German economic crisis2023 Russian oil products sanctions and price capEU natural gas price capEducationEnd of the Whisky WarEnvironmental impactEuropean re-armamentEurovision Song Contest 2022RussiaUkraineEurovision Song Contest 2023Food crisesImpact on theatre[uk]List of notable deathsLukoil oil transit disputeNuclear power plantsZaporizhzhia Nuclear Power Plant crisisNuclear riskReligionRussian emigrationThe ArkShip lossesUkrainian cultural heritageart theft and lootingdamaged cultural sitesTraumaUrengoy–Pomary–Uzhhorod pipeline explosionUkrainian energy crisisViolations of non-combatant airspacesWomen",
                "Humanrights",
                "Humanitarian impactUkrainian refugee crisis2025 Amsterdam stabbing attackSobieskiego 100UN Commission of InquiryUN Human Rights Monitoring Mission",
                "Terms andphrases",
                "\"And now I will show you where the attack on Belarus was prepared from\"\"Anglo-Saxons\"\"Bavovna\"\"Grandpa in his bunker\"\"Good evening, we are from Ukraine\"\"Orc\"\"Putin khuylo!\"\"Khuy Voyne!\"\"Russia is here forever[uk]\"\"Russian warship, go fuck yourself\"\"Slava Ukraini!\"\"Special military operation\"\"To bomb Voronezh\"\"Strength is in truth\"\"Westsplaining\"\"Where have you been for eight years?\"\"Without you\"",
                "Popularculture",
                "Songs\"12\"\"Bakhmut Fortress\"\"Bayraktar\"\"Bilia topoli\"\"City of Mary\"\"Flowers of Minefields\"\"Generation Cancellation\"\"Generation Z\"\"I'm Russian\"\"Oyda\"\"Hey, Hey, Rise Up!\"\"Mama ŠČ!\"\"Oi u luzi chervona kalyna\"\"Slava Ukraini!\"\"Stefania\"\"Ukraine\"\"Crushed\"Films20 Days in MariupolA Rising FuryFollow MeInterceptedRussians at WarTurn in the WoundUkraine on Fire 2[uk]OtherBabylon'13Back to the Cold WarBorodianka cat[uk]Ghost of KyivKherson watermelonKrálovec RegionMadonna of KyivNorth Atlantic Fella OrganizationNewspeak in Russia[ru;uk]Patron\"Putler\"\"Putinversteher\"Raccoon of KhersonSaint JavelinSaint Mariuburg[ru;uk]Vasylkiv maiolica roosterVladimir Putin's meeting tableWalk of the Brave\"Z\" military symbol",
                "Songs",
                "\"12\"\"Bakhmut Fortress\"\"Bayraktar\"\"Bilia topoli\"\"City of Mary\"\"Flowers of Minefields\"\"Generation Cancellation\"\"Generation Z\"\"I'm Russian\"\"Oyda\"\"Hey, Hey, Rise Up!\"\"Mama ŠČ!\"\"Oi u luzi chervona kalyna\"\"Slava Ukraini!\"\"Stefania\"\"Ukraine\"\"Crushed\"",
                "Films",
                "20 Days in MariupolA Rising FuryFollow MeInterceptedRussians at WarTurn in the WoundUkraine on Fire 2[uk]",
                "Other",
                "Babylon'13Back to the Cold WarBorodianka cat[uk]Ghost of KyivKherson watermelonKrálovec RegionMadonna of KyivNorth Atlantic Fella OrganizationNewspeak in Russia[ru;uk]Patron\"Putler\"\"Putinversteher\"Raccoon of KhersonSaint JavelinSaint Mariuburg[ru;uk]Vasylkiv maiolica roosterVladimir Putin's meeting tableWalk of the Brave\"Z\" military symbol"
            ],
            {
                "vteRussian invasion of Ukraine": "Impact"
            },
            [
                "Effects",
                "Aircraft lossesCasualtiesjournalists killedRussian generals killedEconomic impactInflation surge2022 Moldovan energy crisisprotests2025 Moldovan energy crisisRussia–EU gas dispute2022 Nord Stream pipeline sabotageRussian debt default2022 Russian oil price cap2022-2024 German economic crisis2023 Russian oil products sanctions and price capEU natural gas price capEducationEnd of the Whisky WarEnvironmental impactEuropean re-armamentEurovision Song Contest 2022RussiaUkraineEurovision Song Contest 2023Food crisesImpact on theatre[uk]List of notable deathsLukoil oil transit disputeNuclear power plantsZaporizhzhia Nuclear Power Plant crisisNuclear riskReligionRussian emigrationThe ArkShip lossesUkrainian cultural heritageart theft and lootingdamaged cultural sitesTraumaUrengoy–Pomary–Uzhhorod pipeline explosionUkrainian energy crisisViolations of non-combatant airspacesWomen"
            ],
            [
                "Humanrights",
                "Humanitarian impactUkrainian refugee crisis2025 Amsterdam stabbing attackSobieskiego 100UN Commission of InquiryUN Human Rights Monitoring Mission"
            ],
            [
                "Terms andphrases",
                "\"And now I will show you where the attack on Belarus was prepared from\"\"Anglo-Saxons\"\"Bavovna\"\"Grandpa in his bunker\"\"Good evening, we are from Ukraine\"\"Orc\"\"Putin khuylo!\"\"Khuy Voyne!\"\"Russia is here forever[uk]\"\"Russian warship, go fuck yourself\"\"Slava Ukraini!\"\"Special military operation\"\"To bomb Voronezh\"\"Strength is in truth\"\"Westsplaining\"\"Where have you been for eight years?\"\"Without you\""
            ],
            [
                "Popularculture",
                "Songs\"12\"\"Bakhmut Fortress\"\"Bayraktar\"\"Bilia topoli\"\"City of Mary\"\"Flowers of Minefields\"\"Generation Cancellation\"\"Generation Z\"\"I'm Russian\"\"Oyda\"\"Hey, Hey, Rise Up!\"\"Mama ŠČ!\"\"Oi u luzi chervona kalyna\"\"Slava Ukraini!\"\"Stefania\"\"Ukraine\"\"Crushed\"Films20 Days in MariupolA Rising FuryFollow MeInterceptedRussians at WarTurn in the WoundUkraine on Fire 2[uk]OtherBabylon'13Back to the Cold WarBorodianka cat[uk]Ghost of KyivKherson watermelonKrálovec RegionMadonna of KyivNorth Atlantic Fella OrganizationNewspeak in Russia[ru;uk]Patron\"Putler\"\"Putinversteher\"Raccoon of KhersonSaint JavelinSaint Mariuburg[ru;uk]Vasylkiv maiolica roosterVladimir Putin's meeting tableWalk of the Brave\"Z\" military symbol",
                "Songs",
                "\"12\"\"Bakhmut Fortress\"\"Bayraktar\"\"Bilia topoli\"\"City of Mary\"\"Flowers of Minefields\"\"Generation Cancellation\"\"Generation Z\"\"I'm Russian\"\"Oyda\"\"Hey, Hey, Rise Up!\"\"Mama ŠČ!\"\"Oi u luzi chervona kalyna\"\"Slava Ukraini!\"\"Stefania\"\"Ukraine\"\"Crushed\"",
                "Films",
                "20 Days in MariupolA Rising FuryFollow MeInterceptedRussians at WarTurn in the WoundUkraine on Fire 2[uk]",
                "Other",
                "Babylon'13Back to the Cold WarBorodianka cat[uk]Ghost of KyivKherson watermelonKrálovec RegionMadonna of KyivNorth Atlantic Fella OrganizationNewspeak in Russia[ru;uk]Patron\"Putler\"\"Putinversteher\"Raccoon of KhersonSaint JavelinSaint Mariuburg[ru;uk]Vasylkiv maiolica roosterVladimir Putin's meeting tableWalk of the Brave\"Z\" military symbol"
            ],
            [
                "Songs",
                "\"12\"\"Bakhmut Fortress\"\"Bayraktar\"\"Bilia topoli\"\"City of Mary\"\"Flowers of Minefields\"\"Generation Cancellation\"\"Generation Z\"\"I'm Russian\"\"Oyda\"\"Hey, Hey, Rise Up!\"\"Mama ŠČ!\"\"Oi u luzi chervona kalyna\"\"Slava Ukraini!\"\"Stefania\"\"Ukraine\"\"Crushed\""
            ],
            [
                "Films",
                "20 Days in MariupolA Rising FuryFollow MeInterceptedRussians at WarTurn in the WoundUkraine on Fire 2[uk]"
            ],
            [
                "Other",
                "Babylon'13Back to the Cold WarBorodianka cat[uk]Ghost of KyivKherson watermelonKrálovec RegionMadonna of KyivNorth Atlantic Fella OrganizationNewspeak in Russia[ru;uk]Patron\"Putler\"\"Putinversteher\"Raccoon of KhersonSaint JavelinSaint Mariuburg[ru;uk]Vasylkiv maiolica roosterVladimir Putin's meeting tableWalk of the Brave\"Z\" military symbol"
            ],
            [
                "Key peopleUkrainiansVolodymyr Zelenskyyspeeches during the invasionvisit to the United Statesvisit to the United Kingdomvisits to EuropeAndriy BiletskyAndriy YermakDenis PushilinDenys ShmyhalDenys KireyevDenys MonastyrskyDenys ProkopenkoIryna VenediktovaKyrylo BudanovLeonid PasechnikMykhailo DrapatyiMykola OleschukOleksandr PavlyukOleksandr SyrskyiOleksii ReznikovOleksiy DanilovOleksiy NeizhpapaRuslan KhomchakRustem UmerovSergiy KyslytsyaSerhiy ShaptalaSerhii SternenkoValerii ZaluzhnyiVasyl MalyukVitali KlitschkoYevhen MoisiukRussiansVladimir PutinAleksandr DvornikovAleksandr LapinAleksey DyuminAleksey NaginAlexander BortnikovAndrei KolesnikovAndrei SychevoiAndrey BelousovAndrey VorobyovDmitry MedvedevGennady ZhidkoIgor KastyukevichIvan PopovMikhail MishustinMaria Lvova-BelovaNikolai PatrushevOleg SalyukovOleg TsokovRamzan KadyrovRoman BerdnikovRustam MuradovSergey KobylashSergey LavrovSergey NaryshkinSergei ShoiguSergey SurovikinTimur IvanovValery GerasimovViktor SokolovViktor ZolotovVitaly GerasimovVyacheslav GladkovVyacheslav VolodinYevgeny PrigozhinOtherAlexander Lukashenko",
                "Key people",
                "Ukrainians",
                "Volodymyr Zelenskyyspeeches during the invasionvisit to the United Statesvisit to the United Kingdomvisits to EuropeAndriy BiletskyAndriy YermakDenis PushilinDenys ShmyhalDenys KireyevDenys MonastyrskyDenys ProkopenkoIryna VenediktovaKyrylo BudanovLeonid PasechnikMykhailo DrapatyiMykola OleschukOleksandr PavlyukOleksandr SyrskyiOleksii ReznikovOleksiy DanilovOleksiy NeizhpapaRuslan KhomchakRustem UmerovSergiy KyslytsyaSerhiy ShaptalaSerhii SternenkoValerii ZaluzhnyiVasyl MalyukVitali KlitschkoYevhen Moisiuk",
                "Russians",
                "Vladimir PutinAleksandr DvornikovAleksandr LapinAleksey DyuminAleksey NaginAlexander BortnikovAndrei KolesnikovAndrei SychevoiAndrey BelousovAndrey VorobyovDmitry MedvedevGennady ZhidkoIgor KastyukevichIvan PopovMikhail MishustinMaria Lvova-BelovaNikolai PatrushevOleg SalyukovOleg TsokovRamzan KadyrovRoman BerdnikovRustam MuradovSergey KobylashSergey LavrovSergey NaryshkinSergei ShoiguSergey SurovikinTimur IvanovValery GerasimovViktor SokolovViktor ZolotovVitaly GerasimovVyacheslav GladkovVyacheslav VolodinYevgeny Prigozhin",
                "Other",
                "Alexander Lukashenko"
            ],
            {
                "vteRussian invasion of Ukraine": "Key people"
            },
            [
                "Ukrainians",
                "Volodymyr Zelenskyyspeeches during the invasionvisit to the United Statesvisit to the United Kingdomvisits to EuropeAndriy BiletskyAndriy YermakDenis PushilinDenys ShmyhalDenys KireyevDenys MonastyrskyDenys ProkopenkoIryna VenediktovaKyrylo BudanovLeonid PasechnikMykhailo DrapatyiMykola OleschukOleksandr PavlyukOleksandr SyrskyiOleksii ReznikovOleksiy DanilovOleksiy NeizhpapaRuslan KhomchakRustem UmerovSergiy KyslytsyaSerhiy ShaptalaSerhii SternenkoValerii ZaluzhnyiVasyl MalyukVitali KlitschkoYevhen Moisiuk"
            ],
            [
                "Russians",
                "Vladimir PutinAleksandr DvornikovAleksandr LapinAleksey DyuminAleksey NaginAlexander BortnikovAndrei KolesnikovAndrei SychevoiAndrey BelousovAndrey VorobyovDmitry MedvedevGennady ZhidkoIgor KastyukevichIvan PopovMikhail MishustinMaria Lvova-BelovaNikolai PatrushevOleg SalyukovOleg TsokovRamzan KadyrovRoman BerdnikovRustam MuradovSergey KobylashSergey LavrovSergey NaryshkinSergei ShoiguSergey SurovikinTimur IvanovValery GerasimovViktor SokolovViktor ZolotovVitaly GerasimovVyacheslav GladkovVyacheslav VolodinYevgeny Prigozhin"
            ],
            [
                "Other",
                "Alexander Lukashenko"
            ],
            [
                "Related2023 North Korea–Russia summit2023 visit by Joe Biden to Ukraine2023 visit by Fumio Kishida to Ukraine2023 visit by Xi Jinping to Russia2023 visit by Yoon Suk Yeol to Ukraine2025 Putin–Trump callAnti-drone meshAnti-Russian sentimentAnti-Ukrainian sentimentAntonov An-225 MriyaAxis of UpheavalAzerbaijan Airlines Flight 8243Azovstal Iron and Steel WorksBrovary helicopter crashBryansk Oblast military aircraft crashesClaims of Vladimir Putin's incapacity and deathDecolonization in UkraineDecommunization in UkraineDerussification in UkraineDemolition of monuments to Alexander Pushkin in UkraineForeign leaders that have visited during the invasionInstitute for the Study of WarIrkutsk Su-30 crashIvanovo Ilyushin Il-76 crashKorochansky Ilyushin Il-76 crashKyivstar cyberattack[ru;uk]Lady RincidentMoldovan coup d'état attempt allegationsNord Stream 2Proposed Russian annexation of TransnistriaPunisherRussian nuclear weaponsSarmatRussian military presence in TransnistriaRyazan Il-76 crashSiberian wildfiresSinhury mid-air collision[uk;zh]Soloti military training ground shootingSoviet imageryTerritorial Center of Recruitment and Social SupportTurtle tankU-24 associationUkrainian-African RenaissanceUkrainian conscription crisisWestern long-range weapons in RussiaUral Airlines Flight 1383\"The Vladimir Putin Interview\"Voronezh An-26 crashWagner Group plane crashYeysk Su-34 crashYaroslav Hunka scandalTime of Heroes",
                "Related",
                "2023 North Korea–Russia summit2023 visit by Joe Biden to Ukraine2023 visit by Fumio Kishida to Ukraine2023 visit by Xi Jinping to Russia2023 visit by Yoon Suk Yeol to Ukraine2025 Putin–Trump callAnti-drone meshAnti-Russian sentimentAnti-Ukrainian sentimentAntonov An-225 MriyaAxis of UpheavalAzerbaijan Airlines Flight 8243Azovstal Iron and Steel WorksBrovary helicopter crashBryansk Oblast military aircraft crashesClaims of Vladimir Putin's incapacity and deathDecolonization in UkraineDecommunization in UkraineDerussification in UkraineDemolition of monuments to Alexander Pushkin in UkraineForeign leaders that have visited during the invasionInstitute for the Study of WarIrkutsk Su-30 crashIvanovo Ilyushin Il-76 crashKorochansky Ilyushin Il-76 crashKyivstar cyberattack[ru;uk]Lady RincidentMoldovan coup d'état attempt allegationsNord Stream 2Proposed Russian annexation of TransnistriaPunisherRussian nuclear weaponsSarmatRussian military presence in TransnistriaRyazan Il-76 crashSiberian wildfiresSinhury mid-air collision[uk;zh]Soloti military training ground shootingSoviet imageryTerritorial Center of Recruitment and Social SupportTurtle tankU-24 associationUkrainian-African RenaissanceUkrainian conscription crisisWestern long-range weapons in RussiaUral Airlines Flight 1383\"The Vladimir Putin Interview\"Voronezh An-26 crashWagner Group plane crashYeysk Su-34 crashYaroslav Hunka scandalTime of Heroes"
            ],
            {
                "vteRussian invasion of Ukraine": "Related"
            },
            {
                "vteRussian invasion of Ukraine": "2023 North Korea–Russia summit2023 visit by Joe Biden to Ukraine2023 visit by Fumio Kishida to Ukraine2023 visit by Xi Jinping to Russia2023 visit by Yoon Suk Yeol to Ukraine2025 Putin–Trump callAnti-drone meshAnti-Russian sentimentAnti-Ukrainian sentimentAntonov An-225 MriyaAxis of UpheavalAzerbaijan Airlines Flight 8243Azovstal Iron and Steel WorksBrovary helicopter crashBryansk Oblast military aircraft crashesClaims of Vladimir Putin's incapacity and deathDecolonization in UkraineDecommunization in UkraineDerussification in UkraineDemolition of monuments to Alexander Pushkin in UkraineForeign leaders that have visited during the invasionInstitute for the Study of WarIrkutsk Su-30 crashIvanovo Ilyushin Il-76 crashKorochansky Ilyushin Il-76 crashKyivstar cyberattack[ru;uk]Lady RincidentMoldovan coup d'état attempt allegationsNord Stream 2Proposed Russian annexation of TransnistriaPunisherRussian nuclear weaponsSarmatRussian military presence in TransnistriaRyazan Il-76 crashSiberian wildfiresSinhury mid-air collision[uk;zh]Soloti military training ground shootingSoviet imageryTerritorial Center of Recruitment and Social SupportTurtle tankU-24 associationUkrainian-African RenaissanceUkrainian conscription crisisWestern long-range weapons in RussiaUral Airlines Flight 1383\"The Vladimir Putin Interview\"Voronezh An-26 crashWagner Group plane crashYeysk Su-34 crashYaroslav Hunka scandalTime of Heroes"
            },
            {
                "vteRussian invasion of Ukraine": "Category"
            }
        ]
    },
    {
        "heading": "External links",
        "table": [
            [
                "General",
                "OutlineTimelinePreludeFeb – Apr 2022Apr – Aug 2022Aug – Nov 2022Nov 2022 – Jun 2023Jun – Aug 2023Sep – Nov 2023Dec 2023 – Mar 2024Apr – Jul 2024Aug – Dec 2024Jan 2025 – presentAerial warfareDefense linesForeign fightersInformation warNaval warfareLegalityMapOrder of battlePeace negotiationsUkraine's Peace FormulaChina peace proposalJune 2024 peace summitProposed no-fly zoneRed linesReparationsTerritorial controlWomen"
            ],
            [
                "Prelude",
                "ReactionsDisinformationUkraine bioweapons conspiracy theoryUkraine and weapons of mass destruction2021 Russia–United States summit2021 Black Sea incidentBelarus–European Union border crisis\"On the Historical Unity of Russians and Ukrainians\"Crimea PlatformZapad 2021December 2021 ultimatum2022 Ukraine cyberattacksZametil 2022Union Resolve 2022Stanytsia Luhanska kindergarten bombingBritish–Polish–Ukrainian trilateral pactEvacuation of the Donetsk PR and Luhansk PRMobilization in Donetsk PR and Luhansk PR\"Address concerning the events in Ukraine\"\"On conducting a special military operation\""
            ],
            [
                "Background",
                "Dissolution of the Soviet Union2014 pro-Russian unrest in UkraineAnnexation of CrimeareactionsWar in Donbas2022 timelineMinsk agreementshumanitarian situationinternational recognition of the Donetsk PR and Luhansk PRPutinismFoundations of GeopoliticsNovorossiyaRuscismRussian irredentismRussian imperialism"
            ],
            [
                "Foreignrelations",
                "Russia–UkraineBelarus–UkraineBelarus–RussiaRussia–United StatesUkraine–United StatesRussia–NATOUkraine–NATOenlargement of NATOeastward expansion controversy in Russiaopen door policy"
            ]
        ]
    },
    {
        "heading": "External links",
        "table": [
            [
                "SouthernUkraine",
                "Snake Island campaignSiege of MariupolBattle of KhersonCapture of MelitopolBattle of MykolaivBattle of EnerhodarBattle of VoznesenskBattle of HuliaipoleKherson counteroffensiveLiberation of KhersonDnieper campaignDestruction of the Kakhovka Dam2025 spring offensive"
            ],
            [
                "EasternUkraine",
                "Battle of VolnovakhaBattle of KharkivBattle of IziumBattle of RubizhneBattle of PopasnaBattle of MarinkaBattle of DonbasBattle of the Siverskyi DonetsBattle of SievierodonetskBattle of LysychanskBattle of PiskyBattle of BakhmutBattle of SoledarBattle of VuhledarKharkiv counteroffensiveBattle of Lyman (September–October 2022)Luhansk Oblast campaignKupianskNortheast DonetskBattle of AvdiivkaBattle of Chasiv YarBattle of KrasnohorivkaBattle of OcheretyneBattle of ToretskPokrovsk offensiveBattle of Kurakhove"
            ],
            [
                "NorthernUkraine",
                "Capture of ChernobylRussian Kyiv convoyBattle of KyivBattle of Antonov AirportBattle of HostomelBattle of BuchaBattle of IrpinBattle of MakarivBattle of MoshchunDestruction of the Kozarovychi DamBattle of BrovaryBattle of SlavutychBattle of SumySiege of ChernihivNortheastern border skirmishes2025 Sumy Oblast incursion"
            ],
            [
                "Russia",
                "Bryansk Oblast raidKremlin drone attackMoscow drone strikes2023 Belgorod Oblast incursions30 December 2023 Belgorod shellingFebruary 2024 Belgorod missile strikeMay 2024 Belgorod missile strikeMarch 2024 western Russia incursion2024 Kursk offensiveoccupationBattles for Olgovskiy ForestToropets depot explosions2025 Belgorod Oblast incursion"
            ],
            [
                "Airstrikesby city",
                "Chernihiv strikesDnipro strikesIvano-Frankivsk strikesKharkiv strikesKherson strikesKhmelnytskyi strikesKryvyi Rih strikesKyiv strikesLviv strikesMykolaiv strikesOdesa strikesRivne strikesVinnytsia strikesZaporizhzhia strikesZhytomyr strikes"
            ],
            [
                "Airstrikeson militarytargets",
                "Chuhuiv air base attackMillerovo air base attackChornobaivka (Saky) attacks7 March 2022 Mykolaiv military barracks attackYavoriv military base attack18 March 2022 Mykolaiv military quarters attackBerdiansk port attackSinking of theMoskvaDesna barracks airstrikeAttack on Nova KakhovkaCrimea attacksNovofedorivka explosionsDrone attack on the Sevastopol Naval BaseMissile strike on the Black Sea Fleet headquartersDyagilevo and Engels air bases attacksMakiivka military quarters shellingMachulishchy air base attackZarichne barracks airstrike"
            ],
            [
                "Resistance",
                "Russian-occupied UkrainePopular Resistance of UkraineBerdiansk Partisan ArmyYellow RibbonAteshBelarus and RussiaAssassination of Vladlen TatarskyCivic CouncilIrpin DeclarationKilling of Darya DuginaNational Republican ArmyMilitary commissariats arsonsUst-Ilimsk military commissariat shootingBlack BridgeRail war in RussiaStop the WagonsCombat Organization of Anarcho-CommunistsRail war in BelarusBusly liaciaćBYPOLCommunity of Railway WorkersCyber Partisans",
                "Russian-occupied Ukraine",
                "Popular Resistance of UkraineBerdiansk Partisan ArmyYellow RibbonAtesh",
                "Belarus and Russia",
                "Assassination of Vladlen TatarskyCivic CouncilIrpin DeclarationKilling of Darya DuginaNational Republican ArmyMilitary commissariats arsonsUst-Ilimsk military commissariat shootingBlack BridgeRail war in RussiaStop the WagonsCombat Organization of Anarcho-CommunistsRail war in BelarusBusly liaciaćBYPOLCommunity of Railway WorkersCyber Partisans"
            ],
            [
                "Russian-occupied Ukraine",
                "Popular Resistance of UkraineBerdiansk Partisan ArmyYellow RibbonAtesh"
            ],
            [
                "Belarus and Russia",
                "Assassination of Vladlen TatarskyCivic CouncilIrpin DeclarationKilling of Darya DuginaNational Republican ArmyMilitary commissariats arsonsUst-Ilimsk military commissariat shootingBlack BridgeRail war in RussiaStop the WagonsCombat Organization of Anarcho-CommunistsRail war in BelarusBusly liaciaćBYPOLCommunity of Railway WorkersCyber Partisans"
            ],
            [
                "Russianoccupations",
                "Flags used in Russian-occupied UkraineOngoingAnnexation referendumsAnnexation of Donetsk, Kherson, Luhansk and Zaporizhzhia oblastsElections in Russian-occupied UkraineRussian-occupied territories of UkraineAutonomous Republic of Crimea and SevastopolDonetsk OblastKharkiv OblastKherson OblastLuhansk OblastMykolaiv OblastZaporizhzhia OblastSumy Oblast(2025, reentry)PreviousChernihiv OblastKyiv OblastOdesa OblastSumy Oblast(2022)Zhytomyr Oblast",
                "Flags used in Russian-occupied Ukraine",
                "Ongoing",
                "Annexation referendumsAnnexation of Donetsk, Kherson, Luhansk and Zaporizhzhia oblastsElections in Russian-occupied UkraineRussian-occupied territories of UkraineAutonomous Republic of Crimea and SevastopolDonetsk OblastKharkiv OblastKherson OblastLuhansk OblastMykolaiv OblastZaporizhzhia OblastSumy Oblast(2025, reentry)",
                "Previous",
                "Chernihiv OblastKyiv OblastOdesa OblastSumy Oblast(2022)Zhytomyr Oblast"
            ],
            {
                "Military engagements": "Flags used in Russian-occupied Ukraine"
            },
            [
                "Ongoing",
                "Annexation referendumsAnnexation of Donetsk, Kherson, Luhansk and Zaporizhzhia oblastsElections in Russian-occupied UkraineRussian-occupied territories of UkraineAutonomous Republic of Crimea and SevastopolDonetsk OblastKharkiv OblastKherson OblastLuhansk OblastMykolaiv OblastZaporizhzhia OblastSumy Oblast(2025, reentry)"
            ],
            [
                "Previous",
                "Chernihiv OblastKyiv OblastOdesa OblastSumy Oblast(2022)Zhytomyr Oblast"
            ],
            [
                "Potentiallyrelated",
                "Black Sea drone incidentMystery fires in RussiaNord Stream pipeline sabotageTransnistria attacksZagreb Tu-141 crash"
            ],
            [
                "Other",
                "2022 Crimean Bridge explosion2023 Crimean Bridge explosionAssassination attempts on Volodymyr ZelenskyyChernobyl Nuclear Power Plant drone strikeCoup d'état attempt in UkraineBridges in the Russo-Ukrainian WarDragon droneViolations of non-combatant airspacesMissile explosion in PolandOperation SynytsiaUkraine and electronic warfareUse of long-range weapons by Ukraine in Russia2023 Ukrainian counteroffensive2024 Ukrainian cyberattacks against RussiaWagner Group rebellion"
            ]
        ]
    },
    {
        "heading": "External links",
        "table": [
            [
                "Belarus and Russia",
                "Assassination of Vladlen TatarskyCivic CouncilIrpin DeclarationKilling of Darya DuginaNational Republican ArmyMilitary commissariats arsonsUst-Ilimsk military commissariat shootingBlack BridgeRail war in RussiaStop the WagonsCombat Organization of Anarcho-CommunistsRail war in BelarusBusly liaciaćBYPOLCommunity of Railway WorkersCyber Partisans"
            ]
        ]
    },
    {
        "heading": "External links",
        "table": [
            [
                "Ongoing",
                "Annexation referendumsAnnexation of Donetsk, Kherson, Luhansk and Zaporizhzhia oblastsElections in Russian-occupied UkraineRussian-occupied territories of UkraineAutonomous Republic of Crimea and SevastopolDonetsk OblastKharkiv OblastKherson OblastLuhansk OblastMykolaiv OblastZaporizhzhia OblastSumy Oblast(2025, reentry)"
            ],
            [
                "Previous",
                "Chernihiv OblastKyiv OblastOdesa OblastSumy Oblast(2022)Zhytomyr Oblast"
            ]
        ]
    },
    {
        "heading": "External links",
        "table": [
            [
                "General",
                "Accusations of genocide in DonbasAllegations of genocide of Ukrainianschild abductionsAttacks on hospitalsCluster munitionsIncendiary weaponsLandminesRussian filtration campsRussian mobile crematoriumsRussian theft of Ukrainian grainRussian torture chambersLootingSexual violenceMistreatment of prisoners of war"
            ],
            [
                "Attacks oncivilians",
                "February 2022 Kharkiv cluster bombingKharkiv government building airstrike3 March Chernihiv bombingIrpin refugee column shellingMariupol hospital airstrikeStara Krasnianka care house attackMykolaiv cluster bombingMarch 2022 Donetsk attack2022 Borodianka airstrikesChernihiv breadline attackMariupol theatre airstrikeKyiv shopping centre bombingSumykhimprom ammonia leakMarch 2022 Kharkiv cluster bombingMykolaiv government building missile strikeBucha massacreKramatorsk railway station attackApril 2022 Kharkiv cluster bombingBilohorivka school bombingShooting of Andrii BohomazMaisky Market attackKremenchuk shopping mall attackSerhiivka missile strikeChasiv Yar missile strikeOlenivka prison massacreKharkiv dormitories missile strikeChaplyne railway station attackIzium mass gravesSeptember 2022 Donetsk attackZaporizhzhia civilian convoy attackKupiansk civilian convoy shellingZaporizhzhia residential building airstrikeRussian strikes against Ukrainian infrastructure2023 Dnipro residential building airstrikeSloviansk airstrikeUman missile strikeKramatorsk restaurant missile strikeLyman cluster bombing2023 Pokrovsk missile strikeChernihiv missile strikeKostiantynivka missile strikeHroza missile attackVolnovakha massacreDecember 2023 strikes2024 Pokrovsk missile strike2024 Donetsk attackLysychansk missile strike6 March 2024 Odesa strikeMarch 2024 strikesMay 2024 Kharkiv strikes8 July 2024 strikes2024 Kostiantynivka supermarket missile attack26 August 2024 strikesSeptember 2024 Poltava strikeNovember 2024 strikes2025 Sumy airstrike"
            ],
            [
                "Crimesagainstsoldiers",
                "Torture of Russian soldiers in Mala RohanTorture and castration of a Ukrainian POW in PryvilliaRape of Donetsk People's Republic soldiers by KadyrovitesMurder of Yevgeny NuzhinMakiivka surrender incidentExecution of Oleksandr Matsievskyi2022 Ukrainian prisoner of war beheading"
            ],
            [
                "Legal cases",
                "ICC investigationArrest warrantsICJ court caseTask Force on AccountabilityUniversal jurisdictionCrime of aggressionCriminal proceedingsVadim ShishimarinAlexander Bobikin and Alexander IvanovAnton Cherednik"
            ]
        ]
    },
    {
        "heading": "External links",
        "table": [
            [
                "Statesandofficialentities",
                "GeneralSanctionspeople and organizationsrestrictions on transit to Kaliningrad OblastMilitary aidEuropean Union Military Assistance Mission in support of UkrainePeople's BayraktarSignmyrocket.comHumanitarian aidSanctioned yachtsRelations with RussiaUkraineApplication to NATOBe Brave Like UkraineBrave1Bring Kids Back UABan on Russia-associated religious groupsCoordination Headquarters for the Treatment of Prisoners of WarDecolonization and derussification lawDeltaDestroyed Russian military equipment exhibitionFor Courage and Bravery (Ukraine)Grain From UkraineHeadquarters of the Supreme Commander-in-ChiefHero CityI Want to LiveInternational Legionand other foreign unitsBelarusian Volunteer CorpsTerror BattalionBlack Maple CompanyCanadian-Ukrainian BrigadeFreedom of Russia LegionGerman Volunteer CorpsKarelian National BattalionKastuś Kalinoŭski RegimentNorman BrigadePahonia RegimentPolish Volunteer CorpsRomanian Battlegroup GeticaRussian Volunteer CorpsSeparate Special Purpose BattalionSibir BattalionTuran BattalionInternational Sponsors of WarForced confiscation law of Russian property[ru;uk]Look for Your OwnLukoil sanctionsMartial lawMobilizationMedia Center UkraineNational Council for the Recovery of Ukraine from the War[uk]National Multi-Subject Test[uk]North Korea–Ukraine relationsPoints of InvincibilityRecognition of IchkeriaRescuer CitySave Ukrainian Culture[uk]Syria–Ukraine relationsUkrainian Freedom OrchestraUnited24United NewsRussiahighways in the annexed territoriesA290A291 \"Tavrida\"R260R280 \"Novorossiya\"2022 Moscow rally2023 Moscow rally2022 Moscow Victory Day Parade2023 Moscow Victory Day Parade2024 Moscow Victory Day Parade2023 Presidential Address to the Federal AssemblyBlockade of Ukraine[ru]Bohdan Khmelnytsky BattalionCensorship in Russia[ru]ChechnyaPro-Ukrainian Chechen fightersConmemorative Medal \"Participant of a Special Military Operation\"[ru]Conversations about Important ThingsKrasovsky caseLegalization of parallel imports[ru]Manifesto of the South Russian People's CouncilMartial lawMasha Moskalyova caseMetropolis of CrimeaMikhail Simonov caseMobilizationRecruitment of irregular forces[ru]Operation DoppelgängerOpinion polling[ru]Orthodox Christmas truce proposalWagner Group–Ministry of Defense conflictRussian Orthodox clergymen appeal against warSalvation Committee for Peace and OrderSpecial Coordinating CouncilUkraine bioweapons conspiracy theoryUnfriendly countries listWar censorship lawsWe Are Together. Sports\"What Russia Should Do with Ukraine\"United States2022 Joe Biden speech in Warsaw2022 State of the Union AddressConsolidated Appropriations Act, 2022Consolidated Appropriations Act, 2023Disinformation Governance BoardExecutive Order 14071Pentagon document leaksTask Force KleptoCaptureUkraine Defense Contact GroupUkraine Democracy Defense Lend-Lease ActUkraine Security Assistance InitiativeOther countriesBelarusCanadaCanada–Ukraine authorization for emergency travelChinaCloser ties with RussiaChinese peace planHong KongCroatiaDenmarkDanish European Union defence opt-out referendumFranceMission AigleGeorgiaGermanyGerman Taurus controversyTaurus leakZeitenwende speechHungaryIndiaOperation GangaIranCloser ties with RussiaIsraelOperation Israel GuaranteesLithuaniaMoldovaNew ZealandRussia Sanctions ActNorth KoreaPolandborder crisis with UkraineSyria[ru]TaiwanUnited KingdomEconomic Crime ActHomes for UkraineOperation Interflex2025 London Summit on UkraineCoalition of the willingUnited NationsEmergency special sessionResolution ES-11/1Resolution ES-11/2Resolution ES-11/3Resolution ES-11/4Resolution ES-11/5Resolution ES-11/6Resolution ES-11/7Security Council Resolution 2623Resolution A/RES/77/229Easter truceInternationalorganizationsAccession of Moldova to the EUAccession of Ukraine to the EUBrussels summitEuropean Political Community1st summit2nd summit3rd summitMadrid summitNATO virtual summitOperation OscarRamstein Air Base meetingEU–Ukraine SummitREPowerEUSteadfast Defender 2024SWIFT ban against Russian banksUkraine Recovery ConferenceVersailles declaration2023 Vilnius summit15th BRICS summit2024 Washington summitWeimar+OtherConsecration of RussiaF-16 training coalitionFinland–NATO relationsFinland–Russia border barrierIron diplomacyProposed Russian annexation of South OssetiaRecognition of Russia as a terrorist stateRemoval of monuments and memorialsStreets renamedUkraine Square, OsloServing heads of state and government that have visited Ukraine during the invasionSweden–NATO relationsSwedish anti-terrorism bill",
                "General",
                "Sanctionspeople and organizationsrestrictions on transit to Kaliningrad OblastMilitary aidEuropean Union Military Assistance Mission in support of UkrainePeople's BayraktarSignmyrocket.comHumanitarian aidSanctioned yachtsRelations with Russia",
                "Ukraine",
                "Application to NATOBe Brave Like UkraineBrave1Bring Kids Back UABan on Russia-associated religious groupsCoordination Headquarters for the Treatment of Prisoners of WarDecolonization and derussification lawDeltaDestroyed Russian military equipment exhibitionFor Courage and Bravery (Ukraine)Grain From UkraineHeadquarters of the Supreme Commander-in-ChiefHero CityI Want to LiveInternational Legionand other foreign unitsBelarusian Volunteer CorpsTerror BattalionBlack Maple CompanyCanadian-Ukrainian BrigadeFreedom of Russia LegionGerman Volunteer CorpsKarelian National BattalionKastuś Kalinoŭski RegimentNorman BrigadePahonia RegimentPolish Volunteer CorpsRomanian Battlegroup GeticaRussian Volunteer CorpsSeparate Special Purpose BattalionSibir BattalionTuran BattalionInternational Sponsors of WarForced confiscation law of Russian property[ru;uk]Look for Your OwnLukoil sanctionsMartial lawMobilizationMedia Center UkraineNational Council for the Recovery of Ukraine from the War[uk]National Multi-Subject Test[uk]North Korea–Ukraine relationsPoints of InvincibilityRecognition of IchkeriaRescuer CitySave Ukrainian Culture[uk]Syria–Ukraine relationsUkrainian Freedom OrchestraUnited24United News",
                "Russia",
                "highways in the annexed territoriesA290A291 \"Tavrida\"R260R280 \"Novorossiya\"2022 Moscow rally2023 Moscow rally2022 Moscow Victory Day Parade2023 Moscow Victory Day Parade2024 Moscow Victory Day Parade2023 Presidential Address to the Federal AssemblyBlockade of Ukraine[ru]Bohdan Khmelnytsky BattalionCensorship in Russia[ru]ChechnyaPro-Ukrainian Chechen fightersConmemorative Medal \"Participant of a Special Military Operation\"[ru]Conversations about Important ThingsKrasovsky caseLegalization of parallel imports[ru]Manifesto of the South Russian People's CouncilMartial lawMasha Moskalyova caseMetropolis of CrimeaMikhail Simonov caseMobilizationRecruitment of irregular forces[ru]Operation DoppelgängerOpinion polling[ru]Orthodox Christmas truce proposalWagner Group–Ministry of Defense conflictRussian Orthodox clergymen appeal against warSalvation Committee for Peace and OrderSpecial Coordinating CouncilUkraine bioweapons conspiracy theoryUnfriendly countries listWar censorship lawsWe Are Together. Sports\"What Russia Should Do with Ukraine\"",
                "United States",
                "2022 Joe Biden speech in Warsaw2022 State of the Union AddressConsolidated Appropriations Act, 2022Consolidated Appropriations Act, 2023Disinformation Governance BoardExecutive Order 14071Pentagon document leaksTask Force KleptoCaptureUkraine Defense Contact GroupUkraine Democracy Defense Lend-Lease ActUkraine Security Assistance Initiative",
                "Other countries",
                "BelarusCanadaCanada–Ukraine authorization for emergency travelChinaCloser ties with RussiaChinese peace planHong KongCroatiaDenmarkDanish European Union defence opt-out referendumFranceMission AigleGeorgiaGermanyGerman Taurus controversyTaurus leakZeitenwende speechHungaryIndiaOperation GangaIranCloser ties with RussiaIsraelOperation Israel GuaranteesLithuaniaMoldovaNew ZealandRussia Sanctions ActNorth KoreaPolandborder crisis with UkraineSyria[ru]TaiwanUnited KingdomEconomic Crime ActHomes for UkraineOperation Interflex2025 London Summit on UkraineCoalition of the willing",
                "United Nations",
                "Emergency special sessionResolution ES-11/1Resolution ES-11/2Resolution ES-11/3Resolution ES-11/4Resolution ES-11/5Resolution ES-11/6Resolution ES-11/7Security Council Resolution 2623Resolution A/RES/77/229Easter truce",
                "Internationalorganizations",
                "Accession of Moldova to the EUAccession of Ukraine to the EUBrussels summitEuropean Political Community1st summit2nd summit3rd summitMadrid summitNATO virtual summitOperation OscarRamstein Air Base meetingEU–Ukraine SummitREPowerEUSteadfast Defender 2024SWIFT ban against Russian banksUkraine Recovery ConferenceVersailles declaration2023 Vilnius summit15th BRICS summit2024 Washington summitWeimar+",
                "Other",
                "Consecration of RussiaF-16 training coalitionFinland–NATO relationsFinland–Russia border barrierIron diplomacyProposed Russian annexation of South OssetiaRecognition of Russia as a terrorist stateRemoval of monuments and memorialsStreets renamedUkraine Square, OsloServing heads of state and government that have visited Ukraine during the invasionSweden–NATO relationsSwedish anti-terrorism bill"
            ],
            [
                "General",
                "Sanctionspeople and organizationsrestrictions on transit to Kaliningrad OblastMilitary aidEuropean Union Military Assistance Mission in support of UkrainePeople's BayraktarSignmyrocket.comHumanitarian aidSanctioned yachtsRelations with Russia"
            ],
            [
                "Ukraine",
                "Application to NATOBe Brave Like UkraineBrave1Bring Kids Back UABan on Russia-associated religious groupsCoordination Headquarters for the Treatment of Prisoners of WarDecolonization and derussification lawDeltaDestroyed Russian military equipment exhibitionFor Courage and Bravery (Ukraine)Grain From UkraineHeadquarters of the Supreme Commander-in-ChiefHero CityI Want to LiveInternational Legionand other foreign unitsBelarusian Volunteer CorpsTerror BattalionBlack Maple CompanyCanadian-Ukrainian BrigadeFreedom of Russia LegionGerman Volunteer CorpsKarelian National BattalionKastuś Kalinoŭski RegimentNorman BrigadePahonia RegimentPolish Volunteer CorpsRomanian Battlegroup GeticaRussian Volunteer CorpsSeparate Special Purpose BattalionSibir BattalionTuran BattalionInternational Sponsors of WarForced confiscation law of Russian property[ru;uk]Look for Your OwnLukoil sanctionsMartial lawMobilizationMedia Center UkraineNational Council for the Recovery of Ukraine from the War[uk]National Multi-Subject Test[uk]North Korea–Ukraine relationsPoints of InvincibilityRecognition of IchkeriaRescuer CitySave Ukrainian Culture[uk]Syria–Ukraine relationsUkrainian Freedom OrchestraUnited24United News"
            ],
            [
                "Russia",
                "highways in the annexed territoriesA290A291 \"Tavrida\"R260R280 \"Novorossiya\"2022 Moscow rally2023 Moscow rally2022 Moscow Victory Day Parade2023 Moscow Victory Day Parade2024 Moscow Victory Day Parade2023 Presidential Address to the Federal AssemblyBlockade of Ukraine[ru]Bohdan Khmelnytsky BattalionCensorship in Russia[ru]ChechnyaPro-Ukrainian Chechen fightersConmemorative Medal \"Participant of a Special Military Operation\"[ru]Conversations about Important ThingsKrasovsky caseLegalization of parallel imports[ru]Manifesto of the South Russian People's CouncilMartial lawMasha Moskalyova caseMetropolis of CrimeaMikhail Simonov caseMobilizationRecruitment of irregular forces[ru]Operation DoppelgängerOpinion polling[ru]Orthodox Christmas truce proposalWagner Group–Ministry of Defense conflictRussian Orthodox clergymen appeal against warSalvation Committee for Peace and OrderSpecial Coordinating CouncilUkraine bioweapons conspiracy theoryUnfriendly countries listWar censorship lawsWe Are Together. Sports\"What Russia Should Do with Ukraine\""
            ],
            [
                "United States",
                "2022 Joe Biden speech in Warsaw2022 State of the Union AddressConsolidated Appropriations Act, 2022Consolidated Appropriations Act, 2023Disinformation Governance BoardExecutive Order 14071Pentagon document leaksTask Force KleptoCaptureUkraine Defense Contact GroupUkraine Democracy Defense Lend-Lease ActUkraine Security Assistance Initiative"
            ],
            [
                "Other countries",
                "BelarusCanadaCanada–Ukraine authorization for emergency travelChinaCloser ties with RussiaChinese peace planHong KongCroatiaDenmarkDanish European Union defence opt-out referendumFranceMission AigleGeorgiaGermanyGerman Taurus controversyTaurus leakZeitenwende speechHungaryIndiaOperation GangaIranCloser ties with RussiaIsraelOperation Israel GuaranteesLithuaniaMoldovaNew ZealandRussia Sanctions ActNorth KoreaPolandborder crisis with UkraineSyria[ru]TaiwanUnited KingdomEconomic Crime ActHomes for UkraineOperation Interflex2025 London Summit on UkraineCoalition of the willing"
            ],
            [
                "United Nations",
                "Emergency special sessionResolution ES-11/1Resolution ES-11/2Resolution ES-11/3Resolution ES-11/4Resolution ES-11/5Resolution ES-11/6Resolution ES-11/7Security Council Resolution 2623Resolution A/RES/77/229Easter truce"
            ],
            [
                "Internationalorganizations",
                "Accession of Moldova to the EUAccession of Ukraine to the EUBrussels summitEuropean Political Community1st summit2nd summit3rd summitMadrid summitNATO virtual summitOperation OscarRamstein Air Base meetingEU–Ukraine SummitREPowerEUSteadfast Defender 2024SWIFT ban against Russian banksUkraine Recovery ConferenceVersailles declaration2023 Vilnius summit15th BRICS summit2024 Washington summitWeimar+"
            ],
            [
                "Other",
                "Consecration of RussiaF-16 training coalitionFinland–NATO relationsFinland–Russia border barrierIron diplomacyProposed Russian annexation of South OssetiaRecognition of Russia as a terrorist stateRemoval of monuments and memorialsStreets renamedUkraine Square, OsloServing heads of state and government that have visited Ukraine during the invasionSweden–NATO relationsSwedish anti-terrorism bill"
            ],
            [
                "Public",
                "ProtestsIn Ukrainein Russian-occupied Ukrainedemolition of monuments to Alexander PushkinArmWomenNowUkrainian Artistic FrontIn RussiaAngry patriotsClub of Angry PatriotsAnti-War CommitteeSuspicious deaths of Russian businesspeopleCongress of People's DeputiesCouncil of Mothers and WivesFeminist Anti-War ResistanceFlower protestsMarina OvsyannikovaRussian Action CommitteeNorth Caucasian protests2022 Russian Far East protestsState Duma initiative for charging Vladimir Putin of high treasonWhite-blue-white flagIn BelarusIn ChinaGreat Translation MovementIn Czech RepublicCzech Republic First!CompaniesAddress of the Russian Union of RectorsBoycott of Russia and Belarus\"Do not buy Russian goods!\"E.N.O.T. Corp.Igor MangushevMcDonald's in RussiaVkusno i tochkaNashStore[ru]People's SatelliteStarlink satellitesStop Bloody EnergyWagner GroupAndrey Aleksandrovich MedvedevDeath of Nemes TarimoYale CELI List of CompaniesTechnologyAnonymous and the invasionalerts.in.uaDDoS attacks on RomaniaDeepStateMap.LiveIT Army of UkraineKillnetLiveuamapOpen-source intelligencepeacenotwarRussian Asset TrackerSquad303[pl]Ukraine Siren AlertsWikipediathreat to block in Russiadetention of Mark BernsteinSpiesDiplomatic expulsions during the Russo-Ukrainian WarRussian spies in the Russo-Ukrainian WarOtherAssociation of Azovstal Defenders' FamiliesBlack Sea Grain InitiativeCollaboration with RussiaWe Are Together with RussiaConcert for UkraineFree Buryatia FoundationFree Nations of Post-Russia ForumGame4UkraineGet LostGlobal Tour for PeaceGo by the ForestGuide to the Free WorldMozart GroupOlena Zelenska FoundationOpen letter from Nobel laureatesPavel Sudoplatov BattalionRubikus.HelpUARuslan Shostak Charitable FoundationRussia's War Crimes HouseSave UkraineSaving Ukrainian Cultural Heritage OnlineSerhiy Prytula Charity FoundationSpain letter bomb attacksYermak-McFaul Expert Group on Russian SanctionsPavel FilatyevTrue RussiaVolos DeclarationWimbledon ban",
                "Protests",
                "In Ukrainein Russian-occupied Ukrainedemolition of monuments to Alexander PushkinArmWomenNowUkrainian Artistic FrontIn RussiaAngry patriotsClub of Angry PatriotsAnti-War CommitteeSuspicious deaths of Russian businesspeopleCongress of People's DeputiesCouncil of Mothers and WivesFeminist Anti-War ResistanceFlower protestsMarina OvsyannikovaRussian Action CommitteeNorth Caucasian protests2022 Russian Far East protestsState Duma initiative for charging Vladimir Putin of high treasonWhite-blue-white flagIn BelarusIn ChinaGreat Translation MovementIn Czech RepublicCzech Republic First!",
                "Companies",
                "Address of the Russian Union of RectorsBoycott of Russia and Belarus\"Do not buy Russian goods!\"E.N.O.T. Corp.Igor MangushevMcDonald's in RussiaVkusno i tochkaNashStore[ru]People's SatelliteStarlink satellitesStop Bloody EnergyWagner GroupAndrey Aleksandrovich MedvedevDeath of Nemes TarimoYale CELI List of Companies",
                "Technology",
                "Anonymous and the invasionalerts.in.uaDDoS attacks on RomaniaDeepStateMap.LiveIT Army of UkraineKillnetLiveuamapOpen-source intelligencepeacenotwarRussian Asset TrackerSquad303[pl]Ukraine Siren AlertsWikipediathreat to block in Russiadetention of Mark Bernstein",
                "Spies",
                "Diplomatic expulsions during the Russo-Ukrainian WarRussian spies in the Russo-Ukrainian War",
                "Other",
                "Association of Azovstal Defenders' FamiliesBlack Sea Grain InitiativeCollaboration with RussiaWe Are Together with RussiaConcert for UkraineFree Buryatia FoundationFree Nations of Post-Russia ForumGame4UkraineGet LostGlobal Tour for PeaceGo by the ForestGuide to the Free WorldMozart GroupOlena Zelenska FoundationOpen letter from Nobel laureatesPavel Sudoplatov BattalionRubikus.HelpUARuslan Shostak Charitable FoundationRussia's War Crimes HouseSave UkraineSaving Ukrainian Cultural Heritage OnlineSerhiy Prytula Charity FoundationSpain letter bomb attacksYermak-McFaul Expert Group on Russian SanctionsPavel FilatyevTrue RussiaVolos DeclarationWimbledon ban"
            ],
            [
                "Protests",
                "In Ukrainein Russian-occupied Ukrainedemolition of monuments to Alexander PushkinArmWomenNowUkrainian Artistic FrontIn RussiaAngry patriotsClub of Angry PatriotsAnti-War CommitteeSuspicious deaths of Russian businesspeopleCongress of People's DeputiesCouncil of Mothers and WivesFeminist Anti-War ResistanceFlower protestsMarina OvsyannikovaRussian Action CommitteeNorth Caucasian protests2022 Russian Far East protestsState Duma initiative for charging Vladimir Putin of high treasonWhite-blue-white flagIn BelarusIn ChinaGreat Translation MovementIn Czech RepublicCzech Republic First!"
            ],
            [
                "Companies",
                "Address of the Russian Union of RectorsBoycott of Russia and Belarus\"Do not buy Russian goods!\"E.N.O.T. Corp.Igor MangushevMcDonald's in RussiaVkusno i tochkaNashStore[ru]People's SatelliteStarlink satellitesStop Bloody EnergyWagner GroupAndrey Aleksandrovich MedvedevDeath of Nemes TarimoYale CELI List of Companies"
            ],
            [
                "Technology",
                "Anonymous and the invasionalerts.in.uaDDoS attacks on RomaniaDeepStateMap.LiveIT Army of UkraineKillnetLiveuamapOpen-source intelligencepeacenotwarRussian Asset TrackerSquad303[pl]Ukraine Siren AlertsWikipediathreat to block in Russiadetention of Mark Bernstein"
            ],
            [
                "Spies",
                "Diplomatic expulsions during the Russo-Ukrainian WarRussian spies in the Russo-Ukrainian War"
            ],
            [
                "Other",
                "Association of Azovstal Defenders' FamiliesBlack Sea Grain InitiativeCollaboration with RussiaWe Are Together with RussiaConcert for UkraineFree Buryatia FoundationFree Nations of Post-Russia ForumGame4UkraineGet LostGlobal Tour for PeaceGo by the ForestGuide to the Free WorldMozart GroupOlena Zelenska FoundationOpen letter from Nobel laureatesPavel Sudoplatov BattalionRubikus.HelpUARuslan Shostak Charitable FoundationRussia's War Crimes HouseSave UkraineSaving Ukrainian Cultural Heritage OnlineSerhiy Prytula Charity FoundationSpain letter bomb attacksYermak-McFaul Expert Group on Russian SanctionsPavel FilatyevTrue RussiaVolos DeclarationWimbledon ban"
            ]
        ]
    },
    {
        "heading": "External links",
        "table": [
            [
                "Ukraine",
                "Application to NATOBe Brave Like UkraineBrave1Bring Kids Back UABan on Russia-associated religious groupsCoordination Headquarters for the Treatment of Prisoners of WarDecolonization and derussification lawDeltaDestroyed Russian military equipment exhibitionFor Courage and Bravery (Ukraine)Grain From UkraineHeadquarters of the Supreme Commander-in-ChiefHero CityI Want to LiveInternational Legionand other foreign unitsBelarusian Volunteer CorpsTerror BattalionBlack Maple CompanyCanadian-Ukrainian BrigadeFreedom of Russia LegionGerman Volunteer CorpsKarelian National BattalionKastuś Kalinoŭski RegimentNorman BrigadePahonia RegimentPolish Volunteer CorpsRomanian Battlegroup GeticaRussian Volunteer CorpsSeparate Special Purpose BattalionSibir BattalionTuran BattalionInternational Sponsors of WarForced confiscation law of Russian property[ru;uk]Look for Your OwnLukoil sanctionsMartial lawMobilizationMedia Center UkraineNational Council for the Recovery of Ukraine from the War[uk]National Multi-Subject Test[uk]North Korea–Ukraine relationsPoints of InvincibilityRecognition of IchkeriaRescuer CitySave Ukrainian Culture[uk]Syria–Ukraine relationsUkrainian Freedom OrchestraUnited24United News"
            ],
            [
                "Russia",
                "highways in the annexed territoriesA290A291 \"Tavrida\"R260R280 \"Novorossiya\"2022 Moscow rally2023 Moscow rally2022 Moscow Victory Day Parade2023 Moscow Victory Day Parade2024 Moscow Victory Day Parade2023 Presidential Address to the Federal AssemblyBlockade of Ukraine[ru]Bohdan Khmelnytsky BattalionCensorship in Russia[ru]ChechnyaPro-Ukrainian Chechen fightersConmemorative Medal \"Participant of a Special Military Operation\"[ru]Conversations about Important ThingsKrasovsky caseLegalization of parallel imports[ru]Manifesto of the South Russian People's CouncilMartial lawMasha Moskalyova caseMetropolis of CrimeaMikhail Simonov caseMobilizationRecruitment of irregular forces[ru]Operation DoppelgängerOpinion polling[ru]Orthodox Christmas truce proposalWagner Group–Ministry of Defense conflictRussian Orthodox clergymen appeal against warSalvation Committee for Peace and OrderSpecial Coordinating CouncilUkraine bioweapons conspiracy theoryUnfriendly countries listWar censorship lawsWe Are Together. Sports\"What Russia Should Do with Ukraine\""
            ],
            [
                "United States",
                "2022 Joe Biden speech in Warsaw2022 State of the Union AddressConsolidated Appropriations Act, 2022Consolidated Appropriations Act, 2023Disinformation Governance BoardExecutive Order 14071Pentagon document leaksTask Force KleptoCaptureUkraine Defense Contact GroupUkraine Democracy Defense Lend-Lease ActUkraine Security Assistance Initiative"
            ],
            [
                "Other countries",
                "BelarusCanadaCanada–Ukraine authorization for emergency travelChinaCloser ties with RussiaChinese peace planHong KongCroatiaDenmarkDanish European Union defence opt-out referendumFranceMission AigleGeorgiaGermanyGerman Taurus controversyTaurus leakZeitenwende speechHungaryIndiaOperation GangaIranCloser ties with RussiaIsraelOperation Israel GuaranteesLithuaniaMoldovaNew ZealandRussia Sanctions ActNorth KoreaPolandborder crisis with UkraineSyria[ru]TaiwanUnited KingdomEconomic Crime ActHomes for UkraineOperation Interflex2025 London Summit on UkraineCoalition of the willing"
            ],
            [
                "United Nations",
                "Emergency special sessionResolution ES-11/1Resolution ES-11/2Resolution ES-11/3Resolution ES-11/4Resolution ES-11/5Resolution ES-11/6Resolution ES-11/7Security Council Resolution 2623Resolution A/RES/77/229Easter truce"
            ],
            [
                "Internationalorganizations",
                "Accession of Moldova to the EUAccession of Ukraine to the EUBrussels summitEuropean Political Community1st summit2nd summit3rd summitMadrid summitNATO virtual summitOperation OscarRamstein Air Base meetingEU–Ukraine SummitREPowerEUSteadfast Defender 2024SWIFT ban against Russian banksUkraine Recovery ConferenceVersailles declaration2023 Vilnius summit15th BRICS summit2024 Washington summitWeimar+"
            ],
            [
                "Other",
                "Consecration of RussiaF-16 training coalitionFinland–NATO relationsFinland–Russia border barrierIron diplomacyProposed Russian annexation of South OssetiaRecognition of Russia as a terrorist stateRemoval of monuments and memorialsStreets renamedUkraine Square, OsloServing heads of state and government that have visited Ukraine during the invasionSweden–NATO relationsSwedish anti-terrorism bill"
            ]
        ]
    },
    {
        "heading": "External links",
        "table": [
            [
                "Companies",
                "Address of the Russian Union of RectorsBoycott of Russia and Belarus\"Do not buy Russian goods!\"E.N.O.T. Corp.Igor MangushevMcDonald's in RussiaVkusno i tochkaNashStore[ru]People's SatelliteStarlink satellitesStop Bloody EnergyWagner GroupAndrey Aleksandrovich MedvedevDeath of Nemes TarimoYale CELI List of Companies"
            ],
            [
                "Technology",
                "Anonymous and the invasionalerts.in.uaDDoS attacks on RomaniaDeepStateMap.LiveIT Army of UkraineKillnetLiveuamapOpen-source intelligencepeacenotwarRussian Asset TrackerSquad303[pl]Ukraine Siren AlertsWikipediathreat to block in Russiadetention of Mark Bernstein"
            ],
            [
                "Spies",
                "Diplomatic expulsions during the Russo-Ukrainian WarRussian spies in the Russo-Ukrainian War"
            ],
            [
                "Other",
                "Association of Azovstal Defenders' FamiliesBlack Sea Grain InitiativeCollaboration with RussiaWe Are Together with RussiaConcert for UkraineFree Buryatia FoundationFree Nations of Post-Russia ForumGame4UkraineGet LostGlobal Tour for PeaceGo by the ForestGuide to the Free WorldMozart GroupOlena Zelenska FoundationOpen letter from Nobel laureatesPavel Sudoplatov BattalionRubikus.HelpUARuslan Shostak Charitable FoundationRussia's War Crimes HouseSave UkraineSaving Ukrainian Cultural Heritage OnlineSerhiy Prytula Charity FoundationSpain letter bomb attacksYermak-McFaul Expert Group on Russian SanctionsPavel FilatyevTrue RussiaVolos DeclarationWimbledon ban"
            ]
        ]
    },
    {
        "heading": "External links",
        "table": [
            [
                "Effects",
                "Aircraft lossesCasualtiesjournalists killedRussian generals killedEconomic impactInflation surge2022 Moldovan energy crisisprotests2025 Moldovan energy crisisRussia–EU gas dispute2022 Nord Stream pipeline sabotageRussian debt default2022 Russian oil price cap2022-2024 German economic crisis2023 Russian oil products sanctions and price capEU natural gas price capEducationEnd of the Whisky WarEnvironmental impactEuropean re-armamentEurovision Song Contest 2022RussiaUkraineEurovision Song Contest 2023Food crisesImpact on theatre[uk]List of notable deathsLukoil oil transit disputeNuclear power plantsZaporizhzhia Nuclear Power Plant crisisNuclear riskReligionRussian emigrationThe ArkShip lossesUkrainian cultural heritageart theft and lootingdamaged cultural sitesTraumaUrengoy–Pomary–Uzhhorod pipeline explosionUkrainian energy crisisViolations of non-combatant airspacesWomen"
            ],
            [
                "Humanrights",
                "Humanitarian impactUkrainian refugee crisis2025 Amsterdam stabbing attackSobieskiego 100UN Commission of InquiryUN Human Rights Monitoring Mission"
            ],
            [
                "Terms andphrases",
                "\"And now I will show you where the attack on Belarus was prepared from\"\"Anglo-Saxons\"\"Bavovna\"\"Grandpa in his bunker\"\"Good evening, we are from Ukraine\"\"Orc\"\"Putin khuylo!\"\"Khuy Voyne!\"\"Russia is here forever[uk]\"\"Russian warship, go fuck yourself\"\"Slava Ukraini!\"\"Special military operation\"\"To bomb Voronezh\"\"Strength is in truth\"\"Westsplaining\"\"Where have you been for eight years?\"\"Without you\""
            ],
            [
                "Popularculture",
                "Songs\"12\"\"Bakhmut Fortress\"\"Bayraktar\"\"Bilia topoli\"\"City of Mary\"\"Flowers of Minefields\"\"Generation Cancellation\"\"Generation Z\"\"I'm Russian\"\"Oyda\"\"Hey, Hey, Rise Up!\"\"Mama ŠČ!\"\"Oi u luzi chervona kalyna\"\"Slava Ukraini!\"\"Stefania\"\"Ukraine\"\"Crushed\"Films20 Days in MariupolA Rising FuryFollow MeInterceptedRussians at WarTurn in the WoundUkraine on Fire 2[uk]OtherBabylon'13Back to the Cold WarBorodianka cat[uk]Ghost of KyivKherson watermelonKrálovec RegionMadonna of KyivNorth Atlantic Fella OrganizationNewspeak in Russia[ru;uk]Patron\"Putler\"\"Putinversteher\"Raccoon of KhersonSaint JavelinSaint Mariuburg[ru;uk]Vasylkiv maiolica roosterVladimir Putin's meeting tableWalk of the Brave\"Z\" military symbol",
                "Songs",
                "\"12\"\"Bakhmut Fortress\"\"Bayraktar\"\"Bilia topoli\"\"City of Mary\"\"Flowers of Minefields\"\"Generation Cancellation\"\"Generation Z\"\"I'm Russian\"\"Oyda\"\"Hey, Hey, Rise Up!\"\"Mama ŠČ!\"\"Oi u luzi chervona kalyna\"\"Slava Ukraini!\"\"Stefania\"\"Ukraine\"\"Crushed\"",
                "Films",
                "20 Days in MariupolA Rising FuryFollow MeInterceptedRussians at WarTurn in the WoundUkraine on Fire 2[uk]",
                "Other",
                "Babylon'13Back to the Cold WarBorodianka cat[uk]Ghost of KyivKherson watermelonKrálovec RegionMadonna of KyivNorth Atlantic Fella OrganizationNewspeak in Russia[ru;uk]Patron\"Putler\"\"Putinversteher\"Raccoon of KhersonSaint JavelinSaint Mariuburg[ru;uk]Vasylkiv maiolica roosterVladimir Putin's meeting tableWalk of the Brave\"Z\" military symbol"
            ],
            [
                "Songs",
                "\"12\"\"Bakhmut Fortress\"\"Bayraktar\"\"Bilia topoli\"\"City of Mary\"\"Flowers of Minefields\"\"Generation Cancellation\"\"Generation Z\"\"I'm Russian\"\"Oyda\"\"Hey, Hey, Rise Up!\"\"Mama ŠČ!\"\"Oi u luzi chervona kalyna\"\"Slava Ukraini!\"\"Stefania\"\"Ukraine\"\"Crushed\""
            ],
            [
                "Films",
                "20 Days in MariupolA Rising FuryFollow MeInterceptedRussians at WarTurn in the WoundUkraine on Fire 2[uk]"
            ],
            [
                "Other",
                "Babylon'13Back to the Cold WarBorodianka cat[uk]Ghost of KyivKherson watermelonKrálovec RegionMadonna of KyivNorth Atlantic Fella OrganizationNewspeak in Russia[ru;uk]Patron\"Putler\"\"Putinversteher\"Raccoon of KhersonSaint JavelinSaint Mariuburg[ru;uk]Vasylkiv maiolica roosterVladimir Putin's meeting tableWalk of the Brave\"Z\" military symbol"
            ]
        ]
    },
    {
        "heading": "External links",
        "table": [
            [
                "Films",
                "20 Days in MariupolA Rising FuryFollow MeInterceptedRussians at WarTurn in the WoundUkraine on Fire 2[uk]"
            ],
            [
                "Other",
                "Babylon'13Back to the Cold WarBorodianka cat[uk]Ghost of KyivKherson watermelonKrálovec RegionMadonna of KyivNorth Atlantic Fella OrganizationNewspeak in Russia[ru;uk]Patron\"Putler\"\"Putinversteher\"Raccoon of KhersonSaint JavelinSaint Mariuburg[ru;uk]Vasylkiv maiolica roosterVladimir Putin's meeting tableWalk of the Brave\"Z\" military symbol"
            ]
        ]
    },
    {
        "heading": "External links",
        "table": [
            [
                "Ukrainians",
                "Volodymyr Zelenskyyspeeches during the invasionvisit to the United Statesvisit to the United Kingdomvisits to EuropeAndriy BiletskyAndriy YermakDenis PushilinDenys ShmyhalDenys KireyevDenys MonastyrskyDenys ProkopenkoIryna VenediktovaKyrylo BudanovLeonid PasechnikMykhailo DrapatyiMykola OleschukOleksandr PavlyukOleksandr SyrskyiOleksii ReznikovOleksiy DanilovOleksiy NeizhpapaRuslan KhomchakRustem UmerovSergiy KyslytsyaSerhiy ShaptalaSerhii SternenkoValerii ZaluzhnyiVasyl MalyukVitali KlitschkoYevhen Moisiuk"
            ],
            [
                "Russians",
                "Vladimir PutinAleksandr DvornikovAleksandr LapinAleksey DyuminAleksey NaginAlexander BortnikovAndrei KolesnikovAndrei SychevoiAndrey BelousovAndrey VorobyovDmitry MedvedevGennady ZhidkoIgor KastyukevichIvan PopovMikhail MishustinMaria Lvova-BelovaNikolai PatrushevOleg SalyukovOleg TsokovRamzan KadyrovRoman BerdnikovRustam MuradovSergey KobylashSergey LavrovSergey NaryshkinSergei ShoiguSergey SurovikinTimur IvanovValery GerasimovViktor SokolovViktor ZolotovVitaly GerasimovVyacheslav GladkovVyacheslav VolodinYevgeny Prigozhin"
            ],
            [
                "Other",
                "Alexander Lukashenko"
            ]
        ]
    },
    {
        "heading": "External links",
        "table": [
            {
                "Related": "2023 North Korea–Russia summit2023 visit by Joe Biden to Ukraine2023 visit by Fumio Kishida to Ukraine2023 visit by Xi Jinping to Russia2023 visit by Yoon Suk Yeol to Ukraine2025 Putin–Trump callAnti-drone meshAnti-Russian sentimentAnti-Ukrainian sentimentAntonov An-225 MriyaAxis of UpheavalAzerbaijan Airlines Flight 8243Azovstal Iron and Steel WorksBrovary helicopter crashBryansk Oblast military aircraft crashesClaims of Vladimir Putin's incapacity and deathDecolonization in UkraineDecommunization in UkraineDerussification in UkraineDemolition of monuments to Alexander Pushkin in UkraineForeign leaders that have visited during the invasionInstitute for the Study of WarIrkutsk Su-30 crashIvanovo Ilyushin Il-76 crashKorochansky Ilyushin Il-76 crashKyivstar cyberattack[ru;uk]Lady RincidentMoldovan coup d'état attempt allegationsNord Stream 2Proposed Russian annexation of TransnistriaPunisherRussian nuclear weaponsSarmatRussian military presence in TransnistriaRyazan Il-76 crashSiberian wildfiresSinhury mid-air collision[uk;zh]Soloti military training ground shootingSoviet imageryTerritorial Center of Recruitment and Social SupportTurtle tankU-24 associationUkrainian-African RenaissanceUkrainian conscription crisisWestern long-range weapons in RussiaUral Airlines Flight 1383\"The Vladimir Putin Interview\"Voronezh An-26 crashWagner Group plane crashYeysk Su-34 crashYaroslav Hunka scandalTime of Heroes"
            }
        ]
    },
    {
        "heading": "External links",
        "table": [
            [
                "History",
                "ChronologyScythiansSarmatiansGothsEarly SlavsEast SlavsKuyabaKievan Rus'Principality of KievMongol invasionGalicia–VolhyniaGrand Duchy of LithuaniaPolish–Lithuanian CommonwealthKiev VoivodeshipZaporozhian CossacksSichHetmanatePereiaslav AgreementRussian EmpireGaliciaRevolution and War of IndependenceUkrainian People's RepublicUkrainian StateWest Ukrainian People's RepublicMakhnovshchinaReichskommissariat UkraineUkrainian National CommitteeUkrainian SSRHolodomorEastern Front (World War II)Volhynia massacreChernobyl disasterIndependenceOrange RevolutionEuromaidanRevolution of DignityRusso-Ukrainian WarOutline2014 pro-Russian unrestAnnexation of Crimea by RussiaWar in Donbas2022 Russian invasionBy topicChristianityEconomicMilitary",
                "Chronology",
                "ScythiansSarmatiansGothsEarly SlavsEast SlavsKuyabaKievan Rus'Principality of KievMongol invasionGalicia–VolhyniaGrand Duchy of LithuaniaPolish–Lithuanian CommonwealthKiev VoivodeshipZaporozhian CossacksSichHetmanatePereiaslav AgreementRussian EmpireGaliciaRevolution and War of IndependenceUkrainian People's RepublicUkrainian StateWest Ukrainian People's RepublicMakhnovshchinaReichskommissariat UkraineUkrainian National CommitteeUkrainian SSRHolodomorEastern Front (World War II)Volhynia massacreChernobyl disasterIndependenceOrange RevolutionEuromaidanRevolution of DignityRusso-Ukrainian WarOutline2014 pro-Russian unrestAnnexation of Crimea by RussiaWar in Donbas2022 Russian invasion",
                "By topic",
                "ChristianityEconomicMilitary"
            ],
            [
                "Chronology",
                "ScythiansSarmatiansGothsEarly SlavsEast SlavsKuyabaKievan Rus'Principality of KievMongol invasionGalicia–VolhyniaGrand Duchy of LithuaniaPolish–Lithuanian CommonwealthKiev VoivodeshipZaporozhian CossacksSichHetmanatePereiaslav AgreementRussian EmpireGaliciaRevolution and War of IndependenceUkrainian People's RepublicUkrainian StateWest Ukrainian People's RepublicMakhnovshchinaReichskommissariat UkraineUkrainian National CommitteeUkrainian SSRHolodomorEastern Front (World War II)Volhynia massacreChernobyl disasterIndependenceOrange RevolutionEuromaidanRevolution of DignityRusso-Ukrainian WarOutline2014 pro-Russian unrestAnnexation of Crimea by RussiaWar in Donbas2022 Russian invasion"
            ],
            [
                "By topic",
                "ChristianityEconomicMilitary"
            ],
            [
                "Geography",
                "National parksBiosphere reservesSeven Natural Wonders of UkraineNature reservesPopulated placesCitiesRiversMountainsWaterfallsIslands and sandbarsWorld Heritage SitesWildlife",
                "National parksBiosphere reservesSeven Natural Wonders of UkraineNature reservesPopulated placesCitiesRiversMountainsWaterfallsIslands and sandbarsWorld Heritage SitesWildlife"
            ],
            {
                "vteUkrainearticles": "National parksBiosphere reservesSeven Natural Wonders of UkraineNature reservesPopulated placesCitiesRiversMountainsWaterfallsIslands and sandbarsWorld Heritage SitesWildlife"
            },
            [
                "Politics",
                "Administrative divisionsConstitutionFlagPresidentParliamentGovernmentForeign relationsMilitaryPolitical partiesElectionsJudiciaryLawLaw enforcementUkraine–European Union relationsUkraine–NATO relations",
                "Administrative divisionsConstitutionFlagPresidentParliamentGovernmentForeign relationsMilitaryPolitical partiesElectionsJudiciaryLawLaw enforcementUkraine–European Union relationsUkraine–NATO relations"
            ],
            {
                "vteUkrainearticles": "Administrative divisionsConstitutionFlagPresidentParliamentGovernmentForeign relationsMilitaryPolitical partiesElectionsJudiciaryLawLaw enforcementUkraine–European Union relationsUkraine–NATO relations"
            },
            [
                "Economy",
                "Hryvnia(currency)BankingStock exchangesEnergyElectricityScience and technologyTelecommunicationsTourismTransport",
                "Hryvnia(currency)BankingStock exchangesEnergyElectricityScience and technologyTelecommunicationsTourismTransport"
            ],
            {
                "vteUkrainearticles": "Hryvnia(currency)BankingStock exchangesEnergyElectricityScience and technologyTelecommunicationsTourismTransport"
            },
            [
                "Society",
                "EducationCorruptionGender inequalityHealthAbortionHIV/AIDSSwine flu pandemic(2009–10)COVID-19 pandemicCrimeandsuicideHuman rightsFreedom of the pressLGBTHuman traffickingLanguagesMinoritiesProstitutionReligionCultureAnimationArchitectureKievan Rus'BaroqueArt NouveauArtsCinemaCraftsMotankaKosiv ceramicsPetrykivka paintingPysankaRushnykCuisineBorschtWineDanceDressKobeniakKozhukh/KozhushankaOchipokSharovaryVyshyvankaWreathFolkloreKazkaHolidaysNew YearDay of UnityButter WeekEasterGreen WeekKupala NightIndependence DayPokrova/Defenders DaySaint Nicholas DayChristmasMalankaIntangible Cultural HeritageLiteratureMediaMusicBanduraDuma/DumkaKobzarOperaPhotographySportDemographicsUkrainian peopleRus' peopleRutheniansGente Ruthenus, natione PolonusDiasporaRefugeesImmigration to UkraineCensusesWomen",
                "EducationCorruptionGender inequalityHealthAbortionHIV/AIDSSwine flu pandemic(2009–10)COVID-19 pandemicCrimeandsuicideHuman rightsFreedom of the pressLGBTHuman traffickingLanguagesMinoritiesProstitutionReligion",
                "Culture",
                "AnimationArchitectureKievan Rus'BaroqueArt NouveauArtsCinemaCraftsMotankaKosiv ceramicsPetrykivka paintingPysankaRushnykCuisineBorschtWineDanceDressKobeniakKozhukh/KozhushankaOchipokSharovaryVyshyvankaWreathFolkloreKazkaHolidaysNew YearDay of UnityButter WeekEasterGreen WeekKupala NightIndependence DayPokrova/Defenders DaySaint Nicholas DayChristmasMalankaIntangible Cultural HeritageLiteratureMediaMusicBanduraDuma/DumkaKobzarOperaPhotographySport",
                "Demographics",
                "Ukrainian peopleRus' peopleRutheniansGente Ruthenus, natione PolonusDiasporaRefugeesImmigration to UkraineCensusesWomen"
            ],
            {
                "vteUkrainearticles": "EducationCorruptionGender inequalityHealthAbortionHIV/AIDSSwine flu pandemic(2009–10)COVID-19 pandemicCrimeandsuicideHuman rightsFreedom of the pressLGBTHuman traffickingLanguagesMinoritiesProstitutionReligion"
            },
            [
                "Culture",
                "AnimationArchitectureKievan Rus'BaroqueArt NouveauArtsCinemaCraftsMotankaKosiv ceramicsPetrykivka paintingPysankaRushnykCuisineBorschtWineDanceDressKobeniakKozhukh/KozhushankaOchipokSharovaryVyshyvankaWreathFolkloreKazkaHolidaysNew YearDay of UnityButter WeekEasterGreen WeekKupala NightIndependence DayPokrova/Defenders DaySaint Nicholas DayChristmasMalankaIntangible Cultural HeritageLiteratureMediaMusicBanduraDuma/DumkaKobzarOperaPhotographySport"
            ],
            [
                "Demographics",
                "Ukrainian peopleRus' peopleRutheniansGente Ruthenus, natione PolonusDiasporaRefugeesImmigration to UkraineCensusesWomen"
            ],
            {
                "vteUkrainearticles": "OutlineCategoryPortal"
            }
        ]
    },
    {
        "heading": "External links",
        "table": [
            [
                "By topic",
                "ChristianityEconomicMilitary"
            ]
        ]
    },
    {
        "heading": "External links",
        "table": [
            [
                "Culture",
                "AnimationArchitectureKievan Rus'BaroqueArt NouveauArtsCinemaCraftsMotankaKosiv ceramicsPetrykivka paintingPysankaRushnykCuisineBorschtWineDanceDressKobeniakKozhukh/KozhushankaOchipokSharovaryVyshyvankaWreathFolkloreKazkaHolidaysNew YearDay of UnityButter WeekEasterGreen WeekKupala NightIndependence DayPokrova/Defenders DaySaint Nicholas DayChristmasMalankaIntangible Cultural HeritageLiteratureMediaMusicBanduraDuma/DumkaKobzarOperaPhotographySport"
            ],
            [
                "Demographics",
                "Ukrainian peopleRus' peopleRutheniansGente Ruthenus, natione PolonusDiasporaRefugeesImmigration to UkraineCensusesWomen"
            ]
        ]
    }
]