[
    {
        "url": "https://en.wikipedia.org/wiki/Ozone_depletion"
    },
    {
        "heading": "Ozone depletion",
        "table": [
            [
                "Pollution"
            ],
            [
                "Air pollution from a factory"
            ],
            [
                "AirAcid rainAir quality indexAtmospheric dispersion modelingChlorofluorocarbonCombustionExhaust gasHazeHousehold air pollutionGlobal dimmingGlobal distillationIndoor air qualityNon-exhaust emissionsOzone depletionParticulatesPersistent organic pollutantSmogSootVolatile organic compound"
            ],
            [
                "BiologicalBiological hazardGeneticIllegal loggingIntroduced speciesInvasive species"
            ],
            [
                "DigitalInformation"
            ],
            [
                "ElectromagneticLightEcologicalOverilluminationRadio spectrum"
            ],
            [
                "NaturalOzoneRadium and radon in the environmentVolcanic ashWildfire"
            ],
            [
                "NoiseTransportationHealth effects from noiseMarine mammals and sonarNoise barrierNoise controlSoundproofing"
            ],
            [
                "RadiationActinidesBioremediationDepleted uraniumNuclear fissionNuclear falloutPlutoniumPoisoningRadioactivityUraniumRadioactive waste"
            ],
            [
                "SoilAgriculturalLand degradationBioremediationDefecationElectrical resistance heatingIllegal miningSoil guideline valuesPhytoremediation"
            ],
            [
                "Solid wasteAdvertising mailBiodegradable wasteBrown wasteElectronic wasteFood wasteGreen wasteHazardous wasteIndustrial wasteLitterMiningMunicipal solid wasteNanomaterialsPlasticPackaging wastePost-consumer wasteWaste management"
            ],
            [
                "SpaceSpace debris"
            ],
            [
                "VisualAir travelAdvertising clutterOverhead power linesTraffic signsUrban blightVandalism"
            ],
            [
                "WarChemical warfareHerbicidal warfareAgent OrangeNuclear holocaustNuclear falloutNuclear famineNuclear winterScorched earthUnexploded ordnanceWar and environmental law"
            ],
            [
                "WaterAgricultural wastewaterBiosolidsDiseasesEutrophicationFirewaterFreshwaterGroundwaterHypoxiaIndustrial wastewaterMarineMonitoringNonpoint sourceNutrientOcean acidificationOil spillPharmaceuticalsFreshwater salinizationSeptic tanksSewageShippingSludgeStagnationSulfur waterSurface runoffTurbidityUrban runoffWater qualityWastewater"
            ],
            [
                "TopicsHistoryPollutantsHeavy metalsPaint"
            ],
            [
                "MiscArea sourceBrain health and pollutionDebrisDustGarbologyLegacyThermal pollutionMiddenPoint sourceWasteToxicListsDiseasesLaw by countryMost polluted citiesLeast polluted cities by PM2.5TreatiesMost polluted riversCategoriesBy country",
                "Lists",
                "DiseasesLaw by countryMost polluted citiesLeast polluted cities by PM2.5TreatiesMost polluted rivers",
                "Categories",
                "By country"
            ],
            [
                "Lists"
            ],
            [
                "DiseasesLaw by countryMost polluted citiesLeast polluted cities by PM2.5TreatiesMost polluted rivers"
            ],
            [
                "Categories"
            ],
            [
                "By country"
            ],
            [
                "Environment portalEcology portal"
            ],
            [
                "vte"
            ]
        ]
    },
    {
        "heading": "Ozone depletion",
        "table": [
            {
                "Lists": "DiseasesLaw by countryMost polluted citiesLeast polluted cities by PM2.5TreatiesMost polluted rivers"
            },
            {
                "Lists": "Categories"
            },
            {
                "Lists": "By country"
            }
        ]
    },
    {
        "heading": "Ozone depletion",
        "paragraphs": [
            "Ozone depletionconsists of two related events observed since the late 1970s: a lowered total amount ofozoneinEarth'supper atmosphere, and a much larger springtime decrease instratosphericozone (theozone layer) around Earth's polar regions. The latter phenomenon is referred to as theozone hole. There are also springtime polartropospheric ozone depletion eventsin addition to these stratospheric events.",
            "The main causes of ozone depletion and the ozone hole are manufactured chemicals, especially manufacturedhalocarbonrefrigerants,solvents,propellants, and foam-blowing agents(chlorofluorocarbons(CFCs), HCFCs,halons), referred to asozone-depleting substances(ODS). These compounds are transported into thestratospherebyturbulent mixingafter being emitted from the surface, mixing much faster than the molecules can settle. Once in the stratosphere, they releaseatomsfrom thehalogengroup throughphotodissociation, whichcatalyzethe breakdown of ozone (O3) into oxygen (O2). Both types of ozone depletion were observed to increase as emissions of halocarbons increased.",
            "Ozone depletion and the ozone hole have generated worldwide concern over increased cancer risks and other negative effects. The ozone layer prevents harmful wavelengths ofultraviolet(UVB) light from passing through theEarth's atmosphere. These wavelengths causeskin cancer,sunburn, permanent blindness, andcataracts, which were projected to increase dramatically as a result of thinning ozone, as well as harming plants and animals. These concerns led to the adoption of theMontreal Protocolin 1987, which bans the production of CFCs, halons, and other ozone-depleting chemicals. Over time, scientists have developed new refrigerants with lowerglobal warming potential(GWP) to replace older ones. For example, in new automobiles,R-1234yfsystems are now common, being chosen over refrigerants with much higher GWP such asR-134aandR-12.",
            "The ban came into effect in 1989. Ozone levels stabilized by the mid-1990s and began to recover in the 2000s, as the shifting of thejet streamin the southern hemisphere towards the south pole has stopped and might even be reversing. Recovery was projected to continue over the next century, with the ozone hole expected to reach pre-1980 levels by around 2075. In 2019,NASAreported that the ozone hole was the smallest ever since it was first discovered in 1982.  The UN now projects that under the current regulations the ozone layer will completely regenerate by 2045.  The Montreal Protocol is considered the most successful international environmental agreement to date.  "
        ]
    },
    {
        "heading": "Ozone cycle overview",
        "paragraphs": [
            "Three forms (orallotropes) ofoxygenare involved in theozone-oxygen cycle: oxygen atoms (O or atomic oxygen), oxygen gas (O2or diatomic oxygen), and ozone gas (O3or triatomic oxygen). Ozone is formed in the stratosphere when oxygen gas molecules photodissociate after absorbing UVC photons. This converts a singleO2into two atomic oxygenradicals. The atomic oxygen radicals then combine with separateO2molecules to create twoO3molecules. These ozone molecules absorb UVB light, following which ozone splits into a molecule ofO2and an oxygen atom. The oxygen atom then joins up with an oxygen molecule to regenerate ozone. This is a continuing process that terminates when an oxygen atom recombines with an ozone molecule to make twoO2molecules. It is worth noting that ozone is the only atmospheric gas that absorbs UVB light.",
            "The total amount of ozone in the stratosphere is determined by a balance between photochemical production and recombination.",
            "Ozone can be destroyed by a number offree radicalcatalysts; the most important are thehydroxyl radical(OH·),nitric oxideradical (NO·),chlorineradical (Cl·) andbromineradical (Br·). The dot is a notation to indicate that each species has an unpaired electron and is thus extremely reactive. The effectiveness of differenthalogensandpseudohalogensas catalysts for ozone destruction varies, in part due to differing routes to regenerate the original radical after reacting with ozone or dioxygen. ",
            "While all of the relevant radicals have both natural and man-made sources, human activity has impacted some more than others. As of 2020, most of the OH· and NO· in the stratosphere is naturally occurring, but human activity has drastically increased the levels of chlorine and bromine. These elements are found in stable organic compounds, especiallychlorofluorocarbons, which can travel to the stratosphere without being destroyed in the troposphere due to their low reactivity. Once in the stratosphere, the Cl and Br atoms are released from the parent compounds by the action of ultraviolet light, e.g.",
            "Ozone is a highly reactive molecule that easily reduces to the more stable oxygen form with the assistance of a catalyst. Cl and Br atoms destroy ozone molecules through a variety ofcatalyticcycles. In the simplest example of such a cycle, a chlorine atom reacts with an ozone molecule (O3), taking an oxygen atom to form chlorine monoxide (ClO) and leaving an oxygen molecule (O2). The ClO can react with a second molecule of ozone, releasing the chlorine atom and yielding two molecules of oxygen. The chemical shorthand for these gas-phase reactions is:",
            "The overall effect is a decrease in the amount of ozone, though the rate of these processes can be decreased by the effects ofnull cycles. More complicated mechanisms have also been discovered that lead to ozone destruction in the lower stratosphere.",
            "A single chlorine atom would continuously destroy ozone (thus a catalyst) for up to two years (the time scale for transport back down to the troposphere) except for reactions that remove it from this cycle by forming reservoir species such ashydrogen chloride(HCl) andchlorine nitrate(ClONO2). Bromine is even more efficient than chlorine at destroying ozone on a per-atom basis, but there is much less bromine in the atmosphere at present. Both chlorine and bromine contribute significantly to overall ozone depletion. Laboratory studies have also shown that fluorine and iodine atoms participate in analogous catalytic cycles. However, fluorine atoms react rapidly with water vapour, methane and hydrogen to form strongly boundhydrogen fluoride(HF) in the Earth's stratosphere, while organic molecules containing iodine react so rapidly in the lower atmosphere that they do not reach the stratosphere in significant quantities. ",
            "A single chlorine atom is able to react with an average of 100,000 ozone molecules before it is removed from the catalytic cycle. This fact plus the amount of chlorine released into the atmosphere yearly by chlorofluorocarbons (CFCs) and hydrochlorofluorocarbons (HCFCs) demonstrates the danger of CFCs and HCFCs to the environment.  "
        ]
    },
    {
        "heading": "Observations on ozone layer depletion",
        "paragraphs": [
            "Theozone holeis usually measured by reduction in the totalcolumn ozoneabove a point on the Earth's surface. This is normally expressed inDobson units; abbreviated as \"DU\". The most prominent decrease in ozone has been in the lower stratosphere. Marked decreases in column ozone in theAntarcticspring and early summer compared to the early 1970s and before have been observed using instruments such as theTotal Ozone Mapping Spectrometer(TOMS). ",
            "Reductions of up to 70 percent in the ozone column observed in the austral (southern hemispheric) spring over Antarctica and first reported in 1985 (Farman et al.) are continuing. Antarctic total column ozone in September and October have continued to be 40–50 percent lower than pre-ozone-hole values since the 1990s. A gradual trend toward \"healing\" was reported in 2016. In 2017, NASA announced that the ozone hole was the weakest since 1988 because of warm stratospheric conditions. It is expected to recover around 2070. ",
            "The amount lost is more variable year-to-year in theArcticthan in the Antarctic. The greatest Arctic declines are in the winter and spring, reaching up to 30 percent when the stratosphere is coldest. ",
            "Reactions that take place on polar stratospheric clouds (PSCs) play an important role in enhancing ozone depletion. PSCs form more readily in the extreme cold of the Arctic and Antarctic stratosphere. This is why ozone holes first formed, and are deeper, over Antarctica. Early models failed to take PSCs into account and predicted a gradual global depletion, which is why the sudden Antarctic ozone hole was such a surprise to many scientists.   ",
            "It is more accurate to speak of ozone depletion in middle latitudes rather than holes. Total column ozone declined below pre-1980 values between 1980 and 1996 for mid-latitudes. In the northern mid-latitudes, it then increased from the minimum value by about two percent from 1996 to 2009 as regulations took effect and the amount of chlorine in the stratosphere decreased. In the Southern Hemisphere's mid-latitudes, total ozone remained constant over that time period. There are no significant trends in the tropics, largely because halogen-containing compounds have not had time to break down and release chlorine and bromine atoms at tropical latitudes.  ",
            "Large volcanic eruptions have been shown to have substantial albeit uneven ozone-depleting effects, as observed with the 1991 eruption of Mt. Pinatubo in the Philippines. ",
            "Ozone depletion also explains much of the observed reduction in stratospheric and upper tropospheric temperatures.  The source of the warmth of the stratosphere is the absorption of UV radiation by ozone, hence reduced ozone leads to cooling. Some stratospheric cooling is also predicted from increases ingreenhouse gasessuch asCO2and CFCs themselves; however, the ozone-induced cooling appears to be dominant. ",
            "Predictions of ozone levels remain difficult, but the precision of models' predictions of observed values and the agreement among different modeling techniques have increased steadily. The World Meteorological Organization Global Ozone Research and Monitoring Project—Report No. 44 is strongly in favor of theMontreal Protocol, but notes that aUNEP1994 Assessment overestimated ozone loss for the 1994–1997 period. "
        ]
    },
    {
        "heading": "Compounds in the atmosphere",
        "paragraphs": [
            "Chlorofluorocarbons(CFCs) and other halogenated ozone-depleting substances (ODS) are mainly responsible for man-made chemical ozone depletion. The total amount of effective halogens (chlorine and bromine) in the stratosphere can be calculated and are known as theequivalent effective stratospheric chlorine(EESC). ",
            "CFCs as refrigerants were invented byThomas Midgley Jr.in the 1930s. They were used inair conditioningand cooling units, asaerosol spray propellantsprior to the 1970s, and in the cleaning processes of delicate electronic equipment. They also occur as by-products of some chemical processes. No significant natural sources have ever been identified for these compounds—their presence in the atmosphere is due almost entirely to human manufacture. As mentioned above, when such ozone-depleting chemicals reach the stratosphere, they are dissociated by ultraviolet light to release chlorine atoms. The chlorine atoms act as acatalyst, and each can break down tens of thousands of ozone molecules before being removed from the stratosphere. Given the longevity of CFC molecules, recovery times are measured in decades. It is calculated that a CFC molecule takes an average of about five to seven years to go from the ground level up to the upper atmosphere, and it can stay there for about a century, destroying up to one hundred thousand ozone molecules during that time. [verification needed]",
            "1,1,1-Trichloro-2,2,2-trifluoroethane, also known as CFC-113a, is one of four man-made chemicals newly discovered in the atmosphere by a team at the University of East Anglia. CFC-113a is the only knownCFCwhose abundance in the atmosphere is still growing. Its source remains a mystery, but illegal manufacturing is suspected by some. CFC-113a seems to have been accumulating unabated since 1960. Between 2012 and 2017, concentrations of the gas jumped by 40 percent. ",
            "A study by an international team of researchers published inNaturefound that since 2013 emissions that are predominately from north-eastern China have released large quantities of the banned chemical Chlorofluorocarbon-11 (CFC-11) into the atmosphere. Scientists estimate that without action, these CFC-11 emissions will delay the recovery of the planet's ozone hole by a decade.   ",
            "Satellitesburning up upon re-entry into Earth's atmosphere producealuminum oxide(Al2O3)nanoparticlesthat endure in the atmosphere for decades. Estimates for 2022 alone were ~17 metric tons (~30kg of nanoparticles per ~250kg satellite). Increasing populations ofsatellite constellationscan eventually lead to significant ozone depletion. ",
            "\"Very short-lived substances\" are a class of ozone-depleting chemicals, allowed by theMontreal Protocol, that degrade in under 6 months. 90% are naturally produced, for examplebromine-based chemicals generated by seaweed andphytoplankton, but 10% are manmade, for exampledichloromethane. "
        ]
    },
    {
        "heading": "Computer modeling",
        "paragraphs": [
            "Scientists have attributed ozone depletion to the increase of man-made (anthropogenic) halogen compounds from CFCs by combining observational data with computer models. These complex chemistry transport models (e.g.SLIMCAT,CLaMS—Chemical Lagrangian Model of the Stratosphere) work by combining measurements of chemicals and meteorological fields with chemical reaction rate constants. They identify key chemical reactions and transport processes that bring CFCphotolysisproducts into contact with ozone."
        ]
    },
    {
        "heading": "Ozone hole and its causes",
        "paragraphs": [
            "The Antarctic ozone hole is an area of the Antarctic stratosphere in which the recent ozone levels have dropped to as low as 33 percent of their pre-1975 values. The ozone hole occurs during the Antarctic spring, from September to early December, as strong westerly winds start to circulate around the continent and create an atmospheric container. Within thispolar vortex, over 50 percent of the lower stratospheric ozone is destroyed during the Antarctic spring. ",
            "As explained above, the primary cause of ozone depletion is the presence of chlorine-containing source gases (primarilyCFCsand related halocarbons). In the presence of UV light, these gases dissociate, releasing chlorine atoms, which then go on to catalyze ozone destruction. The Cl-catalyzed ozone depletion can take place in the gas phase, but it is substantially enhanced in the presence ofpolar stratospheric clouds(PSCs). ",
            "These polar stratospheric clouds form during winter, in the extreme cold. Polar winters are dark, consisting of three months without solar radiation (sunlight). The lack of sunlight contributes to a decrease in temperature and the polar vortex traps and chills the air. Temperatures are around or below −80 °C. These low temperatures form cloud particles. There are three types of PSC clouds—nitric acid trihydrate clouds, slowly cooling water-ice clouds, and rapid cooling water-ice (nacreous) clouds—provide surfaces for chemical reactions whose products will, in the spring lead to ozone destruction. ",
            "Thephotochemicalprocesses involved are complex but well understood. The key observation is that, ordinarily, most of the chlorine in the stratosphere resides in \"reservoir\" compounds, primarily chlorine nitrate (ClONO2) as well as stable end products such as HCl. The formation of end products essentially removes Cl from the ozone depletion process. Reservoir compounds sequester Cl, which can later be made available via absorption of light at wavelengths shorter than 400 nm. During the Antarctic winter and spring, reactions on the surface of the polar stratospheric cloud particles convert these \"reservoir\" compounds into reactive free radicals (Cl and ClO). Denitrification is the process by which the clouds removeNO2from the stratosphere by converting it to nitric acid in PSC particles, which then are lost by sedimentation. This prevents newly formed ClO from being converted back intoClONO2.",
            "The role of sunlight in ozone depletion is the reason why the Antarctic ozone depletion is greatest during spring. During winter, even though PSCs are at their most abundant, there is no light over the pole to drive chemical reactions. During the spring, however, sunlight returns and provides energy to drive photochemical reactions and melt the polar stratospheric clouds, releasing considerable ClO, which drives the hole mechanism. Further warming temperatures near the end of spring break up the vortex around mid-December. As warm, ozone andNO2-rich air flows in from lower latitudes, the PSCs are destroyed, the enhanced ozone depletion process shuts down, and the ozone hole closes. ",
            "Most of the ozone that is destroyed is in the lower stratosphere, in contrast to the much smaller ozone depletion through homogeneous gas-phase reactions, which occurs primarily in the upper stratosphere. "
        ]
    },
    {
        "heading": "Effects",
        "paragraphs": [
            "Since the ozone layer absorbsUVBultraviolet light from the sun, ozone layer depletion increases surface UVB levels (all else equal), which could lead to damage, including an increase inskin cancer. This was the reason for the Montreal Protocol. Although decreases in stratospheric ozone are well-tied to CFCs and increases in surface UVB, there is no direct observational evidence linking ozone depletion to higher incidence of skin cancer and eye damage in human beings. This is partly becauseUVA, which has also been implicated in some forms of skin cancer, is not absorbed by ozone, and because it is nearly impossible to control statistics for lifestyle changes over time. Ozone depletion may also influence wind patterns. "
        ]
    },
    {
        "heading": "Increased UV",
        "paragraphs": [
            "Ozone, while a minority constituent in Earth's atmosphere, is responsible for most of the absorption of UVB radiation. The amount of UVB radiation that penetrates through the ozone layerdecreases exponentiallywith the slant-path thickness and density of the layer. When stratospheric ozone levels decrease, higher levels of UVB reach the Earth's surface.  UV-driven phenolic formation in tree rings has dated the start of ozone depletion in northern latitudes to the late 1700s. ",
            "In October 2008, theEcuadorian Space Agencypublished a report called HIPERION. The study used ground instruments in Ecuador and the last 28 years' data from 12 satellites of several countries, and found that the UV radiation reaching equatorial latitudes was far greater than expected, with theUV Indexclimbing as high as 24 inQuito; theWHOconsiders 11 as an extreme index and a great risk to health. The report concluded that depleted ozone levels around the mid-latitudes of the planet are already endangering large populations in these areas. Later, the CONIDA, the Peruvian Space Agency, published its own study, which yielded almost the same findings as the Ecuadorian study."
        ]
    },
    {
        "heading": "Biological effects",
        "paragraphs": [
            "The main public concern regarding the ozone hole has been the effects of increased surface UV radiation on human health. So far, ozone depletion in most locations has been typically a few percent and, as noted above, no direct evidence of health damage is available in most latitudes. If the high levels of depletion seen in the ozone hole were to be common across the globe, the effects could be substantially more dramatic. As the ozone hole over Antarctica has in some instances grown so large as to affect parts ofAustralia,New Zealand,Chile,Argentina, andSouth Africa, environmentalists have been concerned that the increase in surface UV could be significant. Excessive ultraviolet radiation (UVR) has reducing effects on the rates of photosynthesis and growth of benthicdiatomcommunities (microalgae species that increase water quality and are pollution resistant) that are present in shallow freshwater. Ozone depletion not only affects human health but also has a profound impact on biodiversity. It damages plants and trees at the cellular level, affecting their growth, vitality, photosynthesis, water balance, and defense mechanisms against pests and diseases. This sets off a cascade of ecological impacts, harming soil microbes, insects, wildlife, and entire ecosystems. ",
            "Ozone depletion would magnify all of theeffects of UV on human health, both positive (including production of vitamin D) and negative (including sunburn, skin cancer, and cataracts). In addition, increased surface UV leads to increased tropospheric ozone, which is a health risk to humans. ",
            "The most common forms of skin cancer in humans,basalandsquamouscell carcinomas, have been strongly linked to UV-B exposure. The mechanism by which UVB induces these cancers is well understood—absorption of UV-B radiation causes the pyrimidine bases in the DNA molecule to formdimers, resulting in transcription errors when the DNA replicates. These cancers are relatively mild and rarely fatal, although the treatment of squamous cell carcinoma sometimes requires extensive reconstructive surgery. By combining epidemiological data with results of animal studies, scientists have estimated that every one percent decrease in long-term stratospheric ozone would increase the incidence of these cancers by 2%. ",
            "Another form of skin cancer,Melanoma, is much less common but far more dangerous, being lethal in about 15–20 percent of the cases diagnosed. The relationship between melanoma and ultraviolet exposure is not yet fully understood, but it appears that both UV-B and UV-A are involved. Because of this uncertainty, it is difficult to estimate the effect of ozone depletion on melanoma incidence. One study showed that a 10 percent increase in UV-B radiation was associated with a 19 percent increase in melanomas for men and 16 percent for women. A study of people inPunta Arenas, at the southern tip ofChile, showed a 56 percent increase in melanoma and a 46 percent increase in non-melanoma skin cancer over a period of seven years, along with decreased ozone and increased UVB levels. ",
            "Epidemiological studies suggest an association between ocular cortical cataracts and UV-B exposure, using crude approximations of exposure and various cataract assessment techniques. A detailed assessment of ocular exposure to UV-B was carried out in a study on Chesapeake Bay Watermen, where increases in average annual ocular exposure were associated with increasing risk of cortical opacity. In this highly exposed group of predominantly white males, the evidence linking cortical opacities to sunlight exposure was the strongest to date. Based on these results, ozone depletion is predicted to cause hundreds of thousands of additional cataracts by 2050. ",
            "Increased surface UV leads to increasedtroposphericozone.Ground-level ozoneis generally recognized to be a health risk, as ozone is toxic due to its strongoxidantproperties. The risks are particularly high for young children, the elderly, and those with asthma or other respiratory difficulties. At this time, ozone at ground level is produced mainly by the action of UV radiation oncombustiongases from vehicle exhausts. ",
            "Vitamin Dis produced in the skin by ultraviolet light. Thus, higher UVB exposure raises human vitamin D in those deficient in it. Recent research (primarily since the Montreal Protocol) shows that many humans have less than optimal vitamin D levels. In particular, in the U.S. population, the lowest quarter of vitamin D (<17.8 ng/ml) were found using information from the National Health and Nutrition Examination Survey to be associated with an increase in all-cause mortality in the general population. While blood level of vitamin D in excess of 100 ng/ml appear to raise blood calcium excessively and to be associated with higher mortality, the body has mechanisms that prevent sunlight from producing vitamin D in excess of the body's requirements. ",
            "A November 2011 report by scientists at the Institute of Zoology in London, England found thatwhalesoff the coast of California have shown a sharp rise in sun damage, and these scientists \"fear that the thinning ozone layer is to blame\". The study photographed and took skin biopsies from over 150 whales in the Gulf of California and found \"widespread evidence of epidermal damage commonly associated with acute and severe sunburn\", having cells that form when the DNA is damaged by UV radiation. The findings suggest \"rising UV levels as a result of ozone depletion are to blame for the observed skin damage, in the same way that human skin cancer rates have been on the increase in recent decades.\" Apart from whales many other animals such as dogs, cats, sheep and terrestrial ecosystems also suffer the negative effects of increased UV-B radiations. ",
            "An increase of UV radiation would be expected to affect crops. A number of economically important species of plants, such asrice, depend oncyanobacteriaresiding on their roots for the retention ofnitrogen.Cyanobacteriaare sensitive to UV radiation and would be affected by its increase. \"Despite mechanisms to reduce or repair the effects of increased ultraviolet radiation, plants have a limited ability to adapt to increased levels of UVB, therefore plant growth can be directly affected by UVB radiation.\" ",
            "Over the years, the Arctic ozone layer has depleted severely. As a consequence species that live above the snow cover or in areas where snow has melted abundantly, due to hot temperatures, are negatively impacted due to UV radiation that reaches the ground. Depletion of the ozone layer and allowing excess UVB radiation would initially be assumed to increase damage to plant DNA. Reports have found that when plants are exposed to UVB radiation similar to stratospheric ozone depletion, there was no significant change in plant height or leaf mass, but showed a response in shoot biomass and leaf area with a small decrease. However, UVB radiation has been shown to decrease quantum yield of photosystem II. UVB damage only occurs under extreme exposure, and most plants also have UVB absorbing flavonoids which allow them to acclimatize to the radiation present. Plants experience different levels of UV radiation throughout the day. It is known that they are able to shift the levels and types of UV sunscreens (i.e. flavonoids), that they contain, throughout the day. This allows them to increase their protection against UV radiation. Plants that have been affected by radiation throughout development are more affected by the inability to intercept light with a larger leaf area than having photosynthetic systems compromised. Damage from UVB radiation is more likely to be significant on species interactions than on plants themselves. ",
            "Another significant impact of ozone depletion on plant life is the stress experienced by plants when exposed to UV radiation. This can cause a decrease in plant growth and an increase in oxidative stress, due to the production of nitric oxide and hydrogen peroxide. In areas where substantial ozone depletion has occurred, increased UV-B radiation reduces terrestrial plant productivity (and likewise carbon sequestration) by about 6%.  ",
            "Moreover, if plants are exposed to high levels of UV radiation, it can elicit the production of harmfulvolatile organic compounds, like isoprenes. The emission of isoprenes into the air, by plants, can severely impact the environment by adding to air pollution and increasing the amount of carbon in the atmosphere, ultimately contributing to climate change. "
        ]
    },
    {
        "heading": "Public policy",
        "paragraphs": [
            "The full extent of the damage that CFCs have caused to the ozone layer is not known and will not be known for decades; however, marked decreases in column ozone have already been observed. The Montreal and Vienna conventions were installed long before a scientific consensus was established or important uncertainties in the science field were being resolved. The ozone case was understood comparably well by lay persons as e.g.Ozone shieldorozone holewere useful \"easy-to-understand bridging metaphors\". Americans voluntarily switched away from aerosol sprays, resulting in a 50 percent sales loss even before legislation was enforced. ",
            "After a 1976 report by theUnited States National Academy of Sciencesconcluded that credible scientific evidence supported the ozone depletion hypothesis a few countries, including the United States, Canada, Sweden, Denmark, and Norway, moved to eliminate the use of CFCs in aerosol spray cans. At the time this was widely regarded as a first step towards a more comprehensive regulation policy, but progress in this direction slowed in subsequent years, due to a combination of political factors (continued resistance from the halocarbon industry and a general change in attitude towards environmental regulation during the first two years of the Reagan administration) and scientific developments (subsequent National Academy assessments that indicated that the first estimates of the magnitude of ozone depletion had been overly large).",
            "A critical DuPont manufacturing patent forFreonwasset to expire in 1979. The United States banned the use of CFCs in aerosol cans in 1978. The European Community rejected proposals to ban CFCs in aerosol sprays, and in the U.S., CFCs continued to be used as refrigerants and for cleaning circuit boards. Worldwide CFC production fell sharply after the U.S. aerosol ban, but by 1986 had returned nearly to its 1976 level. In 1993,DuPontCanada closed its CFC facility. ",
            "The U.S. government's attitude began to change again in 1983, whenWilliam RuckelshausreplacedAnne M. Burfordas Administrator of theUnited States Environmental Protection Agency(EPA). Under Ruckelshaus and his successor, Lee Thomas, the EPA pushed for an international approach to halocarbon regulations. In 1985 twenty nations, including most of the major CFC producers, signed theVienna Convention for the Protection of the Ozone Layer, which established a framework for negotiating international regulations on ozone-depleting substances. That same year, the discovery of the Antarctic ozone hole was announced, causing a revival in public attention to the issue.",
            "In 1987, representatives from 43 nations signed theMontreal Protocol. Meanwhile, the halocarbon industry shifted its position and started supporting a protocol to limit CFC production. However, this shift was uneven with DuPont acting more quickly than its European counterparts. DuPont may have feared court action related to increased skin cancer, especially as the EPA had published a study in 1986 claiming that an additional 40 million cases and 800,000 cancer deaths were to be expected in the U.S. in the next 88 years. The EU shifted its position as well after Germany gave up its defence of the CFC industry and started supporting moves towards regulation. Government and industry in France and the UK tried to defend their CFC producing industries even after the Montreal Protocol had been signed. ",
            "At Montreal, the participants agreed to freeze production of CFCs at 1986 levels and to reduce production by 50 percent by 1999. After a series of scientific expeditions to the Antarctic produced convincing evidence that the ozone hole was indeed caused by chlorine and bromine from manmade organohalogens, the Montreal Protocol was strengthened at a 1990 meeting in London. The participants agreed to phase out CFCs and halons entirely (aside from a very small amount marked for certain \"essential\" uses, such asasthma inhalers) by 2000 in non-Article 5 countries and by 2010 in Article 5 (less developed) signatories. At a 1992 meeting in Copenhagen, Denmark, the phase-out date was moved up to 1996. At the same meeting,methyl bromide(MeBr), a fumigant used primarily in agricultural production, was added to the list of controlled substances. For all substances controlled under the protocol, phaseout schedules were delayed for less developed ('Article 5(1)') countries, and phaseout in these countries was supported by transfers of expertise, technology, and money from non-Article 5(1) Parties to the Protocol. Additionally, exemptions from the agreed schedules could be applied for under the Essential Use Exemption (EUE) process for substances other than methyl bromide and under the Critical Use Exemption (CUE) process for methyl bromide.  ",
            "Civil society, including especially non-governmental organizations (NGOs), played critical roles at all stages of policy development leading to the Vienna Conference, the Montreal Protocol, and in assessing compliance afterwards.    The major companies claimed that no alternatives to HFC existed. An ozone-safe hydrocarbon refrigerant was developed at a technological institute in Hamburg, Germany, consisting of a mixture of the hydrocarbon gasespropaneandbutane, and in 1992 came to the attention of the NGO Greenpeace. Greenpeace called it \"Greenfreeze\".  The NGO then worked successfully first with a small and struggling company to market an appliance beginning in Europe, then Asia and later Latin America, receiving a 1997 UNEP award.  By 1995, Germany had made CFC refrigerators illegal. Since 2004, corporations like Coca-Cola, Carlsberg, and IKEA formed a coalition to promote the ozone-safe Greenfreeze units. Production spread to companies like Electrolux, Bosch, and LG, with sales reaching some 300 million refrigerators by 2008.  In Latin America, a domestic Argentinian company began Greenfreeze production in 2003, while the giant Bosch in Brazil began a year later.  By 2013 it was being used by some 700 million refrigerators, making up about 40 percent of the market. ",
            "In the U.S., however, change has been much slower. To some extent, CFCs were being replaced by the less damaging hydrochlorofluorocarbons (HCFCs), although concerns remain regarding HCFCs also. In some applications, hydrofluorocarbons (HFCs) were being used to replace CFCs. HFCs, which contain no chlorine or bromine, do not contribute to ozone depletion although they are potent greenhouse gases. The best known of these compounds is probably HFC-134a (R-134a), which in the United States has largely replaced CFC-12 (R-12) in automobile air conditioners. In laboratory analytics (a former \"essential\" use) the ozone depleting substances can be replaced with other solvents. Chemical companies like Du Pont, whose representatives disparaged Greenfreeze as \"that German technology,\" maneuvered the EPA to block the technology in the U.S. until 2011.    Ben & Jerry's of Unilever and General Electric, spurred by Greenpeace, had expressed formal interest in 2008 which figured in the EPA's final approval.  ",
            "The EU recast its Ozone Regulation in 2009. The law bans ozone-depleting substances with the goal of protecting the ozone layer. The list of ODS that are subject to the regulation is the same as those under the Montreal Protocol, with some additions.",
            "More recently, policy experts have advocated for efforts to link ozone protection efforts to climate protection efforts.  Many ODS are also greenhouse gases, some thousands of times more powerful agents of radiative forcing than carbon dioxide over the short and medium term. Thus policies protecting the ozone layer have had benefits in mitigatingclimate change. The reduction of the radiative forcing due to ODS probably masked the true level of climate change effects of other greenhouse gases, and was responsible for the \"slow down\" of global warming from the mid-90s. [additional citation(s) needed]Policy decisions in one arena affect the costs and effectiveness of environmental improvements in the other."
        ]
    },
    {
        "heading": "ODS requirements in the marine industry",
        "paragraphs": [
            "TheIMOhas amendedMARPOLAnnex VI Regulation 12 regarding ozone depleting substances. As from July 1, 2010, all vessels where MARPOL Annex VI is applicable should have a list of equipment using ozone depleting substances. The list should include the name of ODS, type and location of equipment, quantity in kg and date. All changes since that date should be recorded in an ODS Record book on board recording all intended or unintended releases to the atmosphere. Furthermore, new ODS supply or landing to shore facilities should be recorded as well."
        ]
    },
    {
        "heading": "Prospects of ozone depletion",
        "paragraphs": [
            "Since the adoption and strengthening of theMontreal Protocolhas led to reductions in the emissions of CFCs, atmospheric concentrations of the most-significant compounds have been declining. These substances are being gradually removed from the atmosphere; since peaking in 1994, the Effective Equivalent Chlorine (EECl) level in the atmosphere had dropped about 10 percent by 2008. The decrease in ozone-depleting chemicals has also been significantly affected by a decrease inbromine-containing chemicals. The data suggest that substantial natural sources exist for atmosphericmethyl bromide(CH3Br). The phase-out of CFCs means thatnitrous oxide(N2O), which is not covered by the Montreal Protocol, has become the most highly emitted ozone-depleting substance and is expected to remain so throughout the 21st century. ",
            "According to the IPCC Sixth Assessment Report, global stratospheric ozone levels experienced rapid decline in the 1970s and 1980s and have since been increasing, but have not reached preindustrial levels. Although considerable variability is expected from year to year, including in polar regions where depletion is largest, the ozone layer is expected to continue recovering in coming decades due to declining ozone-depleting substance concentrations, assuming full compliance with the Montreal Protocol. ",
            "The Antarctic ozone hole is expected to continue for decades. Ozone concentrations in the lower stratosphere over Antarctica increased by 5–10 percent by 2020 and will return to pre-1980 levels by about 2060–2075. This is 10–25 years later than predicted in earlier assessments, because of revised estimates of atmospheric concentrations of ozone-depleting substances, including a larger predicted future usage in developing countries. Another factor that may prolong ozone depletion is the drawdown of nitrogen oxides from above the stratosphere due to changing wind patterns. A gradual trend toward \"healing\" was reported in 2016. In 2019, the ozone hole was at its smallest in the previous thirty years, due to the warmer polar stratosphere weakening the polar vortex. In September 2023, the Antarctic ozone hole was one of the largest on record, at 26 million square kilometers. The anomalously large ozone loss may have been a result of the2022 Tonga volcanic eruption. According to a 2023 United Nations assessment, the ozone layer is on track to recover to 1980 levels by around 2066 over Antarctica, by 2045 over the Arctic, and by 2040 for the rest of the world, assuming current regulations remain in place. "
        ]
    },
    {
        "heading": "Research history",
        "paragraphs": [
            "The basic physical and chemical processes that lead to the formation of an ozone layer in the Earth's stratosphere were discovered bySydney Chapmanin 1930. Short-wavelength UV radiation splits an oxygen (O2) molecule into two oxygen (O) atoms, which then combine with other oxygen molecules to form ozone. Ozone is removed when an oxygen atom and an ozone molecule \"recombine\" to form two oxygen molecules, i.e. O +O3→ 2O2. In the 1950s, David Bates and Marcel Nicolet presented evidence that various free radicals, in particular hydroxyl (OH) and nitric oxide (NO), could catalyze this recombination reaction, reducing the overall amount of ozone. These free radicals were known to be present in the stratosphere, and so were regarded as part of the natural balance—it was estimated that in their absence, the ozone layer would be about twice as thick as it currently is.",
            "In 1970Paul Crutzenpointed out that emissions ofnitrous oxide(N2O), a stable, long-lived gas produced by soil bacteria, from the Earth's surface could affect the amount ofnitric oxide(NO) in the stratosphere. Crutzen showed that nitrous oxide lives long enough to reach the stratosphere, where it is converted into NO. Crutzen then noted that increasing use offertilizersmight have led to an increase in nitrous oxide emissions over the natural background, which would in turn result in an increase in the amount of NO in the stratosphere. Thus human activity could affect the stratospheric ozone layer. In the following year, Crutzen and (independently) Harold Johnston suggested that NO emissions fromsupersonic passenger aircraft, which would fly in the lower stratosphere, could also deplete the ozone layer. However, more recent analysis in 1995 by David W. Fahey, an atmospheric scientist at theNational Oceanic and Atmospheric Administration, found that the drop in ozone would be from 1–2 percent if a fleet of 500 supersonic passenger aircraft were operated. This, Fahey expressed, would not be a showstopper for advanced supersonic passenger aircraft development. "
        ]
    },
    {
        "heading": "Rowland–Molina hypothesis",
        "paragraphs": [
            "In 1974Frank Sherwood Rowland, Chemistry Professor at the University of California at Irvine, and his postdoctoral associateMario J. Molinasuggested that long-lived organic halogen compounds, such as CFCs, might behave in a similar fashion as Crutzen had proposed for nitrous oxide.James Lovelockhad recently discovered, during a cruise in the South Atlantic in 1971, that almost all of the CFC compounds manufactured since their invention in 1930 were still present in the atmosphere. Molina and Rowland concluded that, likeN2O, the CFCs would reach the stratosphere where they would be dissociated by UV light, releasing chlorine atoms. A year earlier,Richard StolarskiandRalph Ciceroneat the University of Michigan had shown that Cl is even more efficient than NO at catalyzing the destruction of ozone. Similar conclusions were reached byMichael McElroyandSteven WofsyatHarvard University. Neither group, however, had realized that CFCs were a potentially large source of stratospheric chlorine—instead, they had been investigating the possible effects of HCl emissions from theSpace Shuttle, which are very much smaller.",
            "The Rowland–Molina hypothesis was strongly disputed by representatives of the aerosol and halocarbon industries. The Chair of the Board ofDuPontwas quoted as saying that ozone depletion theory is \"a science fiction tale ... a load of rubbish ... utter nonsense\". Robert Abplanalp, the President of Precision Valve Corporation (and inventor of the first practical aerosol spray can valve), wrote to the Chancellor ofUC Irvineto complain about Rowland's public statements. Nevertheless, within three years most of the basic assumptions made by Rowland and Molina were confirmed by laboratory measurements and by direct observation in the stratosphere. The concentrations of the source gases (CFCs and related compounds) and the chlorine reservoir species (HCl andClONO2) were measured throughout the stratosphere, and demonstrated that CFCs were indeed the major source of stratospheric chlorine, and that nearly all of the CFCs emitted would eventually reach the stratosphere. Even more convincing was the measurement, by James G. Anderson and collaborators, of chlorine monoxide (ClO) in the stratosphere. ClO is produced by the reaction of Cl with ozone—its observation thus demonstrated that Cl radicals not only were present in the stratosphere but also were actually involved in destroying ozone. McElroy and Wofsy extended the work of Rowland and Molina by showing that bromine atoms were even more effective catalysts for ozone loss than chlorine atoms and argued that thebrominated organic compoundsknown ashalons, widely used in fire extinguishers, were a potentially large source of stratospheric bromine. In 1976 theUnited States National Academy of Sciencesreleased a report concluding that the ozone depletion hypothesis was strongly supported by the scientific evidence. In response the United States, Canada and Norway banned the use of CFCs inaerosol spray cansin 1978. Early estimates were that, if CFC production continued at 1977 levels, the total atmospheric ozone would after a century or so reach a steady state, 15 to 18 percent below normal levels. By 1984, when better evidence on the speed of critical reactions was available, this estimate was changed to 5 to 9 percent steady-state depletion. ",
            "Crutzen, Molina, and Rowland were awarded the 1995Nobel Prize in Chemistryfor their work on stratospheric ozone."
        ]
    },
    {
        "heading": "Antarctic ozone hole",
        "paragraphs": [
            "The discovery of the Antarctic \"ozone hole\" byBritish Antarctic SurveyscientistsFarman,GardinerandShanklin(first reported in a paper inNaturein May 1985 ) came as a shock to the scientific community, because the observed decline in polar ozone was far larger than had been anticipated. Satellite measurements(TOMSonboardNimbus 7) showing massive depletion of ozone around thesouth polewere becoming available at the same time. However, these were initially rejected as unreasonable by data quality control algorithms (they were filtered out as errors since the values were unexpectedly low); the ozone hole was detected only in satellite data when the raw data was reprocessed following evidence of ozone depletion inin situobservations. When thesoftwarewas rerun without the flags, the ozone hole was seen as far back as 1976. ",
            "Susan Solomon, an atmospheric chemist at theNational Oceanic and Atmospheric Administration(NOAA), proposed thatchemical reactionsonpolar stratospheric clouds(PSCs) in the coldAntarcticstratospherecaused a massive, though localized and seasonal, increase in the amount ofchlorinepresent in active, ozone-destroying forms. The polar stratospheric clouds in Antarctica are only formed at very low temperatures, as low as −80 °C, and early spring conditions. In such conditions theice crystalsof the cloud provide a suitable surface for conversion of unreactive chlorine compounds into reactive chlorine compounds, which can easily deplete ozone.",
            "Moreover, thepolar vortexformed overAntarcticais very tight and the reaction occurring on the surface of the cloud crystals is far different from when it occurs in atmosphere. These conditions have led to ozone hole formation in Antarctica. Thishypothesiswas decisively confirmed, first bylaboratorymeasurements and subsequently by direct measurements, from the ground and from high-altitudeairplanes, of very high concentrations ofchlorine monoxide(ClO) in the Antarctic stratosphere. ",
            "Alternative hypotheses, which had attributed the ozone hole to variations in solarUV radiationor to changes in atmospheric circulation patterns, were also tested and shown to be untenable. ",
            "Meanwhile, analysis of ozone measurements from the worldwide network of ground-based Dobson spectrophotometers led an international panel to conclude that the ozone layer was in fact being depleted, at all latitudes outside of the tropics. These trends were confirmed by satellite measurements. As a consequence, the major halocarbon-producing nations agreed to phase out production of CFCs, halons, and related compounds, a process that was completed in 1996.",
            "Since 1981 theUnited Nations Environment Programme, under the auspices of the World Meteorological Organization, has sponsored a series of technical reports on theScientific Assessment of Ozone Depletion, based on satellite measurements. The 2007 report showed that the hole in the ozone layer was recovering and the smallest it had been for about a decade. ",
            "A 2010 report found, \"Over the past decade, global ozone and ozone in the Arctic and Antarctic regions is no longer decreasing but is not yet increasing. The ozone layer outside the Polar regions is projected to recover to its pre-1980 levels some time before the middle of this century. In contrast, the springtime ozone hole over the Antarctic is expected to recover much later.\" ",
            "In 2012,NOAAandNASAreported \"Warmer air temperatures high above the Antarctic led to the second smallest season ozone hole in 20 years averaging 17.9 million square kilometres. The hole reached its maximum size for the season on Sept 22, stretching to 21.2 million square kilometres.\" A gradual trend toward \"healing\" was reported in 2016 and then in 2017. It is reported that the recovery signal is evident even in the ozone loss saturation altitudes. ",
            "The hole in the Earth's ozone layer over the South Pole has affected atmospheric circulation in the Southern Hemisphere all the way to the equator. The ozone hole has influenced atmospheric circulation all the way to the tropics and increased rainfall at low, subtropical latitudes in the Southern Hemisphere. "
        ]
    },
    {
        "heading": "Arctic ozone \"mini-hole\"",
        "paragraphs": [
            "On March 3, 2005, the journalNature published an article linking 2004's unusually large Arctic ozone hole to solar wind activity.",
            "On March 15, 2011, a record ozone layer loss was observed, with about half of the ozone present over the Arctic having been destroyed.   The change was attributed to increasingly cold winters in the Arctic stratosphere at an altitude of approximately 20 km (12 mi), a change associated with global warming in a relationship that is still under investigation. By March 25, the ozone loss had become the largest compared to that observed in all previous winters with the possibility that it would become an ozone hole. This would require that the quantities of ozone to fall below 200 Dobson units, from the 250 recorded over central Siberia. It is predicted that the thinning layer would affect parts of Scandinavia and Eastern Europe on March 30–31. ",
            "On October 2, 2011, a study was published in the journalNature, which said that between December 2010 and March 2011 up to 80 percent of the ozone in the atmosphere at about 20 kilometres (12 mi) above the surface was destroyed. The level of ozone depletion was severe enough that scientists said it could be compared to the ozone hole that forms over Antarctica every winter. According to the study, \"for the first time, sufficient loss occurred to reasonably be described as an Arctic ozone hole.\" The study analyzed data from theAuraandCALIPSOsatellites, and determined that the larger-than-normal ozone loss was due to an unusually long period of cold weather in the Arctic, some 30 days more than typical, which allowed for more ozone-destroying chlorine compounds to be created. According to Lamont Poole, a co-author of the study, cloud and aerosol particles on which the chlorine compounds are found \"were abundant in the Arctic until mid March 2011—much later than usual—with average amounts at some altitudes similar to those observed in the Antarctic, and dramatically larger than the near-zero values seen in March in most Arctic winters\". ",
            "In 2013, researchers analyzed the data and found the 2010–2011 Arctic event did not reach the ozone depletion levels to classify as a true hole. A hole in the ozone is generally classified as 220 Dobson units or lower; the Arctic hole did not approach that low level.  It has since been classified as a \"mini-hole.\" ",
            "Following the ozone depletion in 1997 and 2011, a 90% drop in ozone was measured byweather balloonsover the Arctic in March 2020, as they normally recorded 3.5 parts per million of ozone, compared to only around 0.3 parts per million lastly, due to the coldest temperatures ever recorded since 1979, and a strong polarvortexwhich allowed chemicals, including chlorine and bromine, to reduce ozone. ",
            "A rare hole, the result of unusually low temperatures in the atmosphere above the North Pole, was studied in 2020.  "
        ]
    },
    {
        "heading": "Tibet ozone hole",
        "paragraphs": [
            "As winters that are colder are more affected, at times there is an ozone hole over Tibet. In 2006, a 2.5 millionsquare kilometerozone hole was detected over Tibet. Again in 2011, an ozone hole appeared over mountainous regions ofTibet,Xinjiang,Qinghaiand theHindu Kush, along with an unprecedented hole over the Arctic, though the Tibet one was far less intense than the ones over the Arctic or Antarctic. "
        ]
    },
    {
        "heading": "Potential depletion by storm clouds",
        "paragraphs": [
            "Research in 2012 showed that the same process that produces the ozone hole over Antarctica, occurs over summer storm clouds in the United States, and thus may be destroying ozone there as well.  "
        ]
    },
    {
        "heading": "Ozone hole over tropics",
        "paragraphs": [
            "Physicist Qing-Bin Lu, of the University of Waterloo, claimed to have discovered a large, all-season ozone hole in the lower stratosphere over the tropics in July 2022. However, other researchers in the field refuted this claim, stating that the research was riddled with \"serious errors and unsubstantiated assertions.\" According to Dr Paul Young, a lead author of the 2022 WMO/UNEP Scientific Assessment of Ozone Depletion, \"The author's identification of a 'tropical ozone hole' is down to him looking at percentage changes in ozone, rather than absolute changes, with the latter being much more relevant for damaging UV reaching the surface.\" Specifically, Lu's work defines \"ozone hole\" as \"an area with O3 loss in percent larger than 25%, with respect to the undisturbed O3 value when there were no significant CFCs in the stratosphere (~ in the 1960s)\" instead of the general definition of 220 Dobson units or lower. Dr Marta Abalos Alvarez has added \"Ozone depletion in the tropics is nothing new and is mainly due to the acceleration of the Brewer-Dobson circulation.\""
        ]
    },
    {
        "heading": "Depletion caused by wildfire smoke",
        "paragraphs": [
            "Analyzing the atmospheric impacts of the2019–2020 Australian bushfire season, scientists led by MIT researcher Susan Solomon found the smoke destroyed 3–5% of ozone in affected areas of the Southern Hemisphere. Smoke particles absorbhydrogen chlorideand act as a catalyst to create chlorine radicals that destroy ozone.    "
        ]
    },
    {
        "heading": "Ozone depletion and global warming",
        "paragraphs": [
            "Among others,Robert Watsonhad a role in the science assessment and in the regulation efforts ofozone depletion and global warming. Prior to the 1980s, the EU, NASA, NAS, UNEP, WMO and the British government had dissenting scientific reports and Watson played a role in the process of unified assessments. Based on the experience with the ozone case, the IPCC started to work on a unified reporting and science assessment to reach a consensus to provide theIPCC Summary for Policymakers.",
            "There are various areas of linkage between ozone depletion and global warming science:",
            "In 2019, NASA reported that there was no significant relation between size of the ozone hole and climate change. "
        ]
    },
    {
        "heading": "CFC weight",
        "paragraphs": [
            "Since CFC molecules are heavier than air (nitrogen or oxygen), it is commonly believed that the CFC molecules cannot reach the stratosphere in significant amounts. However, atmospheric gases are not sorted by weight at these altitudes; the forces of wind can fully mix the gases in the atmosphere. Some of the heavier CFCs are not evenly distributed. "
        ]
    },
    {
        "heading": "Percentage of man-made chlorine",
        "paragraphs": [
            "Another misconception is that \"it is generally accepted that natural sources of tropospheric chlorine are four to five times larger than man-made ones.\" While this statement is strictly true,troposphericchlorine is irrelevant; it isstratosphericchlorine that affects ozone depletion. Chlorine fromocean sprayis soluble and thus is washed by rainfall before it reaches the stratosphere. CFCs, in contrast, are insoluble and long-lived, allowing them to reach the stratosphere. In the lower atmosphere, there is much more chlorine from CFCs and relatedhaloalkanesthan there is in HCl from salt spray, and in the stratosphere halocarbons are dominant. Only methyl chloride, which is one of these halocarbons, has a mainly natural source, and it is responsible for about 20 percent of the chlorine in the stratosphere; the remaining 80 percent comes from manmade sources.",
            "Very violent volcanic eruptions can inject HCl into the stratosphere, but researchers have shown that the contribution is not significant compared to that from CFCs. A similar erroneous assertion is that soluble halogen compounds from the volcanic plume ofMount Erebuson Ross Island, Antarctica are a major contributor to the Antarctic ozone hole. ",
            "Nevertheless, a 2015 study showed that the role ofMount Erebusvolcano in the Antarctic ozone depletion was probably underestimated. Based on theNCEP/NCAR reanalysisdata over the last 35 years and by using the NOAAHYSPLITtrajectory model, researchers showed that Erebus volcano gas emissions (includinghydrogen chloride(HCl)) can reach the Antarctic stratosphere via high-latitude cyclones and then thepolar vortex. Depending on Erebus volcano activity, the additional annual HCl mass entering the stratosphere from Erebus varies from 1.0 to 14.3 kt."
        ]
    },
    {
        "heading": "First observation",
        "paragraphs": [
            "G.M.B. Dobsonmentioned that when springtime ozone levels in the Antarctic overHalley Baywere first measured in 1956, he was surprised to find that they were ~320 DU, or about 150 DU below spring Arctic levels of ~450 DU. These were at that time the only known Antarctic ozone values available. What Dobson describes is essentially thebaselinefrom which the ozone hole is measured: actual ozone hole values are in the 150–100 DU range. ",
            "The discrepancy between the Arctic and Antarctic noted by Dobson was primarily a matter of timing: during the Arctic spring, ozone levels rose smoothly, peaking in April, whereas in the Antarctic they stayed approximately constant during early spring, rising abruptly in November when the polar vortex broke down.",
            "The behavior seen in the Antarctic ozone hole is different. Instead of staying constant, early springtime ozone levels drop from their already low winter values, by as much as 50 percent, and normal values are not reached again until December. "
        ]
    },
    {
        "heading": "Location of hole",
        "paragraphs": [
            "Some people thought that the ozone hole should be above the sources of CFCs. However, CFCs are well mixed globally in thetroposphereandstratosphere. The reason for occurrence of the ozone hole above Antarctica is not because there are more CFCs concentrated but because the low temperatures help form polar stratospheric clouds. In fact, there are findings of significant and localized \"ozone holes\" above other parts of the Earth, such as above Central Asia. "
        ]
    },
    {
        "heading": "Awareness campaigns",
        "paragraphs": [
            "Public misconceptions and misunderstandings of complex issues like ozone depletion are common. The limited scientific knowledge of the public led to confusion about global warming or the perception of global warming as a subset of the \"ozone hole\". In the beginning, classical green NGOs refrained from using CFC depletion for campaigning, as they assumed the topic was too complicated. They became active much later, e.g. in Greenpeace's support for a CFC-free refrigerator produced by the former East German companyVEBdkk Scharfenstein.  ",
            "The metaphors used in the CFC discussion (ozone shield, ozone hole) are not \"exact\" in the scientific sense. The \"ozone hole\" is more of adepression, less \"a hole in the windshield\". The ozone does not disappear through the layer, nor is there a uniform \"thinning\" of the ozone layer. However, they resonated better with non-scientists and their concerns. The ozone hole was seen as a \"hot issue\" and imminent risk as laypeople feared severe personal consequences such as skin cancer, cataracts, damage to plants, and reduction of plankton populations in the ocean's photic zone. Not only on the policy level,ozone regulation compared to climate changefared much better in public opinion. Americans voluntarily switched away from aerosol sprays before legislation was enforced, while climate change failed to achieve comparable concern and public action. The sudden identification in 1985 that there was a substantial \"hole\" was widely reported in the press. The especially rapid ozone depletion in Antarctica had previously been dismissed as a measurement error. Scientific consensus was established after regulation. ",
            "While the Antarctic ozone hole has a relatively small effect on global ozone, the hole has generated a great deal of public interest because:"
        ]
    },
    {
        "heading": "World Ozone Day",
        "paragraphs": [
            "In 1994, theUnited Nations General Assemblyvoted to designate September 16 as theInternational Day for the Preservation of the Ozone Layer, or \"World Ozone Day\". The designation commemorates the signing of theMontreal Protocol on that date in 1987. "
        ]
    },
    {
        "heading": "External links",
        "table": [
            [
                "General",
                "AnthropoceneEcological footprintEnvironmental impact assessmentEnvironmental issueslist of issuesHuman impacton marine lifeList of global issuesImpact assessmentPlanetary boundariesSocial ecology (ethics)"
            ],
            [
                "Causes",
                "Causes of climate changeAgricultureanimal agriculturecannabis cultivationirrigationmeat productioncocoa productionpalm oil(US)BitcoinCorporate behaviorDeforestation and climate changeEnergy industrybiofuelsbiodieselcoalelectricityenergyfashionfracking (US)nuclear poweroil shalepetroleumreservoirstransportGenetic pollutionEnvironmental crimeExplosivesIndustrialisationLand useManufacturingcleaning agentsconcretefashionplasticsnanotechnologypaintpaperpesticidespharmaceuticals and personal careMarine lifefishingfishing down the food webmarine pollutionoverfishingMiningOverconsumptionOverdraftingOverexploitationOvergrazingParticulatesPollutionQuarryingReservoirsTourismTransportaviationrailroadsshippingUrbanizationurban sprawlWar"
            ],
            [
                "Effects",
                "Biodiversity threatsbiodiversity lossdecline in amphibian populationsdecline in insect populationsClimate changerunaway climate changein the United StatesDeforestationDefaunationDesertificationEcocideEcological crisisEffects of climate changeEffects of climate change on agricultureMultiple breadbasket failureEffects of climate change on livestockEnvironmental insecurityEnvironmental issues in the United StatesCoral reefsExternalityForest diebackEnvironmental degradationErosionFreshwater cycleGreenhouse gas emissionsHabitat destructionHolocene extinctionNitrogen cycleLand degradationLand consumptionLand surface effects on climateLoss and damageLoss of green beltsPhosphorus cycleOcean acidificationOzone depletionResource depletionTechnofossilizationTropical cyclones and climate changeWater degradationWater pollutionWater scarcity"
            ],
            [
                "Mitigation",
                "Alternative fuel vehicle propulsionBirth controlCleaner productionClimate change mitigationCommunity resilienceCultured meatDecouplingEcological engineeringEnvironmental engineeringEnvironmental mitigationIndustrial ecologyMitigation bankingOrganic farmingRecyclingReforestationurbanRestoration ecologySustainabilitySustainable consumptionWaste minimization"
            ],
            {
                "vteHuman impact on the environment": "CommonsCategoryby countryassessmentmitigation"
            }
        ]
    },
    {
        "heading": "External links",
        "table": [
            [
                "OverviewCauses of climate changeEffects of climate changeClimate change mitigationClimate change adaptationBy country and region",
                "Overview",
                "Causes of climate changeEffects of climate changeClimate change mitigationClimate change adaptationBy country and region"
            ],
            {
                "vteClimate change": "Overview"
            },
            {
                "vteClimate change": "Causes of climate changeEffects of climate changeClimate change mitigationClimate change adaptationBy country and region"
            },
            [
                "CausesOverviewClimate systemGreenhouse effect(Carbon dioxide in Earth's atmosphere)Scientific consensus on climate changeSourcesDeforestationFossil fuelGreenhouse gasesGreenhouse gas emissionsCarbon accountingCarbon footprintCarbon leakagefrom agriculturefrom wetlandsWorld energy supply and consumption",
                "Causes",
                "OverviewClimate systemGreenhouse effect(Carbon dioxide in Earth's atmosphere)Scientific consensus on climate changeSourcesDeforestationFossil fuelGreenhouse gasesGreenhouse gas emissionsCarbon accountingCarbon footprintCarbon leakagefrom agriculturefrom wetlandsWorld energy supply and consumption",
                "Overview",
                "Climate systemGreenhouse effect(Carbon dioxide in Earth's atmosphere)Scientific consensus on climate change",
                "Sources",
                "DeforestationFossil fuelGreenhouse gasesGreenhouse gas emissionsCarbon accountingCarbon footprintCarbon leakagefrom agriculturefrom wetlandsWorld energy supply and consumption"
            ],
            {
                "vteClimate change": "Causes"
            },
            [
                "OverviewClimate systemGreenhouse effect(Carbon dioxide in Earth's atmosphere)Scientific consensus on climate changeSourcesDeforestationFossil fuelGreenhouse gasesGreenhouse gas emissionsCarbon accountingCarbon footprintCarbon leakagefrom agriculturefrom wetlandsWorld energy supply and consumption",
                "Overview",
                "Climate systemGreenhouse effect(Carbon dioxide in Earth's atmosphere)Scientific consensus on climate change",
                "Sources",
                "DeforestationFossil fuelGreenhouse gasesGreenhouse gas emissionsCarbon accountingCarbon footprintCarbon leakagefrom agriculturefrom wetlandsWorld energy supply and consumption"
            ],
            [
                "Overview",
                "Climate systemGreenhouse effect(Carbon dioxide in Earth's atmosphere)Scientific consensus on climate change"
            ],
            [
                "Sources",
                "DeforestationFossil fuelGreenhouse gasesGreenhouse gas emissionsCarbon accountingCarbon footprintCarbon leakagefrom agriculturefrom wetlandsWorld energy supply and consumption"
            ],
            [
                "HistoryHistory of climate change policy and politicsHistory of climate change scienceSvante ArrheniusJames HansenCharles David KeelingUnited Nations Climate Change conferencesYears in climate change201920202021202220232024",
                "History",
                "History of climate change policy and politicsHistory of climate change scienceSvante ArrheniusJames HansenCharles David KeelingUnited Nations Climate Change conferencesYears in climate change201920202021202220232024"
            ],
            {
                "vteClimate change": "History"
            },
            {
                "vteClimate change": "History of climate change policy and politicsHistory of climate change scienceSvante ArrheniusJames HansenCharles David KeelingUnited Nations Climate Change conferencesYears in climate change201920202021202220232024"
            },
            [
                "Effects and issuesPhysicalAbrupt climate changeAnoxic eventArctic methane emissionsArctic sea ice declineAtlantic meridional overturning circulationDroughtExtreme weatherFloodCoastal floodingHeat waveMarineUrban heat islandOceansacidificationdeoxygenationheat contentsea surface temperaturestratificationtemperatureOzone depletionPermafrost thawRetreat of glaciers since 1850Sea level riseSeason creepClimate sensitivityTipping points in the climate systemTropical cyclonesWater cycleWildfiresFlora and faunaBiomesMass mortality eventBirdsExtinction riskForest diebackInvasive speciesMarine lifePlant biodiversitySocial and economicAgricultureLivestockMulti-breadbasket failureUnited StatesChildrenCitiesCivilizational collapseCrimeDepopulation of settlementsDestruction of cultural heritageDisabilityEconomic impactsU.S. insurance industryFisheriesGenderHealthMental healthHuman rightsIndigenous peoplesInfectious diseasesMigrationPovertyPsychological impactsSecurity and conflictUrban floodingWater scarcityWater securityBy country and regionAfricaAmericasAntarcticaArcticAsiaAustraliaCaribbeanEuropeMiddle East and North AfricaSmall island countriesby individual country",
                "Effects and issues",
                "PhysicalAbrupt climate changeAnoxic eventArctic methane emissionsArctic sea ice declineAtlantic meridional overturning circulationDroughtExtreme weatherFloodCoastal floodingHeat waveMarineUrban heat islandOceansacidificationdeoxygenationheat contentsea surface temperaturestratificationtemperatureOzone depletionPermafrost thawRetreat of glaciers since 1850Sea level riseSeason creepClimate sensitivityTipping points in the climate systemTropical cyclonesWater cycleWildfiresFlora and faunaBiomesMass mortality eventBirdsExtinction riskForest diebackInvasive speciesMarine lifePlant biodiversitySocial and economicAgricultureLivestockMulti-breadbasket failureUnited StatesChildrenCitiesCivilizational collapseCrimeDepopulation of settlementsDestruction of cultural heritageDisabilityEconomic impactsU.S. insurance industryFisheriesGenderHealthMental healthHuman rightsIndigenous peoplesInfectious diseasesMigrationPovertyPsychological impactsSecurity and conflictUrban floodingWater scarcityWater securityBy country and regionAfricaAmericasAntarcticaArcticAsiaAustraliaCaribbeanEuropeMiddle East and North AfricaSmall island countriesby individual country",
                "Physical",
                "Abrupt climate changeAnoxic eventArctic methane emissionsArctic sea ice declineAtlantic meridional overturning circulationDroughtExtreme weatherFloodCoastal floodingHeat waveMarineUrban heat islandOceansacidificationdeoxygenationheat contentsea surface temperaturestratificationtemperatureOzone depletionPermafrost thawRetreat of glaciers since 1850Sea level riseSeason creepClimate sensitivityTipping points in the climate systemTropical cyclonesWater cycleWildfires",
                "Flora and fauna",
                "BiomesMass mortality eventBirdsExtinction riskForest diebackInvasive speciesMarine lifePlant biodiversity",
                "Social and economic",
                "AgricultureLivestockMulti-breadbasket failureUnited StatesChildrenCitiesCivilizational collapseCrimeDepopulation of settlementsDestruction of cultural heritageDisabilityEconomic impactsU.S. insurance industryFisheriesGenderHealthMental healthHuman rightsIndigenous peoplesInfectious diseasesMigrationPovertyPsychological impactsSecurity and conflictUrban floodingWater scarcityWater security",
                "By country and region",
                "AfricaAmericasAntarcticaArcticAsiaAustraliaCaribbeanEuropeMiddle East and North AfricaSmall island countriesby individual country"
            ],
            {
                "vteClimate change": "Effects and issues"
            },
            [
                "PhysicalAbrupt climate changeAnoxic eventArctic methane emissionsArctic sea ice declineAtlantic meridional overturning circulationDroughtExtreme weatherFloodCoastal floodingHeat waveMarineUrban heat islandOceansacidificationdeoxygenationheat contentsea surface temperaturestratificationtemperatureOzone depletionPermafrost thawRetreat of glaciers since 1850Sea level riseSeason creepClimate sensitivityTipping points in the climate systemTropical cyclonesWater cycleWildfiresFlora and faunaBiomesMass mortality eventBirdsExtinction riskForest diebackInvasive speciesMarine lifePlant biodiversitySocial and economicAgricultureLivestockMulti-breadbasket failureUnited StatesChildrenCitiesCivilizational collapseCrimeDepopulation of settlementsDestruction of cultural heritageDisabilityEconomic impactsU.S. insurance industryFisheriesGenderHealthMental healthHuman rightsIndigenous peoplesInfectious diseasesMigrationPovertyPsychological impactsSecurity and conflictUrban floodingWater scarcityWater securityBy country and regionAfricaAmericasAntarcticaArcticAsiaAustraliaCaribbeanEuropeMiddle East and North AfricaSmall island countriesby individual country",
                "Physical",
                "Abrupt climate changeAnoxic eventArctic methane emissionsArctic sea ice declineAtlantic meridional overturning circulationDroughtExtreme weatherFloodCoastal floodingHeat waveMarineUrban heat islandOceansacidificationdeoxygenationheat contentsea surface temperaturestratificationtemperatureOzone depletionPermafrost thawRetreat of glaciers since 1850Sea level riseSeason creepClimate sensitivityTipping points in the climate systemTropical cyclonesWater cycleWildfires",
                "Flora and fauna",
                "BiomesMass mortality eventBirdsExtinction riskForest diebackInvasive speciesMarine lifePlant biodiversity",
                "Social and economic",
                "AgricultureLivestockMulti-breadbasket failureUnited StatesChildrenCitiesCivilizational collapseCrimeDepopulation of settlementsDestruction of cultural heritageDisabilityEconomic impactsU.S. insurance industryFisheriesGenderHealthMental healthHuman rightsIndigenous peoplesInfectious diseasesMigrationPovertyPsychological impactsSecurity and conflictUrban floodingWater scarcityWater security",
                "By country and region",
                "AfricaAmericasAntarcticaArcticAsiaAustraliaCaribbeanEuropeMiddle East and North AfricaSmall island countriesby individual country"
            ],
            [
                "Physical",
                "Abrupt climate changeAnoxic eventArctic methane emissionsArctic sea ice declineAtlantic meridional overturning circulationDroughtExtreme weatherFloodCoastal floodingHeat waveMarineUrban heat islandOceansacidificationdeoxygenationheat contentsea surface temperaturestratificationtemperatureOzone depletionPermafrost thawRetreat of glaciers since 1850Sea level riseSeason creepClimate sensitivityTipping points in the climate systemTropical cyclonesWater cycleWildfires"
            ],
            [
                "Flora and fauna",
                "BiomesMass mortality eventBirdsExtinction riskForest diebackInvasive speciesMarine lifePlant biodiversity"
            ],
            [
                "Social and economic",
                "AgricultureLivestockMulti-breadbasket failureUnited StatesChildrenCitiesCivilizational collapseCrimeDepopulation of settlementsDestruction of cultural heritageDisabilityEconomic impactsU.S. insurance industryFisheriesGenderHealthMental healthHuman rightsIndigenous peoplesInfectious diseasesMigrationPovertyPsychological impactsSecurity and conflictUrban floodingWater scarcityWater security"
            ],
            [
                "By country and region",
                "AfricaAmericasAntarcticaArcticAsiaAustraliaCaribbeanEuropeMiddle East and North AfricaSmall island countriesby individual country"
            ],
            [
                "MitigationEconomics and financeCarbon budgetCarbon emission tradingCarbon offsets and creditsGold Standard (carbon offset standard)Carbon priceCarbon taxClimate debtClimate financeClimate risk insuranceCo-benefits of climate change mitigationEconomics of climate change mitigationFossil fuel divestmentGreen Climate FundLow-carbon economyNet zero emissionsEnergyCarbon capture and storageEnergy transitionFossil fuel phase-outNuclear powerRenewable energySustainable energyPreserving and enhancingcarbon sinksBlue carbonCarbon dioxide removalCarbon sequestrationDirect air captureCarbon farmingClimate-smart agricultureForest managementafforestationforestry for carbon sequestrationREDD and REDD+reforestationLand use, land-use change, and forestry(LULUCF and AFOLU)Nature-based solutionsOtherIndividual action on climate changePlant-based dietSolar radiation modification",
                "Mitigation",
                "Economics and financeCarbon budgetCarbon emission tradingCarbon offsets and creditsGold Standard (carbon offset standard)Carbon priceCarbon taxClimate debtClimate financeClimate risk insuranceCo-benefits of climate change mitigationEconomics of climate change mitigationFossil fuel divestmentGreen Climate FundLow-carbon economyNet zero emissionsEnergyCarbon capture and storageEnergy transitionFossil fuel phase-outNuclear powerRenewable energySustainable energyPreserving and enhancingcarbon sinksBlue carbonCarbon dioxide removalCarbon sequestrationDirect air captureCarbon farmingClimate-smart agricultureForest managementafforestationforestry for carbon sequestrationREDD and REDD+reforestationLand use, land-use change, and forestry(LULUCF and AFOLU)Nature-based solutionsOtherIndividual action on climate changePlant-based dietSolar radiation modification",
                "Economics and finance",
                "Carbon budgetCarbon emission tradingCarbon offsets and creditsGold Standard (carbon offset standard)Carbon priceCarbon taxClimate debtClimate financeClimate risk insuranceCo-benefits of climate change mitigationEconomics of climate change mitigationFossil fuel divestmentGreen Climate FundLow-carbon economyNet zero emissions",
                "Energy",
                "Carbon capture and storageEnergy transitionFossil fuel phase-outNuclear powerRenewable energySustainable energy",
                "Preserving and enhancingcarbon sinks",
                "Blue carbonCarbon dioxide removalCarbon sequestrationDirect air captureCarbon farmingClimate-smart agricultureForest managementafforestationforestry for carbon sequestrationREDD and REDD+reforestationLand use, land-use change, and forestry(LULUCF and AFOLU)Nature-based solutions",
                "Other",
                "Individual action on climate changePlant-based dietSolar radiation modification"
            ],
            {
                "vteClimate change": "Mitigation"
            },
            [
                "Economics and financeCarbon budgetCarbon emission tradingCarbon offsets and creditsGold Standard (carbon offset standard)Carbon priceCarbon taxClimate debtClimate financeClimate risk insuranceCo-benefits of climate change mitigationEconomics of climate change mitigationFossil fuel divestmentGreen Climate FundLow-carbon economyNet zero emissionsEnergyCarbon capture and storageEnergy transitionFossil fuel phase-outNuclear powerRenewable energySustainable energyPreserving and enhancingcarbon sinksBlue carbonCarbon dioxide removalCarbon sequestrationDirect air captureCarbon farmingClimate-smart agricultureForest managementafforestationforestry for carbon sequestrationREDD and REDD+reforestationLand use, land-use change, and forestry(LULUCF and AFOLU)Nature-based solutionsOtherIndividual action on climate changePlant-based dietSolar radiation modification",
                "Economics and finance",
                "Carbon budgetCarbon emission tradingCarbon offsets and creditsGold Standard (carbon offset standard)Carbon priceCarbon taxClimate debtClimate financeClimate risk insuranceCo-benefits of climate change mitigationEconomics of climate change mitigationFossil fuel divestmentGreen Climate FundLow-carbon economyNet zero emissions",
                "Energy",
                "Carbon capture and storageEnergy transitionFossil fuel phase-outNuclear powerRenewable energySustainable energy",
                "Preserving and enhancingcarbon sinks",
                "Blue carbonCarbon dioxide removalCarbon sequestrationDirect air captureCarbon farmingClimate-smart agricultureForest managementafforestationforestry for carbon sequestrationREDD and REDD+reforestationLand use, land-use change, and forestry(LULUCF and AFOLU)Nature-based solutions",
                "Other",
                "Individual action on climate changePlant-based dietSolar radiation modification"
            ],
            [
                "Economics and finance",
                "Carbon budgetCarbon emission tradingCarbon offsets and creditsGold Standard (carbon offset standard)Carbon priceCarbon taxClimate debtClimate financeClimate risk insuranceCo-benefits of climate change mitigationEconomics of climate change mitigationFossil fuel divestmentGreen Climate FundLow-carbon economyNet zero emissions"
            ],
            [
                "Energy",
                "Carbon capture and storageEnergy transitionFossil fuel phase-outNuclear powerRenewable energySustainable energy"
            ],
            [
                "Preserving and enhancingcarbon sinks",
                "Blue carbonCarbon dioxide removalCarbon sequestrationDirect air captureCarbon farmingClimate-smart agricultureForest managementafforestationforestry for carbon sequestrationREDD and REDD+reforestationLand use, land-use change, and forestry(LULUCF and AFOLU)Nature-based solutions"
            ],
            [
                "Other",
                "Individual action on climate changePlant-based dietSolar radiation modification"
            ],
            [
                "Society andadaptationSocietyBusiness actionClimate actionClimate emergency declarationClimate movementSchool Strike for ClimateDenialEcological griefGovernanceJusticeLitigationPoliticsPublic opinionWomenAdaptationAdaptation strategies on the German coastAdaptive capacityDisaster risk reductionEcosystem-based adaptationFlood controlLoss and damageManaged retreatNature-based solutionsResilienceRiskVulnerabilityThe Adaptation FundNational Adaptation Programme of ActionCommunicationClimate Change Performance IndexClimate crisis (term)Climate spiralEducationMedia coveragePopular culture depictionsartfictionvideo gamesWarming stripesInternational agreementsGlasgow Climate PactKyoto ProtocolParis AgreementCooperative Mechanisms under Article 6 of the Paris AgreementNationally determined contributionsSustainable Development Goal 13United Nations Framework Convention on Climate Change",
                "Society andadaptation",
                "SocietyBusiness actionClimate actionClimate emergency declarationClimate movementSchool Strike for ClimateDenialEcological griefGovernanceJusticeLitigationPoliticsPublic opinionWomenAdaptationAdaptation strategies on the German coastAdaptive capacityDisaster risk reductionEcosystem-based adaptationFlood controlLoss and damageManaged retreatNature-based solutionsResilienceRiskVulnerabilityThe Adaptation FundNational Adaptation Programme of ActionCommunicationClimate Change Performance IndexClimate crisis (term)Climate spiralEducationMedia coveragePopular culture depictionsartfictionvideo gamesWarming stripesInternational agreementsGlasgow Climate PactKyoto ProtocolParis AgreementCooperative Mechanisms under Article 6 of the Paris AgreementNationally determined contributionsSustainable Development Goal 13United Nations Framework Convention on Climate Change",
                "Society",
                "Business actionClimate actionClimate emergency declarationClimate movementSchool Strike for ClimateDenialEcological griefGovernanceJusticeLitigationPoliticsPublic opinionWomen",
                "Adaptation",
                "Adaptation strategies on the German coastAdaptive capacityDisaster risk reductionEcosystem-based adaptationFlood controlLoss and damageManaged retreatNature-based solutionsResilienceRiskVulnerabilityThe Adaptation FundNational Adaptation Programme of Action",
                "Communication",
                "Climate Change Performance IndexClimate crisis (term)Climate spiralEducationMedia coveragePopular culture depictionsartfictionvideo gamesWarming stripes",
                "International agreements",
                "Glasgow Climate PactKyoto ProtocolParis AgreementCooperative Mechanisms under Article 6 of the Paris AgreementNationally determined contributionsSustainable Development Goal 13United Nations Framework Convention on Climate Change"
            ],
            {
                "vteClimate change": "Society andadaptation"
            },
            [
                "SocietyBusiness actionClimate actionClimate emergency declarationClimate movementSchool Strike for ClimateDenialEcological griefGovernanceJusticeLitigationPoliticsPublic opinionWomenAdaptationAdaptation strategies on the German coastAdaptive capacityDisaster risk reductionEcosystem-based adaptationFlood controlLoss and damageManaged retreatNature-based solutionsResilienceRiskVulnerabilityThe Adaptation FundNational Adaptation Programme of ActionCommunicationClimate Change Performance IndexClimate crisis (term)Climate spiralEducationMedia coveragePopular culture depictionsartfictionvideo gamesWarming stripesInternational agreementsGlasgow Climate PactKyoto ProtocolParis AgreementCooperative Mechanisms under Article 6 of the Paris AgreementNationally determined contributionsSustainable Development Goal 13United Nations Framework Convention on Climate Change",
                "Society",
                "Business actionClimate actionClimate emergency declarationClimate movementSchool Strike for ClimateDenialEcological griefGovernanceJusticeLitigationPoliticsPublic opinionWomen",
                "Adaptation",
                "Adaptation strategies on the German coastAdaptive capacityDisaster risk reductionEcosystem-based adaptationFlood controlLoss and damageManaged retreatNature-based solutionsResilienceRiskVulnerabilityThe Adaptation FundNational Adaptation Programme of Action",
                "Communication",
                "Climate Change Performance IndexClimate crisis (term)Climate spiralEducationMedia coveragePopular culture depictionsartfictionvideo gamesWarming stripes",
                "International agreements",
                "Glasgow Climate PactKyoto ProtocolParis AgreementCooperative Mechanisms under Article 6 of the Paris AgreementNationally determined contributionsSustainable Development Goal 13United Nations Framework Convention on Climate Change"
            ],
            [
                "Society",
                "Business actionClimate actionClimate emergency declarationClimate movementSchool Strike for ClimateDenialEcological griefGovernanceJusticeLitigationPoliticsPublic opinionWomen"
            ],
            [
                "Adaptation",
                "Adaptation strategies on the German coastAdaptive capacityDisaster risk reductionEcosystem-based adaptationFlood controlLoss and damageManaged retreatNature-based solutionsResilienceRiskVulnerabilityThe Adaptation FundNational Adaptation Programme of Action"
            ],
            [
                "Communication",
                "Climate Change Performance IndexClimate crisis (term)Climate spiralEducationMedia coveragePopular culture depictionsartfictionvideo gamesWarming stripes"
            ],
            [
                "International agreements",
                "Glasgow Climate PactKyoto ProtocolParis AgreementCooperative Mechanisms under Article 6 of the Paris AgreementNationally determined contributionsSustainable Development Goal 13United Nations Framework Convention on Climate Change"
            ],
            [
                "Background and theoryMeasurementsGlobal surface temperatureInstrumental temperature recordProxySatellite temperature measurementTheoryAlbedoCarbon cycleatmosphericbiologicoceanicpermafrostCarbon sinkClimate sensitivityClimate variability and changeCloud feedbackCloud forcingFixed anvil temperature hypothesisCryosphereEarth's energy budgetExtreme event attributionFeedbacksGlobal warming potentialIllustrative model of greenhouse effect on climate changeOrbital forcingRadiative forcingResearch and modellingClimate change scenarioClimate modelCoupled Model Intercomparison ProjectIntergovernmental Panel on Climate Change (IPCC)IPCC Sixth Assessment ReportPaleoclimatologyRepresentative Concentration PathwayShared Socioeconomic Pathways",
                "Background and theory",
                "MeasurementsGlobal surface temperatureInstrumental temperature recordProxySatellite temperature measurementTheoryAlbedoCarbon cycleatmosphericbiologicoceanicpermafrostCarbon sinkClimate sensitivityClimate variability and changeCloud feedbackCloud forcingFixed anvil temperature hypothesisCryosphereEarth's energy budgetExtreme event attributionFeedbacksGlobal warming potentialIllustrative model of greenhouse effect on climate changeOrbital forcingRadiative forcingResearch and modellingClimate change scenarioClimate modelCoupled Model Intercomparison ProjectIntergovernmental Panel on Climate Change (IPCC)IPCC Sixth Assessment ReportPaleoclimatologyRepresentative Concentration PathwayShared Socioeconomic Pathways",
                "Measurements",
                "Global surface temperatureInstrumental temperature recordProxySatellite temperature measurement",
                "Theory",
                "AlbedoCarbon cycleatmosphericbiologicoceanicpermafrostCarbon sinkClimate sensitivityClimate variability and changeCloud feedbackCloud forcingFixed anvil temperature hypothesisCryosphereEarth's energy budgetExtreme event attributionFeedbacksGlobal warming potentialIllustrative model of greenhouse effect on climate changeOrbital forcingRadiative forcing",
                "Research and modelling",
                "Climate change scenarioClimate modelCoupled Model Intercomparison ProjectIntergovernmental Panel on Climate Change (IPCC)IPCC Sixth Assessment ReportPaleoclimatologyRepresentative Concentration PathwayShared Socioeconomic Pathways"
            ],
            {
                "vteClimate change": "Background and theory"
            },
            [
                "MeasurementsGlobal surface temperatureInstrumental temperature recordProxySatellite temperature measurementTheoryAlbedoCarbon cycleatmosphericbiologicoceanicpermafrostCarbon sinkClimate sensitivityClimate variability and changeCloud feedbackCloud forcingFixed anvil temperature hypothesisCryosphereEarth's energy budgetExtreme event attributionFeedbacksGlobal warming potentialIllustrative model of greenhouse effect on climate changeOrbital forcingRadiative forcingResearch and modellingClimate change scenarioClimate modelCoupled Model Intercomparison ProjectIntergovernmental Panel on Climate Change (IPCC)IPCC Sixth Assessment ReportPaleoclimatologyRepresentative Concentration PathwayShared Socioeconomic Pathways",
                "Measurements",
                "Global surface temperatureInstrumental temperature recordProxySatellite temperature measurement",
                "Theory",
                "AlbedoCarbon cycleatmosphericbiologicoceanicpermafrostCarbon sinkClimate sensitivityClimate variability and changeCloud feedbackCloud forcingFixed anvil temperature hypothesisCryosphereEarth's energy budgetExtreme event attributionFeedbacksGlobal warming potentialIllustrative model of greenhouse effect on climate changeOrbital forcingRadiative forcing",
                "Research and modelling",
                "Climate change scenarioClimate modelCoupled Model Intercomparison ProjectIntergovernmental Panel on Climate Change (IPCC)IPCC Sixth Assessment ReportPaleoclimatologyRepresentative Concentration PathwayShared Socioeconomic Pathways"
            ],
            [
                "Measurements",
                "Global surface temperatureInstrumental temperature recordProxySatellite temperature measurement"
            ],
            [
                "Theory",
                "AlbedoCarbon cycleatmosphericbiologicoceanicpermafrostCarbon sinkClimate sensitivityClimate variability and changeCloud feedbackCloud forcingFixed anvil temperature hypothesisCryosphereEarth's energy budgetExtreme event attributionFeedbacksGlobal warming potentialIllustrative model of greenhouse effect on climate changeOrbital forcingRadiative forcing"
            ],
            [
                "Research and modelling",
                "Climate change scenarioClimate modelCoupled Model Intercomparison ProjectIntergovernmental Panel on Climate Change (IPCC)IPCC Sixth Assessment ReportPaleoclimatologyRepresentative Concentration PathwayShared Socioeconomic Pathways"
            ],
            {
                "vteClimate change": "Climate change portalCategoryGlossaryIndex"
            }
        ]
    },
    {
        "heading": "External links",
        "table": [
            {
                "Overview": "Causes of climate changeEffects of climate changeClimate change mitigationClimate change adaptationBy country and region"
            }
        ]
    },
    {
        "heading": "External links",
        "table": [
            [
                "OverviewClimate systemGreenhouse effect(Carbon dioxide in Earth's atmosphere)Scientific consensus on climate changeSourcesDeforestationFossil fuelGreenhouse gasesGreenhouse gas emissionsCarbon accountingCarbon footprintCarbon leakagefrom agriculturefrom wetlandsWorld energy supply and consumption",
                "Overview",
                "Climate systemGreenhouse effect(Carbon dioxide in Earth's atmosphere)Scientific consensus on climate change",
                "Sources",
                "DeforestationFossil fuelGreenhouse gasesGreenhouse gas emissionsCarbon accountingCarbon footprintCarbon leakagefrom agriculturefrom wetlandsWorld energy supply and consumption"
            ],
            [
                "Overview",
                "Climate systemGreenhouse effect(Carbon dioxide in Earth's atmosphere)Scientific consensus on climate change"
            ],
            [
                "Sources",
                "DeforestationFossil fuelGreenhouse gasesGreenhouse gas emissionsCarbon accountingCarbon footprintCarbon leakagefrom agriculturefrom wetlandsWorld energy supply and consumption"
            ]
        ]
    },
    {
        "heading": "External links",
        "table": [
            [
                "Sources",
                "DeforestationFossil fuelGreenhouse gasesGreenhouse gas emissionsCarbon accountingCarbon footprintCarbon leakagefrom agriculturefrom wetlandsWorld energy supply and consumption"
            ]
        ]
    },
    {
        "heading": "External links",
        "table": [
            {
                "History": "History of climate change policy and politicsHistory of climate change scienceSvante ArrheniusJames HansenCharles David KeelingUnited Nations Climate Change conferencesYears in climate change201920202021202220232024"
            }
        ]
    },
    {
        "heading": "External links",
        "table": [
            [
                "PhysicalAbrupt climate changeAnoxic eventArctic methane emissionsArctic sea ice declineAtlantic meridional overturning circulationDroughtExtreme weatherFloodCoastal floodingHeat waveMarineUrban heat islandOceansacidificationdeoxygenationheat contentsea surface temperaturestratificationtemperatureOzone depletionPermafrost thawRetreat of glaciers since 1850Sea level riseSeason creepClimate sensitivityTipping points in the climate systemTropical cyclonesWater cycleWildfiresFlora and faunaBiomesMass mortality eventBirdsExtinction riskForest diebackInvasive speciesMarine lifePlant biodiversitySocial and economicAgricultureLivestockMulti-breadbasket failureUnited StatesChildrenCitiesCivilizational collapseCrimeDepopulation of settlementsDestruction of cultural heritageDisabilityEconomic impactsU.S. insurance industryFisheriesGenderHealthMental healthHuman rightsIndigenous peoplesInfectious diseasesMigrationPovertyPsychological impactsSecurity and conflictUrban floodingWater scarcityWater securityBy country and regionAfricaAmericasAntarcticaArcticAsiaAustraliaCaribbeanEuropeMiddle East and North AfricaSmall island countriesby individual country",
                "Physical",
                "Abrupt climate changeAnoxic eventArctic methane emissionsArctic sea ice declineAtlantic meridional overturning circulationDroughtExtreme weatherFloodCoastal floodingHeat waveMarineUrban heat islandOceansacidificationdeoxygenationheat contentsea surface temperaturestratificationtemperatureOzone depletionPermafrost thawRetreat of glaciers since 1850Sea level riseSeason creepClimate sensitivityTipping points in the climate systemTropical cyclonesWater cycleWildfires",
                "Flora and fauna",
                "BiomesMass mortality eventBirdsExtinction riskForest diebackInvasive speciesMarine lifePlant biodiversity",
                "Social and economic",
                "AgricultureLivestockMulti-breadbasket failureUnited StatesChildrenCitiesCivilizational collapseCrimeDepopulation of settlementsDestruction of cultural heritageDisabilityEconomic impactsU.S. insurance industryFisheriesGenderHealthMental healthHuman rightsIndigenous peoplesInfectious diseasesMigrationPovertyPsychological impactsSecurity and conflictUrban floodingWater scarcityWater security",
                "By country and region",
                "AfricaAmericasAntarcticaArcticAsiaAustraliaCaribbeanEuropeMiddle East and North AfricaSmall island countriesby individual country"
            ],
            [
                "Physical",
                "Abrupt climate changeAnoxic eventArctic methane emissionsArctic sea ice declineAtlantic meridional overturning circulationDroughtExtreme weatherFloodCoastal floodingHeat waveMarineUrban heat islandOceansacidificationdeoxygenationheat contentsea surface temperaturestratificationtemperatureOzone depletionPermafrost thawRetreat of glaciers since 1850Sea level riseSeason creepClimate sensitivityTipping points in the climate systemTropical cyclonesWater cycleWildfires"
            ],
            [
                "Flora and fauna",
                "BiomesMass mortality eventBirdsExtinction riskForest diebackInvasive speciesMarine lifePlant biodiversity"
            ],
            [
                "Social and economic",
                "AgricultureLivestockMulti-breadbasket failureUnited StatesChildrenCitiesCivilizational collapseCrimeDepopulation of settlementsDestruction of cultural heritageDisabilityEconomic impactsU.S. insurance industryFisheriesGenderHealthMental healthHuman rightsIndigenous peoplesInfectious diseasesMigrationPovertyPsychological impactsSecurity and conflictUrban floodingWater scarcityWater security"
            ],
            [
                "By country and region",
                "AfricaAmericasAntarcticaArcticAsiaAustraliaCaribbeanEuropeMiddle East and North AfricaSmall island countriesby individual country"
            ]
        ]
    },
    {
        "heading": "External links",
        "table": [
            [
                "Flora and fauna",
                "BiomesMass mortality eventBirdsExtinction riskForest diebackInvasive speciesMarine lifePlant biodiversity"
            ],
            [
                "Social and economic",
                "AgricultureLivestockMulti-breadbasket failureUnited StatesChildrenCitiesCivilizational collapseCrimeDepopulation of settlementsDestruction of cultural heritageDisabilityEconomic impactsU.S. insurance industryFisheriesGenderHealthMental healthHuman rightsIndigenous peoplesInfectious diseasesMigrationPovertyPsychological impactsSecurity and conflictUrban floodingWater scarcityWater security"
            ],
            [
                "By country and region",
                "AfricaAmericasAntarcticaArcticAsiaAustraliaCaribbeanEuropeMiddle East and North AfricaSmall island countriesby individual country"
            ]
        ]
    },
    {
        "heading": "External links",
        "table": [
            [
                "Economics and financeCarbon budgetCarbon emission tradingCarbon offsets and creditsGold Standard (carbon offset standard)Carbon priceCarbon taxClimate debtClimate financeClimate risk insuranceCo-benefits of climate change mitigationEconomics of climate change mitigationFossil fuel divestmentGreen Climate FundLow-carbon economyNet zero emissionsEnergyCarbon capture and storageEnergy transitionFossil fuel phase-outNuclear powerRenewable energySustainable energyPreserving and enhancingcarbon sinksBlue carbonCarbon dioxide removalCarbon sequestrationDirect air captureCarbon farmingClimate-smart agricultureForest managementafforestationforestry for carbon sequestrationREDD and REDD+reforestationLand use, land-use change, and forestry(LULUCF and AFOLU)Nature-based solutionsOtherIndividual action on climate changePlant-based dietSolar radiation modification",
                "Economics and finance",
                "Carbon budgetCarbon emission tradingCarbon offsets and creditsGold Standard (carbon offset standard)Carbon priceCarbon taxClimate debtClimate financeClimate risk insuranceCo-benefits of climate change mitigationEconomics of climate change mitigationFossil fuel divestmentGreen Climate FundLow-carbon economyNet zero emissions",
                "Energy",
                "Carbon capture and storageEnergy transitionFossil fuel phase-outNuclear powerRenewable energySustainable energy",
                "Preserving and enhancingcarbon sinks",
                "Blue carbonCarbon dioxide removalCarbon sequestrationDirect air captureCarbon farmingClimate-smart agricultureForest managementafforestationforestry for carbon sequestrationREDD and REDD+reforestationLand use, land-use change, and forestry(LULUCF and AFOLU)Nature-based solutions",
                "Other",
                "Individual action on climate changePlant-based dietSolar radiation modification"
            ],
            [
                "Economics and finance",
                "Carbon budgetCarbon emission tradingCarbon offsets and creditsGold Standard (carbon offset standard)Carbon priceCarbon taxClimate debtClimate financeClimate risk insuranceCo-benefits of climate change mitigationEconomics of climate change mitigationFossil fuel divestmentGreen Climate FundLow-carbon economyNet zero emissions"
            ],
            [
                "Energy",
                "Carbon capture and storageEnergy transitionFossil fuel phase-outNuclear powerRenewable energySustainable energy"
            ],
            [
                "Preserving and enhancingcarbon sinks",
                "Blue carbonCarbon dioxide removalCarbon sequestrationDirect air captureCarbon farmingClimate-smart agricultureForest managementafforestationforestry for carbon sequestrationREDD and REDD+reforestationLand use, land-use change, and forestry(LULUCF and AFOLU)Nature-based solutions"
            ],
            [
                "Other",
                "Individual action on climate changePlant-based dietSolar radiation modification"
            ]
        ]
    },
    {
        "heading": "External links",
        "table": [
            [
                "Energy",
                "Carbon capture and storageEnergy transitionFossil fuel phase-outNuclear powerRenewable energySustainable energy"
            ],
            [
                "Preserving and enhancingcarbon sinks",
                "Blue carbonCarbon dioxide removalCarbon sequestrationDirect air captureCarbon farmingClimate-smart agricultureForest managementafforestationforestry for carbon sequestrationREDD and REDD+reforestationLand use, land-use change, and forestry(LULUCF and AFOLU)Nature-based solutions"
            ],
            [
                "Other",
                "Individual action on climate changePlant-based dietSolar radiation modification"
            ]
        ]
    },
    {
        "heading": "External links",
        "table": [
            [
                "SocietyBusiness actionClimate actionClimate emergency declarationClimate movementSchool Strike for ClimateDenialEcological griefGovernanceJusticeLitigationPoliticsPublic opinionWomenAdaptationAdaptation strategies on the German coastAdaptive capacityDisaster risk reductionEcosystem-based adaptationFlood controlLoss and damageManaged retreatNature-based solutionsResilienceRiskVulnerabilityThe Adaptation FundNational Adaptation Programme of ActionCommunicationClimate Change Performance IndexClimate crisis (term)Climate spiralEducationMedia coveragePopular culture depictionsartfictionvideo gamesWarming stripesInternational agreementsGlasgow Climate PactKyoto ProtocolParis AgreementCooperative Mechanisms under Article 6 of the Paris AgreementNationally determined contributionsSustainable Development Goal 13United Nations Framework Convention on Climate Change",
                "Society",
                "Business actionClimate actionClimate emergency declarationClimate movementSchool Strike for ClimateDenialEcological griefGovernanceJusticeLitigationPoliticsPublic opinionWomen",
                "Adaptation",
                "Adaptation strategies on the German coastAdaptive capacityDisaster risk reductionEcosystem-based adaptationFlood controlLoss and damageManaged retreatNature-based solutionsResilienceRiskVulnerabilityThe Adaptation FundNational Adaptation Programme of Action",
                "Communication",
                "Climate Change Performance IndexClimate crisis (term)Climate spiralEducationMedia coveragePopular culture depictionsartfictionvideo gamesWarming stripes",
                "International agreements",
                "Glasgow Climate PactKyoto ProtocolParis AgreementCooperative Mechanisms under Article 6 of the Paris AgreementNationally determined contributionsSustainable Development Goal 13United Nations Framework Convention on Climate Change"
            ],
            [
                "Society",
                "Business actionClimate actionClimate emergency declarationClimate movementSchool Strike for ClimateDenialEcological griefGovernanceJusticeLitigationPoliticsPublic opinionWomen"
            ],
            [
                "Adaptation",
                "Adaptation strategies on the German coastAdaptive capacityDisaster risk reductionEcosystem-based adaptationFlood controlLoss and damageManaged retreatNature-based solutionsResilienceRiskVulnerabilityThe Adaptation FundNational Adaptation Programme of Action"
            ],
            [
                "Communication",
                "Climate Change Performance IndexClimate crisis (term)Climate spiralEducationMedia coveragePopular culture depictionsartfictionvideo gamesWarming stripes"
            ],
            [
                "International agreements",
                "Glasgow Climate PactKyoto ProtocolParis AgreementCooperative Mechanisms under Article 6 of the Paris AgreementNationally determined contributionsSustainable Development Goal 13United Nations Framework Convention on Climate Change"
            ]
        ]
    },
    {
        "heading": "External links",
        "table": [
            [
                "Adaptation",
                "Adaptation strategies on the German coastAdaptive capacityDisaster risk reductionEcosystem-based adaptationFlood controlLoss and damageManaged retreatNature-based solutionsResilienceRiskVulnerabilityThe Adaptation FundNational Adaptation Programme of Action"
            ],
            [
                "Communication",
                "Climate Change Performance IndexClimate crisis (term)Climate spiralEducationMedia coveragePopular culture depictionsartfictionvideo gamesWarming stripes"
            ],
            [
                "International agreements",
                "Glasgow Climate PactKyoto ProtocolParis AgreementCooperative Mechanisms under Article 6 of the Paris AgreementNationally determined contributionsSustainable Development Goal 13United Nations Framework Convention on Climate Change"
            ]
        ]
    },
    {
        "heading": "External links",
        "table": [
            [
                "MeasurementsGlobal surface temperatureInstrumental temperature recordProxySatellite temperature measurementTheoryAlbedoCarbon cycleatmosphericbiologicoceanicpermafrostCarbon sinkClimate sensitivityClimate variability and changeCloud feedbackCloud forcingFixed anvil temperature hypothesisCryosphereEarth's energy budgetExtreme event attributionFeedbacksGlobal warming potentialIllustrative model of greenhouse effect on climate changeOrbital forcingRadiative forcingResearch and modellingClimate change scenarioClimate modelCoupled Model Intercomparison ProjectIntergovernmental Panel on Climate Change (IPCC)IPCC Sixth Assessment ReportPaleoclimatologyRepresentative Concentration PathwayShared Socioeconomic Pathways",
                "Measurements",
                "Global surface temperatureInstrumental temperature recordProxySatellite temperature measurement",
                "Theory",
                "AlbedoCarbon cycleatmosphericbiologicoceanicpermafrostCarbon sinkClimate sensitivityClimate variability and changeCloud feedbackCloud forcingFixed anvil temperature hypothesisCryosphereEarth's energy budgetExtreme event attributionFeedbacksGlobal warming potentialIllustrative model of greenhouse effect on climate changeOrbital forcingRadiative forcing",
                "Research and modelling",
                "Climate change scenarioClimate modelCoupled Model Intercomparison ProjectIntergovernmental Panel on Climate Change (IPCC)IPCC Sixth Assessment ReportPaleoclimatologyRepresentative Concentration PathwayShared Socioeconomic Pathways"
            ],
            [
                "Measurements",
                "Global surface temperatureInstrumental temperature recordProxySatellite temperature measurement"
            ],
            [
                "Theory",
                "AlbedoCarbon cycleatmosphericbiologicoceanicpermafrostCarbon sinkClimate sensitivityClimate variability and changeCloud feedbackCloud forcingFixed anvil temperature hypothesisCryosphereEarth's energy budgetExtreme event attributionFeedbacksGlobal warming potentialIllustrative model of greenhouse effect on climate changeOrbital forcingRadiative forcing"
            ],
            [
                "Research and modelling",
                "Climate change scenarioClimate modelCoupled Model Intercomparison ProjectIntergovernmental Panel on Climate Change (IPCC)IPCC Sixth Assessment ReportPaleoclimatologyRepresentative Concentration PathwayShared Socioeconomic Pathways"
            ]
        ]
    },
    {
        "heading": "External links",
        "table": [
            [
                "Theory",
                "AlbedoCarbon cycleatmosphericbiologicoceanicpermafrostCarbon sinkClimate sensitivityClimate variability and changeCloud feedbackCloud forcingFixed anvil temperature hypothesisCryosphereEarth's energy budgetExtreme event attributionFeedbacksGlobal warming potentialIllustrative model of greenhouse effect on climate changeOrbital forcingRadiative forcing"
            ],
            [
                "Research and modelling",
                "Climate change scenarioClimate modelCoupled Model Intercomparison ProjectIntergovernmental Panel on Climate Change (IPCC)IPCC Sixth Assessment ReportPaleoclimatologyRepresentative Concentration PathwayShared Socioeconomic Pathways"
            ]
        ]
    },
    {
        "heading": "External links",
        "table": [
            {
                "vtePollution": "History"
            },
            [
                "Air",
                "Acid rainAir quality indexAir pollution measurementAtmospheric dispersion modelingChlorofluorocarbonCombustionBiofuelBiomassJoss paperOpen burning of wasteConstructionRenovationDemolitionExhaust gasDiesel exhaustHazeSmokeIndoor air qualityInternal combustion engineGlobal dimmingGlobal distillationMiningOzone depletionParticulatesAsbestosMetal workingOil refiningWood dustWeldingPersistent organic pollutantSmeltingSmogSootBlack carbonVolatile organic compoundWaste"
            ],
            [
                "Biological",
                "Biological hazardGenetic pollutionIntroduced speciesInvasive species"
            ],
            [
                "Digital",
                "Information pollution"
            ],
            [
                "Electromagnetic",
                "LightEcological light pollutionOverilluminationRadio spectrum pollution"
            ],
            [
                "Natural",
                "OzoneRadium and radon in the environmentVolcanic ashWildfire"
            ],
            [
                "Noise",
                "TransportationLandWaterAirRailSustainable transportUrbanSonarMarine mammals and sonarIndustrialMilitaryAbstractNoise control"
            ],
            [
                "Radiation",
                "ActinidesBioremediationNuclear fissionNuclear falloutPlutoniumPoisoningRadioactivityUraniumElectromagnetic radiation and healthRadioactive waste"
            ],
            [
                "Soil",
                "Agricultural pollutionHerbicidesManure wastePesticidesLand degradationBioremediationOpen defecationElectrical resistance heatingSoil guideline valuesPhytoremediation"
            ],
            [
                "Solid waste",
                "Advertising mailBiodegradable wasteBrown wasteElectronic wasteBattery recyclingFoam food containerFood wasteGreen wasteHazardous wasteBiomedical wasteChemical wasteConstruction wasteLead poisoningMercury poisoningToxic wasteIndustrial wasteLead smeltingLitterMiningCoal miningGold miningSurface miningDeep sea miningMining wasteUranium miningMunicipal solid wasteGarbageNanomaterialsPlastic pollutionMicroplasticsPackaging wastePost-consumer wasteWaste managementLandfillThermal treatment"
            ],
            [
                "Space",
                "Satellite"
            ],
            [
                "Visual",
                "Air travelClutter (advertising)Traffic signsOverhead power linesVandalism"
            ],
            [
                "War",
                "Chemical warfareHerbicidal warfare(Agent Orange)Nuclear holocaust(Nuclear fallout-nuclear famine-nuclear winter)Scorched earthUnexploded ordnanceWar and environmental law"
            ],
            [
                "Water",
                "Agricultural wastewaterBiological pollutionDiseasesEutrophicationFirewaterFreshwaterGroundwaterHypoxiaIndustrial wastewaterMarinedebrisMonitoringNonpoint source pollutionNutrient pollutionOcean acidificationOil exploitationOil explorationOil spillPharmaceuticalsSewageSeptic tanksPit latrineShippingStagnationSulfur waterSurface runoffThermalTurbidityUrban runoffWater quality"
            ],
            [
                "Topics",
                "PollutantsHeavy metalsPaintBrain health and pollution"
            ],
            [
                "Misc",
                "Area sourceDebrisDustGarbologyLegacy pollutionMiddenPoint sourceWaste"
            ],
            [
                "Responses",
                "Cleaner productionIndustrial ecologyPollution haven hypothesisPollutant release and transfer registerPolluter pays principlePollution controlWaste minimisationZero waste"
            ],
            [
                "Lists",
                "DiseasesLaw by countryMost polluted citiesLeast polluted cities by PM2.5Most polluted countriesMost polluted riversTreaties"
            ],
            {
                "vtePollution": "Categories(by country)CommonsWikiProject EnvironmentWikiProject EcologyEnvironment portalEcology portal"
            }
        ]
    },
    {
        "heading": "External links",
        "table": [
            [
                "Air",
                "Pollution / qualityAmbient standards(US)IndexIndoorLawClean Air Act(US)Ozone depletionEmissionsAirshedTradingDeforestation (REDD)",
                "Pollution / quality",
                "Ambient standards(US)IndexIndoorLawClean Air Act(US)Ozone depletion",
                "Emissions",
                "AirshedTradingDeforestation (REDD)"
            ],
            [
                "Pollution / quality",
                "Ambient standards(US)IndexIndoorLawClean Air Act(US)Ozone depletion"
            ],
            [
                "Emissions",
                "AirshedTradingDeforestation (REDD)"
            ],
            [
                "Energy",
                "BioLawResourcesFossil fuels(gas,peak coal,peak gas,peak oil)GeothermalHydroNuclearSolarsunlightshadeWind"
            ],
            [
                "Land",
                "Agriculturalarablepeak farmlandDegradationFieldLandscapecityscapeseascapesoundscapeviewshedLawpropertyManagementhabitat conservationMineralsgemstoneindustrialoremetalmininglawsandpeakcopperphosphorusrightsSoilconservationfertilityhealthresilienceUseplanningreserve"
            ],
            [
                "Life",
                "BiodiversityBioprospectingbiopiracyBiosphereBushfoodBushmeatFisheriesclimate changelawmanagementForestsgenetic resourceslawmanagementnon-timber productsGamelawMarine conservationMeadowPasturePlantsFAO Plant Treatyfoodgenetic resourcesgene banksherbal medicinesUPOV ConventionwoodRangelandSeed bankWildlifeconservationmanagement"
            ],
            [
                "Water",
                "Types / locationAquiferstorage and recoveryDrinkingFreshGroundwaterpollutionrechargeremediationHydrosphereIcebergsglacialpolarIrrigationhuertaMarineRainharvestingStormwaterSurface waterSewagereclaimed waterWatershedAspectsDesalinationFloodsLawLeachingSanitationimprovedScarcitySecuritySupplyEfficiencyConflictConservationPeak waterPollutionPrivatizationQualityRightResourcesimprovedpolicy",
                "Types / location",
                "Aquiferstorage and recoveryDrinkingFreshGroundwaterpollutionrechargeremediationHydrosphereIcebergsglacialpolarIrrigationhuertaMarineRainharvestingStormwaterSurface waterSewagereclaimed waterWatershed",
                "Aspects",
                "DesalinationFloodsLawLeachingSanitationimprovedScarcitySecuritySupplyEfficiencyConflictConservationPeak waterPollutionPrivatizationQualityRightResourcesimprovedpolicy"
            ],
            [
                "Types / location",
                "Aquiferstorage and recoveryDrinkingFreshGroundwaterpollutionrechargeremediationHydrosphereIcebergsglacialpolarIrrigationhuertaMarineRainharvestingStormwaterSurface waterSewagereclaimed waterWatershed"
            ],
            [
                "Aspects",
                "DesalinationFloodsLawLeachingSanitationimprovedScarcitySecuritySupplyEfficiencyConflictConservationPeak waterPollutionPrivatizationQualityRightResourcesimprovedpolicy"
            ],
            [
                "Related",
                "Commonsenclosuregloballandtragedy ofEconomicsecologicallandEcosystem servicesExploitationoverexploitationEarth Overshoot DayManagementadaptiveNatural capitalaccountinggoodNatural heritageNature reserveremnant natural areaSystems ecologyUrban ecologyWildernessResourceCommon-poolConflict(perpetuation)CurseDepletionExtractionNationalismRenewable/Non-renewablePoliticsOil warPetrostatePetro-IslamResource war",
                "Commonsenclosuregloballandtragedy ofEconomicsecologicallandEcosystem servicesExploitationoverexploitationEarth Overshoot DayManagementadaptiveNatural capitalaccountinggoodNatural heritageNature reserveremnant natural areaSystems ecologyUrban ecologyWilderness",
                "Resource",
                "Common-poolConflict(perpetuation)CurseDepletionExtractionNationalismRenewable/Non-renewable",
                "Politics",
                "Oil warPetrostatePetro-IslamResource war"
            ],
            {
                "vteNatural resources": "Commonsenclosuregloballandtragedy ofEconomicsecologicallandEcosystem servicesExploitationoverexploitationEarth Overshoot DayManagementadaptiveNatural capitalaccountinggoodNatural heritageNature reserveremnant natural areaSystems ecologyUrban ecologyWilderness"
            },
            [
                "Resource",
                "Common-poolConflict(perpetuation)CurseDepletionExtractionNationalismRenewable/Non-renewable"
            ],
            [
                "Politics",
                "Oil warPetrostatePetro-IslamResource war"
            ],
            {
                "vteNatural resources": "Category"
            }
        ]
    },
    {
        "heading": "External links",
        "table": [
            [
                "Emissions",
                "AirshedTradingDeforestation (REDD)"
            ]
        ]
    },
    {
        "heading": "External links",
        "table": [
            [
                "Aspects",
                "DesalinationFloodsLawLeachingSanitationimprovedScarcitySecuritySupplyEfficiencyConflictConservationPeak waterPollutionPrivatizationQualityRightResourcesimprovedpolicy"
            ]
        ]
    },
    {
        "heading": "External links",
        "table": [
            [
                "Resource",
                "Common-poolConflict(perpetuation)CurseDepletionExtractionNationalismRenewable/Non-renewable"
            ],
            [
                "Politics",
                "Oil warPetrostatePetro-IslamResource war"
            ]
        ]
    },
    {
        "heading": "External links",
        "table": [
            {
                "vteGlobal catastrophic risks": "Future of the EarthFuture of an expanding universeUltimate fate of the universeHuman extinction risk estimates"
            },
            [
                "Technological",
                "Chemical warfareCyberattackCyberwarfareCyberterrorismCybergeddonRansomwareGray gooNanoweaponsKinetic bombardmentKinetic energy weaponNuclear warfareMutual assured destructionDead HandDoomsday ClockDoomsday deviceAntimatter weaponElectromagnetic pulse(EMP)Safety of high-energy particle collision experimentsMicro black holeStrangeletSynthetic intelligence/Artificial intelligenceAI takeoverExistential risk from artificial intelligenceTechnological singularityTranshumanism"
            ],
            [
                "Sociological",
                "Anthropogenic hazardCollapsologyDoomsday argumentSelf-indication assumption doomsday argument rebuttalSelf-referencing doomsday argument rebuttalEconomic collapseMalthusian catastropheNew World Order (conspiracy theory)Nuclear holocaustcobaltfaminewinterRiotsSocial crisisSocietal collapseState collapseWorld War III"
            ],
            [
                "Ecological",
                "Climate changeAnoxic eventBiodiversity lossMass mortality eventCascade effectCataclysmic pole shift hypothesisDeforestationDesertificationPlant or animal species extinctionsCivilizational collapseTipping pointsClimate sensitivityFlood basaltGlobal dimmingGlobal terrestrial stillingGlobal warmingHypercaneIce ageEcocideEcological collapseEnvironmental degradationHabitat destructionHuman impact on the environmentcoral reefson marine lifeLand degradationLand consumptionLand surface effects on climateOcean acidificationOzone depletionResource depletionSea level riseSupervolcanowinterVerneshotWater pollutionWater scarcityEarth Overshoot DayOverexploitationOverpopulationHuman overpopulation",
                "Climate change",
                "Anoxic eventBiodiversity lossMass mortality eventCascade effectCataclysmic pole shift hypothesisDeforestationDesertificationPlant or animal species extinctionsCivilizational collapseTipping pointsClimate sensitivityFlood basaltGlobal dimmingGlobal terrestrial stillingGlobal warmingHypercaneIce ageEcocideEcological collapseEnvironmental degradationHabitat destructionHuman impact on the environmentcoral reefson marine lifeLand degradationLand consumptionLand surface effects on climateOcean acidificationOzone depletionResource depletionSea level riseSupervolcanowinterVerneshotWater pollutionWater scarcity",
                "Earth Overshoot Day",
                "OverexploitationOverpopulationHuman overpopulation"
            ],
            [
                "Climate change",
                "Anoxic eventBiodiversity lossMass mortality eventCascade effectCataclysmic pole shift hypothesisDeforestationDesertificationPlant or animal species extinctionsCivilizational collapseTipping pointsClimate sensitivityFlood basaltGlobal dimmingGlobal terrestrial stillingGlobal warmingHypercaneIce ageEcocideEcological collapseEnvironmental degradationHabitat destructionHuman impact on the environmentcoral reefson marine lifeLand degradationLand consumptionLand surface effects on climateOcean acidificationOzone depletionResource depletionSea level riseSupervolcanowinterVerneshotWater pollutionWater scarcity"
            ],
            [
                "Earth Overshoot Day",
                "OverexploitationOverpopulationHuman overpopulation"
            ],
            [
                "Biological",
                "ExtinctionExtinction eventHolocene extinctionHuman extinctionList of extinction eventsGenetic erosionGenetic pollutionOthersBiodiversity lossDecline in amphibian populationsDecline in insect populationsBiotechnology riskBiological agentBiological warfareBioterrorismColony collapse disorderDefaunationDysgenicsInterplanetary contaminationPandemicPollinator declineOverfishing",
                "Extinction",
                "Extinction eventHolocene extinctionHuman extinctionList of extinction eventsGenetic erosionGenetic pollution",
                "Others",
                "Biodiversity lossDecline in amphibian populationsDecline in insect populationsBiotechnology riskBiological agentBiological warfareBioterrorismColony collapse disorderDefaunationDysgenicsInterplanetary contaminationPandemicPollinator declineOverfishing"
            ],
            [
                "Extinction",
                "Extinction eventHolocene extinctionHuman extinctionList of extinction eventsGenetic erosionGenetic pollution"
            ],
            [
                "Others",
                "Biodiversity lossDecline in amphibian populationsDecline in insect populationsBiotechnology riskBiological agentBiological warfareBioterrorismColony collapse disorderDefaunationDysgenicsInterplanetary contaminationPandemicPollinator declineOverfishing"
            ],
            [
                "Astronomical",
                "Big CrunchBig RipCoronal mass ejectionCosmological phase transitionGeomagnetic stormFalse vacuum decayGamma-ray burstHeat death of the universeProton decayVirtual black holeImpact eventAsteroid impact avoidanceAsteroid impact predictionPotentially hazardous objectNear-Earth objectwinterRogue planetRogue starNear-Earth supernovaHypernovaMicronovaSolar flareStellar collision"
            ],
            [
                "Eschatological",
                "BuddhistMaitreyaThree AgesHinduKalkiKali YugaLast JudgementSecond Coming1 EnochDanielAbomination of desolationProphecy of Seventy WeeksMessiahChristianFuturismHistoricismInterpretations of RevelationIdealismPreterism2 Esdras2 ThessaloniansMan of sinKatechonAntichristBook of RevelationEventsFour Horsemen of the ApocalypseLake of fireNumber of the BeastSeven bowlsSeven sealsThe BeastTwo witnessesWar in HeavenWhore of BabylonGreat ApostasyNew EarthNew JerusalemOlivet DiscourseGreat TribulationSon of perditionSheep and GoatsIslamicAl-Qa'imBeast of the EarthDhu al-QarnaynDhul-SuwayqataynDajjalIsrafilMahdiSufyaniJewishMessiahWar of Gog and MagogThird TempleNorseZoroastrianSaoshyant"
            ],
            [
                "Others",
                "2011 end times prediction2012 phenomenonApocalypseApocalyptic literatureApocalypticismArmageddonBlood moon prophecyEarth ChangesEnd timeGog and MagogList of dates predicted for apocalyptic eventsMessianismMessianic AgeMillenarianismMillennialismPremillennialismAmillennialismPostmillennialismNemesis (hypothetical star)Nibiru cataclysmRapturePrewrathPosttribulation raptureResurrection of the deadVulnerable world hypothesisWorld to come"
            ],
            [
                "Fictional",
                "Alien invasionApocalyptic and post-apocalyptic fictionList of apocalyptic and post-apocalyptic fictionList of apocalyptic filmsClimate fictionDisaster filmsList of disaster filmsZombie apocalypseZombie"
            ],
            [
                "Organizations",
                "Centre for the Study of Existential RiskFuture of Humanity InstituteFuture of Life InstituteNuclear Threat Initiative"
            ],
            [
                "General",
                "DisasterDepressionFinancial crisisSurvivalism"
            ],
            {
                "vteGlobal catastrophic risks": "World portalCategoriesApocalypticismFuture problemsHazardsRisk analysisDoomsday scenarios"
            }
        ]
    },
    {
        "heading": "External links",
        "table": [
            [
                "Earth Overshoot Day",
                "OverexploitationOverpopulationHuman overpopulation"
            ]
        ]
    },
    {
        "heading": "External links",
        "table": [
            [
                "Others",
                "Biodiversity lossDecline in amphibian populationsDecline in insect populationsBiotechnology riskBiological agentBiological warfareBioterrorismColony collapse disorderDefaunationDysgenicsInterplanetary contaminationPandemicPollinator declineOverfishing"
            ]
        ]
    },
    {
        "heading": "External links",
        "table": [
            [
                "International",
                "FAST"
            ],
            [
                "National",
                "GermanyUnited StatesFranceBnF dataSpainIsrael"
            ],
            [
                "Other",
                "IdRef2NARA"
            ]
        ]
    }
]