[
    {
        "url": "https://en.wikipedia.org/wiki/Syrian_refugee_camps"
    },
    {
        "heading": "Syrian refugee camps",
        "table": [
            [
                "",
                "Graphs are unavailable due to technical issues. Updates on reimplementing the Graph extension, which will be known as the Chart extension, can be found onPhabricatorand onMediaWiki.org."
            ],
            {
                "Graphs are unavailable due to technical issues. Updates on reimplementing the Graph extension, which will be known as the Chart extension, can be found onPhabricatorand onMediaWiki.org.": "Pre-war population22±.5;Internally displaced 6±.5,Refugees 5.5±.5,Fatalities 0.5±.1(millions)[citation needed]"
            },
            {
                "Graphs are unavailable due to technical issues. Updates on reimplementing the Graph extension, which will be known as the Chart extension, can be found onPhabricatorand onMediaWiki.org.": "Syrian refugees"
            },
            [
                "By country",
                "Turkey,Lebanon,Egypt,Jordan"
            ],
            [
                "Settlements",
                "Camps:Jordan"
            ],
            {
                "Graphs are unavailable due to technical issues. Updates on reimplementing the Graph extension, which will be known as the Chart extension, can be found onPhabricatorand onMediaWiki.org.": ""
            },
            {
                "Graphs are unavailable due to technical issues. Updates on reimplementing the Graph extension, which will be known as the Chart extension, can be found onPhabricatorand onMediaWiki.org.": "Internally displaced Syrians"
            },
            {
                "Graphs are unavailable due to technical issues. Updates on reimplementing the Graph extension, which will be known as the Chart extension, can be found onPhabricatorand onMediaWiki.org.": "Casualties of the war"
            },
            [
                "Crimes",
                "War crimes,massacres,rape"
            ],
            {
                "Graphs are unavailable due to technical issues. Updates on reimplementing the Graph extension, which will be known as the Chart extension, can be found onPhabricatorand onMediaWiki.org.": ""
            },
            {
                "Graphs are unavailable due to technical issues. Updates on reimplementing the Graph extension, which will be known as the Chart extension, can be found onPhabricatorand onMediaWiki.org.": "Return of refugees,Refugees as weapons,Prosecution of war criminals"
            },
            {
                "Graphs are unavailable due to technical issues. Updates on reimplementing the Graph extension, which will be known as the Chart extension, can be found onPhabricatorand onMediaWiki.org.": "vte"
            }
        ]
    },
    {
        "heading": "Syrian refugee camps",
        "paragraphs": [
            "Syrian refugee camp and sheltersare temporary settlements built to receiveinternally displaced peopleandrefugees of the Syrian Civil War. Of the estimated 7 million persons displaced withinSyria, only a small minority live in camps or collective shelters. Similarly, of the 8 million refugees, only about 10 percent live inrefugee camps, with the vast majority living in both urban and rural areas of neighboring countries.  Beside Syrians, they includeIraqis,Palestinians,Kurds,Yazidis, individuals fromSomalia, and a minority of those who fled theYemeniandSudanesecivil wars.  ",
            "There were 2 million school-agedrefugee children(aged 5–17 years) among the 5 million refugees registered inTurkey,Lebanon,Jordan,IraqandEgyptby the end of 2016. 1.1 million of those children have had access to either formal education (900,000) or non-formal education (150,000), including over 6,600 Palestinerefugee childrenfrom Syria. Humanitarian aid during the Syrian Civil Warfocuses on basic needs, health care, education and providing jobs. Most of the burden remains on the host countries, which face a stressed economy and export disruption, with the additional population, mostly outside of camps, causing significant pressure on public and private (e.g. housing) infrastructure. "
        ]
    },
    {
        "heading": "Shelters in Syria",
        "paragraphs": [
            "Within Syria itself, shelter aid forinternally displaced personsis coordinated mainly by theGlobal Shelter Cluster(co-led byUNHCR,IFRCand the Syrian Ministry of\nLocal Administration). However, there is poor accessibility to the areas of need, so efforts were directed at emergency aid. The Shelter Cluster also cites the complexity of administrative procedures and limited capacity of NGOs permitted to operate in Syria as challenges to assistance.",
            "In 2016, public buildings were rehabilitated as collective short and mid-term shelters for 24,000 persons. For example, of the 90,000 people from eastAlepporegistered by the UN, the vast majority live in houses. The remaining 4,250 individuals live in theJibrincollective shelter, as of January 2017. Shelter and winterization kits (light construction materials and tools and clothes, blankets, etc.) were distributed to 26,000 people, while 40,000 benefited from private building upgrades. Only recently the situation allowed for implementing more durable solutions that included full, long-term rehabilitation of damaged houses. It also improved basic living conditions, such as light infrastructure repair and legal help."
        ]
    },
    {
        "heading": "Palestinian refugee camps",
        "paragraphs": [
            "UNRWAestimates that 450,000 Palestinian refugees remain in Syria, of whom up to 280,000 are internally displaced, and an estimated 43,000 are trapped in hard-to-reach locations.\nSome have been displaced multiple times as a result of armed violence. Additionally, 120,000 are displaced to neighboring countries.\nUntil 2011, UNRWA provided services in 12 camps administered by Syrian authorities, includingHomsandYarmouk. Many sustained extensive damage and were forcibly displaced due to armed conflict. As of January 2017, UNRWA manages 9 shelters with about 2,600 Palestine refugees and provides cash, food and non-food items to many more.  Battles betweenTahrir al-ShamandISILfor control of theYarmouk Campcontinue for more than two years, as of April 2017. "
        ]
    },
    {
        "heading": "Host countries in the Regional Refugee and Resilience Plan",
        "paragraphs": [
            "TheRegional Refugee and Resilience Plan (3RP)gives a strategic overview, plans and reports, developed byUNHCR,UNDPandNGOstogether with governments ofEgyptand countries neighboring Syria which includes Turkey, Jordan, Lebanon, and Iraq. The Israeli government has refused to offer any resettlement places to refugees. "
        ]
    },
    {
        "heading": "Turkey",
        "table": [
            {
                "Province": "Hatay",
                "Camp name": "Altınözü(1 and 2) container camp",
                "Population": "8,062",
                "Total[14][15]": "19,790"
            },
            [
                "Yayladağı(1 and 2) container camp",
                "3,746"
            ],
            [
                "Apaydın container camp",
                "5,229"
            ],
            [
                "Güveççi tent camp",
                "2,753"
            ],
            {
                "Province": "Şanlıurfa",
                "Camp name": "Ceylanpınartent camp",
                "Population": "21,176",
                "Total[14][15]": "113,172"
            },
            [
                "Akçakaletent camp",
                "31,598"
            ],
            [
                "Harran container camp",
                "13,761"
            ],
            [
                "Viranşehirtent camp",
                "15,157"
            ],
            [
                "Suruçtent camp",
                "31,480"
            ],
            {
                "Province": "Gaziantep",
                "Camp name": "Islahiye 1 tent camp",
                "Population": "7,372",
                "Total[14][15]": "38,543"
            },
            [
                "Islahiye 2 tent camp",
                "10,061"
            ],
            [
                "Karkamış tent camp",
                "6,605"
            ],
            [
                "Nizip 1 tent camp",
                "10,033"
            ],
            [
                "Nizip 2 container camp",
                "4,472"
            ],
            {
                "Province": "Kilis",
                "Camp name": "Öncüpınar container city",
                "Population": "15,735",
                "Total[14][15]": "36,076"
            },
            [
                "Elbeyli Besiriye container camp",
                "20,341"
            ],
            {
                "Province": "Kahramanmaraş",
                "Camp name": "Merkez container camp",
                "Population": "18,214",
                "Total[14][15]": "18,214"
            },
            {
                "Province": "Osmaniye",
                "Camp name": "Cevdetiye tent camp",
                "Population": "7,304",
                "Total[14][15]": "7,304"
            },
            {
                "Province": "Adıyaman",
                "Camp name": "Merkez tent camp",
                "Population": "9,625",
                "Total[14][15]": "9,625"
            },
            {
                "Province": "Adana",
                "Camp name": "Sarıçam tent camp",
                "Population": "555",
                "Total[14][15]": "555"
            },
            {
                "Province": "Mardin",
                "Camp name": "Midyat tent camp",
                "Population": "3,373",
                "Total[14][15]": "3,373"
            },
            {
                "Province": "Malatya",
                "Camp name": "Beydağı container camp",
                "Population": "10,227",
                "Total[14][15]": "10,227"
            }
        ]
    },
    {
        "heading": "Turkey",
        "paragraphs": [
            "InTurkey, the population of Syrian refugees is estimated to be around 3.0 million, with many more who are unregistered, of whom 260,000 live in the 22 camps, as of May 2017. The camps, also known as Temporary Accommodation Centers or Temporary Protection Centers (TPCs), are run by the government-ledDisaster and Emergency Management Presidency (AFAD)with the support of theUnited NationsandNGOpartners.",
            "A camp with a 20,000-person capacity in theDerikdistrict ofMardinwas inaugurated in February 2015; however in 2016, it was emptied due to security concerns. 6,500 refugees were then transferred to other camps.  A tent camp was also present inNusaybin,Mardin, but it was forcibly evacuated and turned into a military headquarters by the Turkish military, according to Kurdish reports; the town has since seen clashes with thePKK.\nA Turkish NGO reported several Yezidi camps and settlements in southeastern Turkey, including more than 6,000 persons, with UNHCR or other UN agencies not present in the area. They are coordinated by understaffed local Kurdish political structures with scarce resources. "
        ]
    },
    {
        "heading": "Jordan",
        "table": [
            {
                "Camp name": "Zaatari refugee camp",
                "Population": "80,000[23]"
            },
            {
                "Camp name": "Azraq refugee camp",
                "Population": "36,000[22]"
            },
            {
                "Camp name": "Mrajeeb Al Fhood refugee camp(Emirati Jordanian Camp, EJC)",
                "Population": "?4,000[22][34]"
            }
        ]
    },
    {
        "heading": "Jordan",
        "paragraphs": [
            "TheJordanian Response Plan 2017-2019outlines the official approach to the refugee crisis.\nThere were 660,000 refugees in Jordan registered withUNHCRas of May 2017, constituting about 9% of its population.  This number included 140,000 people in the three camps managed byUNHCRand the Jordanian government. In an interview withBBCin January 2017, Jordanian Chief of Staff Lieutenant,Mahmoud Freihat, claimed that there are 1 million more unregistered refugees in Jordan. A November 2016 national census showed that there were 1.3 million Syrians residing in the country. ",
            "TheZaatari campopened in July 2012 and by 2013 was hosted above 100,000 refugees. TheMrajeeb Al Fhood(April 2013) andAzraq(April 2014) camps were then built to bring Zaatari back to its capacity of 80,000. Zaatari and Azraq are now the two largest Syrian refugee camps. UNHCR reported in January 2017 that only 35,000 of the 54,000 people registered in the Azraq camp were actually present there. ",
            "At the eastern part of the border with Syria, an area known as \"the berm\", informal encampments have been reported inRukbanandHadallat.Human Rights WatchandAmnesty Internationalcriticized Jordanian authorities for suspending aid to them and not allowing refugees in.   In 2016, according toFSA rebels, Russian warplanes  bombed the Hadallat camp, killing at least 12 people. At dawn on 21 June 2016, anISILcar crossed over from Rukban on Syrian territory and managed to reach a Jordanian army outpost designated for the distribution of humanitarian aid to refugees. The car exploded, killing 6 and injuring 14 Jordanian soldiers. The incident led Jordan to seal off its borders with Syria, as several other incidents followed that targeted refugees on the Syrian side of Rukban. According to government officials in January 2017,ISILcontrolled the encampment, so access was blocked because of security concerns over hidden ISILsleeper cells. ",
            "Severewater scarcity in Jordanhas been aggravated by the increased population. The refugees in Zaatari and Azraq camps must manage with 35 liters of water a day per person, which is about 3 times less than before the conflict. "
        ]
    },
    {
        "heading": "Lebanon",
        "paragraphs": [
            "Lebanon hosts about 1.5 million Syrian refugees, which amounts to more than one fourth of the total population, as of February 2017. This is by far the highest number of refugees per capita worldwide. One million refugees are registered withUNHCR, but the figure did not change since 2015, when the government suspended further registration; entering Lebanon has become close to impossible for the remaining Syrian refugees. There were 280,000 Palestinian refugees before the Syrian crisis, 32,000 more fled from Syria. Around 6,000 Iraqi refugees also fled to Lebanon. Additionally, 1-1.5 million Lebanese are in need of humanitarian assistance. Public services and infrastructure are overburdened, exacerbating pre-existing economic and social problems.\nTheLebanese Crisis Response Planexposes the official response to the crisis, as developed by the Lebanese government together with the UN and NGOs.",
            "About 12% of refugee households live in informal settlements (tents from timber, plastic sheets, etc.), 17% live in non-residential buildings (worksites, garages, shops), the remaining 71% living in regular apartments, houses, or doorman rooms (micro-apartments). More than a quarter of households are overcrowded (less than 4.5 meters per person). Similarly, many were in poor conditions, with 12% being severely damaged or in risk of collapse and 14% with significant issues such as leaking roofs, damaged plumbing, etc. Refugees pay an average monthly rent of 189 U.S. dollars, including people paying to keep their tent on the land. In addition, 23% have no access to bathrooms. Less than 1% of those refugees have no access to toilets, as 55% used flush latrines and 27% used improved pit latrines.",
            "No formal Syrian refugee camps exists in Lebanon. There are 12 pre-existing formalPalestinian refugee campsin Lebanon managed byUNRWA. While the Lebanese, Syrian, and Palestinian communities, as well as responsibilities for them, are to some extent separated,  some Syrians nevertheless live in those camps, at least in the short term. However, essentially no estimates of their number are known. "
        ]
    },
    {
        "heading": "Iraq",
        "table": [
            {
                "Governorate": "Dohuk",
                "Camp name": "Domiz 1",
                "Population": "31,554",
                "Total[43]": "49,156"
            },
            [
                "Domiz 2",
                "8,300"
            ],
            [
                "Gawilan",
                "8,124"
            ],
            [
                "Akre settlement",
                "1,178"
            ],
            {
                "Governorate": "Erbil",
                "Camp name": "Darashakran",
                "Population": "12,387",
                "Total[43]": "32,680"
            },
            [
                "Kawergosk",
                "9,090"
            ],
            [
                "Qushtapa",
                "7,716"
            ],
            [
                "Basirma",
                "3,487"
            ],
            {
                "Governorate": "Sulaymaniyah",
                "Camp name": "Arbat",
                "Population": "8,111",
                "Total[43]": "8,111"
            },
            {
                "Governorate": "Al Anbar",
                "Camp name": "Al-Obaidi",
                "Population": "1,500?",
                "Total[43]": "1,500?"
            }
        ]
    },
    {
        "heading": "Iraq",
        "paragraphs": [
            "There are 240,000 registered Syrian refugees inIraq, 90,000 of whom reside in camps managed byUNHCR,IRCand the Directorate of Health.\nAll the ten Syrian refugee camps inIraqare within theKurdish region.[clarification needed]There are 40 more camps for internally displaced Iraqis. ",
            "A camp for Syrian Kurds was also present inMoqebleh, near the city of Dohuk, but was moved several years later.\nThe al-Obaidi camp became inaccessible to humanitarian staff from 16 June 2014, the population figure has not been updated since. "
        ]
    },
    {
        "heading": "Egypt",
        "paragraphs": [
            "As of February 2017, 120,000 Syrian refugees and asylum-seekers are registered in Egypt, with 80,000 more from Sudan, Ethiopia and other African countries. "
        ]
    },
    {
        "heading": "Greece",
        "paragraphs": [
            "InGreece, therefugee campsopened in response to theEuropean migrant crisishostSyrian refugees(54.9% of arrivals) followed byAfghan(24.6%) andIraqi refugees(11.0%). There are currently 57,042 refugees in Greece, according to data collected in 2016 by The Refugee Crisis Management Coordination Body. ",
            "Epirus",
            "Central Macedonia",
            "Eastern Macedonia and Thrace",
            "Western Greece",
            "Central Greece",
            "Thessalia",
            "Attica",
            "Greek Islands, as of 10/06/2016: ",
            "North Aegean",
            "Lesvos",
            "Chios",
            "Samos",
            "South Aegean",
            "Leros",
            "Kos",
            "Rhodes",
            "Non-host countries:",
            "Germany:",
            "Germany is home to roughly 800,000 people, as of March 2021. This number does not amount to other countries with higher number of refugees per capita worldwide due to Germany's population of nearly 84 million. During 2014-2015, a majority of these Syrian refugees came to Germany because of the Syrian Civil War. The war created the European migrant crisis, which led to hundreds of thousands of Syrian refugees dispersing. Regions in Germany with the most Syrian refugees include Munich, Berlin, Hanover, Frankfurt, etc.",
            "After Germany's Chancellor, Angela Merkel, opened the door using its Open-Door Policy, in 2015, there was much excitement about the arrival of the refugees. These up-beat emotions quickly died down as right-wing parties wanted to have more of a say in the acceptance of Syrian refugees. The non-acceptance of refugees by right-wing parties forced the government to implement integration policies to rid of some of the tensions. A big issue is how to integrate the Syrian refugees into society to eliminate a lot of the unemployment. In 2019, the unemployment rate of Syrians in Germany was at 44.2% and the dependency on welfare was 74.9%.",
            "The living conditions for Syrian refugees in German camps are described in a wide variety. Due to the arrival of hundreds of thousands of refugees in a short amount of time, Germany had to build emergency camps. Many of these camps lack the requisite facilities and equipment. In this process, some refugees must undergo family separation due to integration laws. This delegates family members to separate cities in some cases. Nonetheless, there is reason to believe that Germany's integration efforts will progress in the future. Syrian refugees would eventually be able to exit the camps and relocate with their families. Statistics from a study done by the Institute for Employment Research show that the refugee unemployment rate has dropped in the past few years. Such integration actions would also assist refugees in obtaining asylum and exercising their civil rights."
        ]
    },
    {
        "heading": "References",
        "table": [
            [
                "OverviewsMain overviewsSyriaRojavaSyrian civil warTimelineBackground and causesSyrian government reactionsBelligerentsInter-rebel conflictSpilloverCities and townsSectarianism and minoritiesSyrian Desert campaign (December 2017–present)2024 Syrian opposition offensivesFall of the Assad regimeEffects and ongoing concernsCasualties of the Syrian civil warRefugees of the Syrian civil warHumanitarian aid during the Syrian civil warHuman rights violations during the Syrian civil warPhases and processesSyrian revolutionEarly insurgency phase2012–2013 escalationCeasefiresSyrian peace processWorld reactionInternational reactions to the Syrian civil warForeign involvement in the Syrian civil warReactions to the fall of the Assad regimeSpecific groups and countriesRussian involvementRussian interventionTurkish involvementTurkish occupation of northern SyriaSecond Northern Syria Buffer ZoneRussian-Turkish agreement on SyriaUS intervention in the Syrian civil war2023 attacks on U.S. bases in Iraq and SyriaKurdish Area in SyriaSyrian Democratic ForcesRojava conflictU.S. task forceAgreements and dialoguesRussian-Turkish agreement on SyriaRelations between Syrian government and Kurdish groups in SyriaTransitional phaseFirst Syrian transitional governmentSecond Syrian transitional government",
                "Overviews",
                "Main overviewsSyriaRojavaSyrian civil warTimelineBackground and causesSyrian government reactionsBelligerentsInter-rebel conflictSpilloverCities and townsSectarianism and minoritiesSyrian Desert campaign (December 2017–present)2024 Syrian opposition offensivesFall of the Assad regimeEffects and ongoing concernsCasualties of the Syrian civil warRefugees of the Syrian civil warHumanitarian aid during the Syrian civil warHuman rights violations during the Syrian civil warPhases and processesSyrian revolutionEarly insurgency phase2012–2013 escalationCeasefiresSyrian peace processWorld reactionInternational reactions to the Syrian civil warForeign involvement in the Syrian civil warReactions to the fall of the Assad regimeSpecific groups and countriesRussian involvementRussian interventionTurkish involvementTurkish occupation of northern SyriaSecond Northern Syria Buffer ZoneRussian-Turkish agreement on SyriaUS intervention in the Syrian civil war2023 attacks on U.S. bases in Iraq and SyriaKurdish Area in SyriaSyrian Democratic ForcesRojava conflictU.S. task forceAgreements and dialoguesRussian-Turkish agreement on SyriaRelations between Syrian government and Kurdish groups in SyriaTransitional phaseFirst Syrian transitional governmentSecond Syrian transitional government",
                "Main overviews",
                "SyriaRojavaSyrian civil warTimelineBackground and causesSyrian government reactionsBelligerentsInter-rebel conflictSpilloverCities and townsSectarianism and minoritiesSyrian Desert campaign (December 2017–present)2024 Syrian opposition offensivesFall of the Assad regime",
                "Effects and ongoing concerns",
                "Casualties of the Syrian civil warRefugees of the Syrian civil warHumanitarian aid during the Syrian civil warHuman rights violations during the Syrian civil war",
                "Phases and processes",
                "Syrian revolutionEarly insurgency phase2012–2013 escalationCeasefiresSyrian peace process",
                "World reaction",
                "International reactions to the Syrian civil warForeign involvement in the Syrian civil warReactions to the fall of the Assad regime",
                "Specific groups and countries",
                "Russian involvementRussian interventionTurkish involvementTurkish occupation of northern SyriaSecond Northern Syria Buffer ZoneRussian-Turkish agreement on SyriaUS intervention in the Syrian civil war2023 attacks on U.S. bases in Iraq and SyriaKurdish Area in SyriaSyrian Democratic ForcesRojava conflictU.S. task force",
                "Agreements and dialogues",
                "Russian-Turkish agreement on SyriaRelations between Syrian government and Kurdish groups in Syria",
                "Transitional phase",
                "First Syrian transitional governmentSecond Syrian transitional government"
            ],
            {
                "vteSyrian civil war": "Overviews"
            },
            [
                "Main overviewsSyriaRojavaSyrian civil warTimelineBackground and causesSyrian government reactionsBelligerentsInter-rebel conflictSpilloverCities and townsSectarianism and minoritiesSyrian Desert campaign (December 2017–present)2024 Syrian opposition offensivesFall of the Assad regimeEffects and ongoing concernsCasualties of the Syrian civil warRefugees of the Syrian civil warHumanitarian aid during the Syrian civil warHuman rights violations during the Syrian civil warPhases and processesSyrian revolutionEarly insurgency phase2012–2013 escalationCeasefiresSyrian peace processWorld reactionInternational reactions to the Syrian civil warForeign involvement in the Syrian civil warReactions to the fall of the Assad regimeSpecific groups and countriesRussian involvementRussian interventionTurkish involvementTurkish occupation of northern SyriaSecond Northern Syria Buffer ZoneRussian-Turkish agreement on SyriaUS intervention in the Syrian civil war2023 attacks on U.S. bases in Iraq and SyriaKurdish Area in SyriaSyrian Democratic ForcesRojava conflictU.S. task forceAgreements and dialoguesRussian-Turkish agreement on SyriaRelations between Syrian government and Kurdish groups in SyriaTransitional phaseFirst Syrian transitional governmentSecond Syrian transitional government",
                "Main overviews",
                "SyriaRojavaSyrian civil warTimelineBackground and causesSyrian government reactionsBelligerentsInter-rebel conflictSpilloverCities and townsSectarianism and minoritiesSyrian Desert campaign (December 2017–present)2024 Syrian opposition offensivesFall of the Assad regime",
                "Effects and ongoing concerns",
                "Casualties of the Syrian civil warRefugees of the Syrian civil warHumanitarian aid during the Syrian civil warHuman rights violations during the Syrian civil war",
                "Phases and processes",
                "Syrian revolutionEarly insurgency phase2012–2013 escalationCeasefiresSyrian peace process",
                "World reaction",
                "International reactions to the Syrian civil warForeign involvement in the Syrian civil warReactions to the fall of the Assad regime",
                "Specific groups and countries",
                "Russian involvementRussian interventionTurkish involvementTurkish occupation of northern SyriaSecond Northern Syria Buffer ZoneRussian-Turkish agreement on SyriaUS intervention in the Syrian civil war2023 attacks on U.S. bases in Iraq and SyriaKurdish Area in SyriaSyrian Democratic ForcesRojava conflictU.S. task force",
                "Agreements and dialogues",
                "Russian-Turkish agreement on SyriaRelations between Syrian government and Kurdish groups in Syria",
                "Transitional phase",
                "First Syrian transitional governmentSecond Syrian transitional government"
            ],
            [
                "Main overviews",
                "SyriaRojavaSyrian civil warTimelineBackground and causesSyrian government reactionsBelligerentsInter-rebel conflictSpilloverCities and townsSectarianism and minoritiesSyrian Desert campaign (December 2017–present)2024 Syrian opposition offensivesFall of the Assad regime"
            ],
            [
                "Effects and ongoing concerns",
                "Casualties of the Syrian civil warRefugees of the Syrian civil warHumanitarian aid during the Syrian civil warHuman rights violations during the Syrian civil war"
            ],
            [
                "Phases and processes",
                "Syrian revolutionEarly insurgency phase2012–2013 escalationCeasefiresSyrian peace process"
            ],
            [
                "World reaction",
                "International reactions to the Syrian civil warForeign involvement in the Syrian civil warReactions to the fall of the Assad regime"
            ],
            [
                "Specific groups and countries",
                "Russian involvementRussian interventionTurkish involvementTurkish occupation of northern SyriaSecond Northern Syria Buffer ZoneRussian-Turkish agreement on SyriaUS intervention in the Syrian civil war2023 attacks on U.S. bases in Iraq and SyriaKurdish Area in SyriaSyrian Democratic ForcesRojava conflictU.S. task force"
            ],
            [
                "Agreements and dialogues",
                "Russian-Turkish agreement on SyriaRelations between Syrian government and Kurdish groups in Syria"
            ],
            [
                "Transitional phase",
                "First Syrian transitional governmentSecond Syrian transitional government"
            ],
            [
                "TimelineBackground1963 coup1966 coupCorrective MovementIslamist uprisingLatakia protestsDamascus SpringQamishli riotsSyrian occupation of LebanonDamascus DeclarationHuman rights in Syria2010s in Syria political historyArab Spring2011Jan–AprMay–AugSep–DecSyrian revolutionDeath of Hamza Ali Al-KhateebSiege of DaraaSiege of BaniyasMay Talkalakh siegeSiege of Rastan and TalbisehJune Jisr ash-Shughur operationSiege of HamaSiege of HomsJabal al-Zawiya operationSiege of LatakiaDeir ez-Zor clashes (2011–2014)Rif Dimashq clashes (Nov 2011-Mar 2012)Battle of ZabadaniBattle of DoumaDaraa Governorate clashesBattle of RastanShayrat and Tiyas airbase ambushIdlib Governorate clashesDecember Jabal al-Zawiya massacres2012Jan–AprMay–AugSep–DecJanuary al-Midan bombingBattle of RastanFirst Battle of IdlibBattle of al-QusayrIdlib Governorate operation (Apr)Battle of TaftanazMay Battle of RastanHoula massacreBattle of al-HaffahAl-Qubeir massacreBattle of TremsehBattle of Damascus18 July 2012 Damascus bombingBattle of AleppoBattle of AnadanSiege of Base 46Al-Hasakah Governorate campaign (2012–2013)Rif Dimashq offensive (Aug-Oct)Darayya massacreBattle of Khirbet Al-JozBattle of Maarrat al-NumanFirst siege of Wadi DeifBattle of HaremRif Dimashq offensive (Nov 2012–Feb 2013)Battle of DarayyaAqrab massacreHama offensiveHalfaya massacreBattle of DarayyaQuneitra Governorate clashesTalbiseh bakery massacre2013Jan–AprMay–DecBattle of SafiraBattle of ShadadehDamascus offensiveRaqqa campaign (2012–2013)Battle of Raqqa (Mar)Daraa offensiveRif Dimashq offensive (Mar–Aug)Battle of Jdaidet al-FadlGhouta chemical attackAl-Qusayr offensiveBattle of al-QusayrBayda and Baniyas massacresHama offensiveHatla massacreKhan al-Assal chemical attackKhan al-Assal massacreAdra massacreBattle of Ras al-AynBattle of Tell AbyadRif Dimashq offensive (Sep–Nov)Aleppo offensive (Oct–Dec)Battle of al-YaarubiyahBattle of Tell Hamis and Tell Brak (Dec–Jan)2014Jan–JulAug–DecFirst Inter-rebel conflictBattle of MarkadaDeir ez-Zor offensiveBattle of MorekDaraa offensive (Feb–May)Maan massacreAl-Otaiba ambushIdlib offensiveBattle of HosnLatakia OffensiveBattle of Al-MalihahKafr Zita chemical attackSecond siege of Wadi DeifQalamoun offensive (Jun–Aug)Battle of ArsalFirst Battle of the Shaer gas fieldEastern Syria offensiveBattle of Tabqa AirbaseNorthern Aleppo offensive (Feb–Jul)Hama OffensiveQuneitra offensiveRif Dimashq offensive (Aug–Nov)Siege of KobanîHoms school bombingDaraa offensive (Oct)Al-Safira offensiveIdlib RaidSecond Inter-Rebel ConflictSecond Battle of the Shaer gas fieldBattle of Al-Shaykh MaskinDeir ez-Zor offensive (Dec)2015Jan–JulAug–DecAir Force An-26 crashDaraa Offensive (Jan)Southern Syria OffensiveEastern al-Hasakah offensiveBattle of Sarrin (Mar–Apr)Battle of Sarrin (Jun–Jul)Battle of BosraIdlib OffensiveSecond Battle of IdlibBattle of Nasib Border CrossingBattle of Yarmouk CampWestern al-Hasakah offensivePalmyra offensive (May)Qamishli bombingsTell Abyad offensiveKobanî massacreQuneitra offensive (Jun)Palmyra offensive (Jul–Aug)Rif Dimashq offensive (Sep)Northwestern Syria offensive (Oct–Nov)Aleppo offensive (Oct–Dec)Al-Hawl offensiveHoms offensive (Nov-Dec)East Aleppo offensive (2015–2016)2015–2016 Latakia offensiveTishrin Dam offensiveRussian Sukhoi Su-24 shootdown2016Jan–AprMay–AugSep–DecSecond Battle of Al-Shaykh MaskinDeir ez-Zor offensive (Jan)January Sayyidah Zaynab bombingsNorthern Aleppo offensive (Feb)Ithriyah-Raqqa offensive (Feb–Mar)Al-Shaddadi offensiveFebruary Homs bombingsFebruary Sayyidah Zaynab bombingsKhanasir offensiveBattle of Tel AbyadBattle of Maarrat al-NumanBattle of Qamishli (Apr)Northern Aleppo offensive (Mar–Jun)Palmyra offensive (Mar)East Ghouta inter-rebel conflict (Apr–May)Rif Dimashq offensive (Apr–May)Northern Raqqa offensive (May)May Jableh & Tartous bombingsIthriyah-Raqqa offensive (Jun)Rif Dimashq offensive (Jun–Oct)Manbij offensiveTokhar massacreSouthern Aleppo campaignBattle of al-Rai (Aug)Operation Euphrates ShieldAleppo summer campaignWestern al-Bab offensive (Sep)5 September bombingsSeptember Deir ez-Zor air raidSeptember Urum al-Kubra aid convoy attackAleppo offensive (Sep–Oct)Dabiq offensiveWestern al-Bab offensive (Oct–Nov)Khan al-Shih offensive (Oct–Nov)Raqqa campaignBattle of al-BabAleppo offensive (Nov-Dec)Palmyra offensive (Dec)2017Jan–AprMay–AugSep–DecWadi Barada offensive (2016–2017)January Azaz bombingDesert campaign (Dec 16–Apr 17)Idlib clashes (Jan–Mar)Deir ez-Zor offensive (Jan–Feb)Daraa offensive (Feb–Jun)Southwestern Daraa offensive (Feb)Qaboun offensivePalmyra offensiveEast Aleppo offensive (Jan–Apr)March Damascus bombingsAl-Jinah airstrikeHama offensive (Mar–Apr)Battle of TabqaKhan Shaykhun chemical attackShayrat missile strikeAleppo bombingApril Turkish airstrikesEast Ghouta inter-rebel conflict (Apr–May)Desert campaign (May–Jul)Maskanah Plains offensiveEast Hama offensiveBattle of RaqqaDaraa offensive (Jun)Southern Raqqa offensive (Jun)Jobar offensive (Jun–Aug)Quneitra offensive (Jun)Idlib clashes (Jul)Central campaignQalamoun (Jul–Aug)Deir ez-Zor offensive (Sep 17–Mar 18)Hama offensive (Sep)Northwestern campaign (Oct 17–Feb 18)Turkish military operation in Idlib GovernorateBattle of HarastaEastern campaign (Sep–Dec)Euphrates Crossing offensiveMayadin offensiveBattle of Deir ez-Zor (Sep–Nov)Abu Kamal offensiveBeit Jinn offensive2018Jan–AprMay–AugSep–DecOperation Olive BranchBattle of KhashamRif Dimashq offensive (Feb–Apr)Southern Damascus offensive (Jan–Feb)Syrian Liberation Front–Tahrir al-Sham conflictSouthern Damascus offensive (Mar)Douma chemical attackMissile strikes (Apr)Northern Homs offensive (Apr–May)Eastern Qalamoun offensive (Apr)Southern Damascus offensive (Apr–May)Deir ez-Zor clashes (Apr)Deir ez-Zor offensive (May–Jun)As-Suwayda offensive (Jun)Southern offensiveAs-Suwayda attacksAs-Suwayda (Aug-Nov)Qamishli clashes (Sep)Missile strikes (Sep)Northern border clashes2019Jan–AprMay–AugSep–DecIdlib inter-rebel conflictManbij bombingBattle of Baghuz FawqaniISIL insurgency in Deir-ez-ZorDêrik prison escape attemptTell Rifaat clashesNorthwestern offensive (Apr–Aug)June bombingsHass refugee camp bombingMissile strikes (Aug)Turkish offensive into northeastBarisha raidNovember bombingsIsraeli missile strikes (Nov)Qah missile strikeNorthwestern offensive (Dec 19–Mar 20)US airstrikes2020Jan–DecCOVID-19 pandemicAfrin bombingIdlib Governorate clashesKafr-Takharim airstrikeAyn Issa clashesDeir ez-Zor ambush2021Jan–DecSiege of Qamishli and Al-HasakahMissile strikes (Jan)US airstrike (Feb)Battle of Qamishli (Apr)US airstrike (Jun)Daraa clashesTahrir al-Sham–Junud al-Sham conflict2022Jan–DecBattle of al-HasakahAhrar al-Sham–Levant Front clashesJabal al-Bishrī clashesJarqli airstrikesNorthern Aleppo clashes (Oct)Operation Claw-SwordNorthwest clashes (Dec)2023Jan-DecAl-Sukhnah attackDamascus airstrikeHama attackNorthern border clashes2024Jan–OctNov–presentOpposition offensivesDeir ez-Zor offensiveBattle of AleppoAleppo University Hospital airstrikeSouthern offensiveOperation Dawn of FreedomManbij offensiveAl-Mustariha strikeKobani clashesHama offensiveHoms offensivePalmyra offensiveFall of DamascusFall of the Assad regimeWestern Syria clashesMassacres of Syrian AlawitesHezbollah-Syria clashesJaramana clashesLebanon–Syria border clashesRif Dimashq clashesMassacres of Syrian DruzeIsraeli invasionSpilloverIsrael and Golan Heights:March 2017 incidentFebruary 2018 incidentMay 2018 Israel–Iran incidentsIraq:Akashat ambushOperation al-ShabahApril 2014 Iraqi border airstrikeJordanian border incidentsApril 2014 Jordanian border airstrikeLebanon:Lebanese border clashesBattle of SidonIranian embassy bombing in BeirutNorth Lebanon clashesQalamoun (Jul–Aug 2017)Turkey:December 2011 Turkish border clash2012 Turkish F-4 Phantom shootdown2012 Turkish border clashes2013 Reyhanlı car bombingsJanuary 2014 Turkish attack in SyriaAssassination of Andrei KarlovRussian Air Force Al-Bab incident2020 Balyun airstrikesOperation Spring ShieldElsewhere:Deir ez-Zor missile strike(Iran)",
                "Timeline",
                "Background1963 coup1966 coupCorrective MovementIslamist uprisingLatakia protestsDamascus SpringQamishli riotsSyrian occupation of LebanonDamascus DeclarationHuman rights in Syria2010s in Syria political historyArab Spring2011Jan–AprMay–AugSep–DecSyrian revolutionDeath of Hamza Ali Al-KhateebSiege of DaraaSiege of BaniyasMay Talkalakh siegeSiege of Rastan and TalbisehJune Jisr ash-Shughur operationSiege of HamaSiege of HomsJabal al-Zawiya operationSiege of LatakiaDeir ez-Zor clashes (2011–2014)Rif Dimashq clashes (Nov 2011-Mar 2012)Battle of ZabadaniBattle of DoumaDaraa Governorate clashesBattle of RastanShayrat and Tiyas airbase ambushIdlib Governorate clashesDecember Jabal al-Zawiya massacres2012Jan–AprMay–AugSep–DecJanuary al-Midan bombingBattle of RastanFirst Battle of IdlibBattle of al-QusayrIdlib Governorate operation (Apr)Battle of TaftanazMay Battle of RastanHoula massacreBattle of al-HaffahAl-Qubeir massacreBattle of TremsehBattle of Damascus18 July 2012 Damascus bombingBattle of AleppoBattle of AnadanSiege of Base 46Al-Hasakah Governorate campaign (2012–2013)Rif Dimashq offensive (Aug-Oct)Darayya massacreBattle of Khirbet Al-JozBattle of Maarrat al-NumanFirst siege of Wadi DeifBattle of HaremRif Dimashq offensive (Nov 2012–Feb 2013)Battle of DarayyaAqrab massacreHama offensiveHalfaya massacreBattle of DarayyaQuneitra Governorate clashesTalbiseh bakery massacre2013Jan–AprMay–DecBattle of SafiraBattle of ShadadehDamascus offensiveRaqqa campaign (2012–2013)Battle of Raqqa (Mar)Daraa offensiveRif Dimashq offensive (Mar–Aug)Battle of Jdaidet al-FadlGhouta chemical attackAl-Qusayr offensiveBattle of al-QusayrBayda and Baniyas massacresHama offensiveHatla massacreKhan al-Assal chemical attackKhan al-Assal massacreAdra massacreBattle of Ras al-AynBattle of Tell AbyadRif Dimashq offensive (Sep–Nov)Aleppo offensive (Oct–Dec)Battle of al-YaarubiyahBattle of Tell Hamis and Tell Brak (Dec–Jan)2014Jan–JulAug–DecFirst Inter-rebel conflictBattle of MarkadaDeir ez-Zor offensiveBattle of MorekDaraa offensive (Feb–May)Maan massacreAl-Otaiba ambushIdlib offensiveBattle of HosnLatakia OffensiveBattle of Al-MalihahKafr Zita chemical attackSecond siege of Wadi DeifQalamoun offensive (Jun–Aug)Battle of ArsalFirst Battle of the Shaer gas fieldEastern Syria offensiveBattle of Tabqa AirbaseNorthern Aleppo offensive (Feb–Jul)Hama OffensiveQuneitra offensiveRif Dimashq offensive (Aug–Nov)Siege of KobanîHoms school bombingDaraa offensive (Oct)Al-Safira offensiveIdlib RaidSecond Inter-Rebel ConflictSecond Battle of the Shaer gas fieldBattle of Al-Shaykh MaskinDeir ez-Zor offensive (Dec)2015Jan–JulAug–DecAir Force An-26 crashDaraa Offensive (Jan)Southern Syria OffensiveEastern al-Hasakah offensiveBattle of Sarrin (Mar–Apr)Battle of Sarrin (Jun–Jul)Battle of BosraIdlib OffensiveSecond Battle of IdlibBattle of Nasib Border CrossingBattle of Yarmouk CampWestern al-Hasakah offensivePalmyra offensive (May)Qamishli bombingsTell Abyad offensiveKobanî massacreQuneitra offensive (Jun)Palmyra offensive (Jul–Aug)Rif Dimashq offensive (Sep)Northwestern Syria offensive (Oct–Nov)Aleppo offensive (Oct–Dec)Al-Hawl offensiveHoms offensive (Nov-Dec)East Aleppo offensive (2015–2016)2015–2016 Latakia offensiveTishrin Dam offensiveRussian Sukhoi Su-24 shootdown2016Jan–AprMay–AugSep–DecSecond Battle of Al-Shaykh MaskinDeir ez-Zor offensive (Jan)January Sayyidah Zaynab bombingsNorthern Aleppo offensive (Feb)Ithriyah-Raqqa offensive (Feb–Mar)Al-Shaddadi offensiveFebruary Homs bombingsFebruary Sayyidah Zaynab bombingsKhanasir offensiveBattle of Tel AbyadBattle of Maarrat al-NumanBattle of Qamishli (Apr)Northern Aleppo offensive (Mar–Jun)Palmyra offensive (Mar)East Ghouta inter-rebel conflict (Apr–May)Rif Dimashq offensive (Apr–May)Northern Raqqa offensive (May)May Jableh & Tartous bombingsIthriyah-Raqqa offensive (Jun)Rif Dimashq offensive (Jun–Oct)Manbij offensiveTokhar massacreSouthern Aleppo campaignBattle of al-Rai (Aug)Operation Euphrates ShieldAleppo summer campaignWestern al-Bab offensive (Sep)5 September bombingsSeptember Deir ez-Zor air raidSeptember Urum al-Kubra aid convoy attackAleppo offensive (Sep–Oct)Dabiq offensiveWestern al-Bab offensive (Oct–Nov)Khan al-Shih offensive (Oct–Nov)Raqqa campaignBattle of al-BabAleppo offensive (Nov-Dec)Palmyra offensive (Dec)2017Jan–AprMay–AugSep–DecWadi Barada offensive (2016–2017)January Azaz bombingDesert campaign (Dec 16–Apr 17)Idlib clashes (Jan–Mar)Deir ez-Zor offensive (Jan–Feb)Daraa offensive (Feb–Jun)Southwestern Daraa offensive (Feb)Qaboun offensivePalmyra offensiveEast Aleppo offensive (Jan–Apr)March Damascus bombingsAl-Jinah airstrikeHama offensive (Mar–Apr)Battle of TabqaKhan Shaykhun chemical attackShayrat missile strikeAleppo bombingApril Turkish airstrikesEast Ghouta inter-rebel conflict (Apr–May)Desert campaign (May–Jul)Maskanah Plains offensiveEast Hama offensiveBattle of RaqqaDaraa offensive (Jun)Southern Raqqa offensive (Jun)Jobar offensive (Jun–Aug)Quneitra offensive (Jun)Idlib clashes (Jul)Central campaignQalamoun (Jul–Aug)Deir ez-Zor offensive (Sep 17–Mar 18)Hama offensive (Sep)Northwestern campaign (Oct 17–Feb 18)Turkish military operation in Idlib GovernorateBattle of HarastaEastern campaign (Sep–Dec)Euphrates Crossing offensiveMayadin offensiveBattle of Deir ez-Zor (Sep–Nov)Abu Kamal offensiveBeit Jinn offensive2018Jan–AprMay–AugSep–DecOperation Olive BranchBattle of KhashamRif Dimashq offensive (Feb–Apr)Southern Damascus offensive (Jan–Feb)Syrian Liberation Front–Tahrir al-Sham conflictSouthern Damascus offensive (Mar)Douma chemical attackMissile strikes (Apr)Northern Homs offensive (Apr–May)Eastern Qalamoun offensive (Apr)Southern Damascus offensive (Apr–May)Deir ez-Zor clashes (Apr)Deir ez-Zor offensive (May–Jun)As-Suwayda offensive (Jun)Southern offensiveAs-Suwayda attacksAs-Suwayda (Aug-Nov)Qamishli clashes (Sep)Missile strikes (Sep)Northern border clashes2019Jan–AprMay–AugSep–DecIdlib inter-rebel conflictManbij bombingBattle of Baghuz FawqaniISIL insurgency in Deir-ez-ZorDêrik prison escape attemptTell Rifaat clashesNorthwestern offensive (Apr–Aug)June bombingsHass refugee camp bombingMissile strikes (Aug)Turkish offensive into northeastBarisha raidNovember bombingsIsraeli missile strikes (Nov)Qah missile strikeNorthwestern offensive (Dec 19–Mar 20)US airstrikes2020Jan–DecCOVID-19 pandemicAfrin bombingIdlib Governorate clashesKafr-Takharim airstrikeAyn Issa clashesDeir ez-Zor ambush2021Jan–DecSiege of Qamishli and Al-HasakahMissile strikes (Jan)US airstrike (Feb)Battle of Qamishli (Apr)US airstrike (Jun)Daraa clashesTahrir al-Sham–Junud al-Sham conflict2022Jan–DecBattle of al-HasakahAhrar al-Sham–Levant Front clashesJabal al-Bishrī clashesJarqli airstrikesNorthern Aleppo clashes (Oct)Operation Claw-SwordNorthwest clashes (Dec)2023Jan-DecAl-Sukhnah attackDamascus airstrikeHama attackNorthern border clashes2024Jan–OctNov–presentOpposition offensivesDeir ez-Zor offensiveBattle of AleppoAleppo University Hospital airstrikeSouthern offensiveOperation Dawn of FreedomManbij offensiveAl-Mustariha strikeKobani clashesHama offensiveHoms offensivePalmyra offensiveFall of DamascusFall of the Assad regimeWestern Syria clashesMassacres of Syrian AlawitesHezbollah-Syria clashesJaramana clashesLebanon–Syria border clashesRif Dimashq clashesMassacres of Syrian DruzeIsraeli invasionSpilloverIsrael and Golan Heights:March 2017 incidentFebruary 2018 incidentMay 2018 Israel–Iran incidentsIraq:Akashat ambushOperation al-ShabahApril 2014 Iraqi border airstrikeJordanian border incidentsApril 2014 Jordanian border airstrikeLebanon:Lebanese border clashesBattle of SidonIranian embassy bombing in BeirutNorth Lebanon clashesQalamoun (Jul–Aug 2017)Turkey:December 2011 Turkish border clash2012 Turkish F-4 Phantom shootdown2012 Turkish border clashes2013 Reyhanlı car bombingsJanuary 2014 Turkish attack in SyriaAssassination of Andrei KarlovRussian Air Force Al-Bab incident2020 Balyun airstrikesOperation Spring ShieldElsewhere:Deir ez-Zor missile strike(Iran)",
                "Background",
                "1963 coup1966 coupCorrective MovementIslamist uprisingLatakia protestsDamascus SpringQamishli riotsSyrian occupation of LebanonDamascus DeclarationHuman rights in Syria2010s in Syria political historyArab Spring",
                "2011Jan–AprMay–AugSep–Dec",
                "Syrian revolutionDeath of Hamza Ali Al-KhateebSiege of DaraaSiege of BaniyasMay Talkalakh siegeSiege of Rastan and TalbisehJune Jisr ash-Shughur operationSiege of HamaSiege of HomsJabal al-Zawiya operationSiege of LatakiaDeir ez-Zor clashes (2011–2014)Rif Dimashq clashes (Nov 2011-Mar 2012)Battle of ZabadaniBattle of DoumaDaraa Governorate clashesBattle of RastanShayrat and Tiyas airbase ambushIdlib Governorate clashesDecember Jabal al-Zawiya massacres",
                "2012Jan–AprMay–AugSep–Dec",
                "January al-Midan bombingBattle of RastanFirst Battle of IdlibBattle of al-QusayrIdlib Governorate operation (Apr)Battle of TaftanazMay Battle of RastanHoula massacreBattle of al-HaffahAl-Qubeir massacreBattle of TremsehBattle of Damascus18 July 2012 Damascus bombingBattle of AleppoBattle of AnadanSiege of Base 46Al-Hasakah Governorate campaign (2012–2013)Rif Dimashq offensive (Aug-Oct)Darayya massacreBattle of Khirbet Al-JozBattle of Maarrat al-NumanFirst siege of Wadi DeifBattle of HaremRif Dimashq offensive (Nov 2012–Feb 2013)Battle of DarayyaAqrab massacreHama offensiveHalfaya massacreBattle of DarayyaQuneitra Governorate clashesTalbiseh bakery massacre",
                "2013Jan–AprMay–Dec",
                "Battle of SafiraBattle of ShadadehDamascus offensiveRaqqa campaign (2012–2013)Battle of Raqqa (Mar)Daraa offensiveRif Dimashq offensive (Mar–Aug)Battle of Jdaidet al-FadlGhouta chemical attackAl-Qusayr offensiveBattle of al-QusayrBayda and Baniyas massacresHama offensiveHatla massacreKhan al-Assal chemical attackKhan al-Assal massacreAdra massacreBattle of Ras al-AynBattle of Tell AbyadRif Dimashq offensive (Sep–Nov)Aleppo offensive (Oct–Dec)Battle of al-YaarubiyahBattle of Tell Hamis and Tell Brak (Dec–Jan)",
                "2014Jan–JulAug–Dec",
                "First Inter-rebel conflictBattle of MarkadaDeir ez-Zor offensiveBattle of MorekDaraa offensive (Feb–May)Maan massacreAl-Otaiba ambushIdlib offensiveBattle of HosnLatakia OffensiveBattle of Al-MalihahKafr Zita chemical attackSecond siege of Wadi DeifQalamoun offensive (Jun–Aug)Battle of ArsalFirst Battle of the Shaer gas fieldEastern Syria offensiveBattle of Tabqa AirbaseNorthern Aleppo offensive (Feb–Jul)Hama OffensiveQuneitra offensiveRif Dimashq offensive (Aug–Nov)Siege of KobanîHoms school bombingDaraa offensive (Oct)Al-Safira offensiveIdlib RaidSecond Inter-Rebel ConflictSecond Battle of the Shaer gas fieldBattle of Al-Shaykh MaskinDeir ez-Zor offensive (Dec)",
                "2015Jan–JulAug–Dec",
                "Air Force An-26 crashDaraa Offensive (Jan)Southern Syria OffensiveEastern al-Hasakah offensiveBattle of Sarrin (Mar–Apr)Battle of Sarrin (Jun–Jul)Battle of BosraIdlib OffensiveSecond Battle of IdlibBattle of Nasib Border CrossingBattle of Yarmouk CampWestern al-Hasakah offensivePalmyra offensive (May)Qamishli bombingsTell Abyad offensiveKobanî massacreQuneitra offensive (Jun)Palmyra offensive (Jul–Aug)Rif Dimashq offensive (Sep)Northwestern Syria offensive (Oct–Nov)Aleppo offensive (Oct–Dec)Al-Hawl offensiveHoms offensive (Nov-Dec)East Aleppo offensive (2015–2016)2015–2016 Latakia offensiveTishrin Dam offensiveRussian Sukhoi Su-24 shootdown",
                "2016Jan–AprMay–AugSep–Dec",
                "Second Battle of Al-Shaykh MaskinDeir ez-Zor offensive (Jan)January Sayyidah Zaynab bombingsNorthern Aleppo offensive (Feb)Ithriyah-Raqqa offensive (Feb–Mar)Al-Shaddadi offensiveFebruary Homs bombingsFebruary Sayyidah Zaynab bombingsKhanasir offensiveBattle of Tel AbyadBattle of Maarrat al-NumanBattle of Qamishli (Apr)Northern Aleppo offensive (Mar–Jun)Palmyra offensive (Mar)East Ghouta inter-rebel conflict (Apr–May)Rif Dimashq offensive (Apr–May)Northern Raqqa offensive (May)May Jableh & Tartous bombingsIthriyah-Raqqa offensive (Jun)Rif Dimashq offensive (Jun–Oct)Manbij offensiveTokhar massacreSouthern Aleppo campaignBattle of al-Rai (Aug)Operation Euphrates ShieldAleppo summer campaignWestern al-Bab offensive (Sep)5 September bombingsSeptember Deir ez-Zor air raidSeptember Urum al-Kubra aid convoy attackAleppo offensive (Sep–Oct)Dabiq offensiveWestern al-Bab offensive (Oct–Nov)Khan al-Shih offensive (Oct–Nov)Raqqa campaignBattle of al-BabAleppo offensive (Nov-Dec)Palmyra offensive (Dec)",
                "2017Jan–AprMay–AugSep–Dec",
                "Wadi Barada offensive (2016–2017)January Azaz bombingDesert campaign (Dec 16–Apr 17)Idlib clashes (Jan–Mar)Deir ez-Zor offensive (Jan–Feb)Daraa offensive (Feb–Jun)Southwestern Daraa offensive (Feb)Qaboun offensivePalmyra offensiveEast Aleppo offensive (Jan–Apr)March Damascus bombingsAl-Jinah airstrikeHama offensive (Mar–Apr)Battle of TabqaKhan Shaykhun chemical attackShayrat missile strikeAleppo bombingApril Turkish airstrikesEast Ghouta inter-rebel conflict (Apr–May)Desert campaign (May–Jul)Maskanah Plains offensiveEast Hama offensiveBattle of RaqqaDaraa offensive (Jun)Southern Raqqa offensive (Jun)Jobar offensive (Jun–Aug)Quneitra offensive (Jun)Idlib clashes (Jul)Central campaignQalamoun (Jul–Aug)Deir ez-Zor offensive (Sep 17–Mar 18)Hama offensive (Sep)Northwestern campaign (Oct 17–Feb 18)Turkish military operation in Idlib GovernorateBattle of HarastaEastern campaign (Sep–Dec)Euphrates Crossing offensiveMayadin offensiveBattle of Deir ez-Zor (Sep–Nov)Abu Kamal offensiveBeit Jinn offensive",
                "2018Jan–AprMay–AugSep–Dec",
                "Operation Olive BranchBattle of KhashamRif Dimashq offensive (Feb–Apr)Southern Damascus offensive (Jan–Feb)Syrian Liberation Front–Tahrir al-Sham conflictSouthern Damascus offensive (Mar)Douma chemical attackMissile strikes (Apr)Northern Homs offensive (Apr–May)Eastern Qalamoun offensive (Apr)Southern Damascus offensive (Apr–May)Deir ez-Zor clashes (Apr)Deir ez-Zor offensive (May–Jun)As-Suwayda offensive (Jun)Southern offensiveAs-Suwayda attacksAs-Suwayda (Aug-Nov)Qamishli clashes (Sep)Missile strikes (Sep)Northern border clashes",
                "2019Jan–AprMay–AugSep–Dec",
                "Idlib inter-rebel conflictManbij bombingBattle of Baghuz FawqaniISIL insurgency in Deir-ez-ZorDêrik prison escape attemptTell Rifaat clashesNorthwestern offensive (Apr–Aug)June bombingsHass refugee camp bombingMissile strikes (Aug)Turkish offensive into northeastBarisha raidNovember bombingsIsraeli missile strikes (Nov)Qah missile strikeNorthwestern offensive (Dec 19–Mar 20)US airstrikes",
                "2020Jan–Dec",
                "COVID-19 pandemicAfrin bombingIdlib Governorate clashesKafr-Takharim airstrikeAyn Issa clashesDeir ez-Zor ambush",
                "2021Jan–Dec",
                "Siege of Qamishli and Al-HasakahMissile strikes (Jan)US airstrike (Feb)Battle of Qamishli (Apr)US airstrike (Jun)Daraa clashesTahrir al-Sham–Junud al-Sham conflict",
                "2022Jan–Dec",
                "Battle of al-HasakahAhrar al-Sham–Levant Front clashesJabal al-Bishrī clashesJarqli airstrikesNorthern Aleppo clashes (Oct)Operation Claw-SwordNorthwest clashes (Dec)",
                "2023Jan-Dec",
                "Al-Sukhnah attackDamascus airstrikeHama attackNorthern border clashes",
                "2024Jan–OctNov–present",
                "Opposition offensivesDeir ez-Zor offensiveBattle of AleppoAleppo University Hospital airstrikeSouthern offensiveOperation Dawn of FreedomManbij offensiveAl-Mustariha strikeKobani clashesHama offensiveHoms offensivePalmyra offensiveFall of DamascusFall of the Assad regimeWestern Syria clashesMassacres of Syrian AlawitesHezbollah-Syria clashesJaramana clashesLebanon–Syria border clashesRif Dimashq clashesMassacres of Syrian DruzeIsraeli invasion",
                "Spillover",
                "Israel and Golan Heights:March 2017 incidentFebruary 2018 incidentMay 2018 Israel–Iran incidentsIraq:Akashat ambushOperation al-ShabahApril 2014 Iraqi border airstrikeJordanian border incidentsApril 2014 Jordanian border airstrikeLebanon:Lebanese border clashesBattle of SidonIranian embassy bombing in BeirutNorth Lebanon clashesQalamoun (Jul–Aug 2017)Turkey:December 2011 Turkish border clash2012 Turkish F-4 Phantom shootdown2012 Turkish border clashes2013 Reyhanlı car bombingsJanuary 2014 Turkish attack in SyriaAssassination of Andrei KarlovRussian Air Force Al-Bab incident2020 Balyun airstrikesOperation Spring ShieldElsewhere:Deir ez-Zor missile strike(Iran)",
                "Israel and Golan Heights:",
                "March 2017 incidentFebruary 2018 incidentMay 2018 Israel–Iran incidents",
                "Iraq:",
                "Akashat ambushOperation al-ShabahApril 2014 Iraqi border airstrike",
                "Jordanian border incidents",
                "April 2014 Jordanian border airstrike",
                "Lebanon:",
                "Lebanese border clashesBattle of SidonIranian embassy bombing in BeirutNorth Lebanon clashesQalamoun (Jul–Aug 2017)",
                "Turkey:",
                "December 2011 Turkish border clash2012 Turkish F-4 Phantom shootdown2012 Turkish border clashes2013 Reyhanlı car bombingsJanuary 2014 Turkish attack in SyriaAssassination of Andrei KarlovRussian Air Force Al-Bab incident2020 Balyun airstrikesOperation Spring Shield",
                "Elsewhere:",
                "Deir ez-Zor missile strike(Iran)"
            ],
            {
                "vteSyrian civil war": "Timeline"
            },
            [
                "Background1963 coup1966 coupCorrective MovementIslamist uprisingLatakia protestsDamascus SpringQamishli riotsSyrian occupation of LebanonDamascus DeclarationHuman rights in Syria2010s in Syria political historyArab Spring2011Jan–AprMay–AugSep–DecSyrian revolutionDeath of Hamza Ali Al-KhateebSiege of DaraaSiege of BaniyasMay Talkalakh siegeSiege of Rastan and TalbisehJune Jisr ash-Shughur operationSiege of HamaSiege of HomsJabal al-Zawiya operationSiege of LatakiaDeir ez-Zor clashes (2011–2014)Rif Dimashq clashes (Nov 2011-Mar 2012)Battle of ZabadaniBattle of DoumaDaraa Governorate clashesBattle of RastanShayrat and Tiyas airbase ambushIdlib Governorate clashesDecember Jabal al-Zawiya massacres2012Jan–AprMay–AugSep–DecJanuary al-Midan bombingBattle of RastanFirst Battle of IdlibBattle of al-QusayrIdlib Governorate operation (Apr)Battle of TaftanazMay Battle of RastanHoula massacreBattle of al-HaffahAl-Qubeir massacreBattle of TremsehBattle of Damascus18 July 2012 Damascus bombingBattle of AleppoBattle of AnadanSiege of Base 46Al-Hasakah Governorate campaign (2012–2013)Rif Dimashq offensive (Aug-Oct)Darayya massacreBattle of Khirbet Al-JozBattle of Maarrat al-NumanFirst siege of Wadi DeifBattle of HaremRif Dimashq offensive (Nov 2012–Feb 2013)Battle of DarayyaAqrab massacreHama offensiveHalfaya massacreBattle of DarayyaQuneitra Governorate clashesTalbiseh bakery massacre2013Jan–AprMay–DecBattle of SafiraBattle of ShadadehDamascus offensiveRaqqa campaign (2012–2013)Battle of Raqqa (Mar)Daraa offensiveRif Dimashq offensive (Mar–Aug)Battle of Jdaidet al-FadlGhouta chemical attackAl-Qusayr offensiveBattle of al-QusayrBayda and Baniyas massacresHama offensiveHatla massacreKhan al-Assal chemical attackKhan al-Assal massacreAdra massacreBattle of Ras al-AynBattle of Tell AbyadRif Dimashq offensive (Sep–Nov)Aleppo offensive (Oct–Dec)Battle of al-YaarubiyahBattle of Tell Hamis and Tell Brak (Dec–Jan)2014Jan–JulAug–DecFirst Inter-rebel conflictBattle of MarkadaDeir ez-Zor offensiveBattle of MorekDaraa offensive (Feb–May)Maan massacreAl-Otaiba ambushIdlib offensiveBattle of HosnLatakia OffensiveBattle of Al-MalihahKafr Zita chemical attackSecond siege of Wadi DeifQalamoun offensive (Jun–Aug)Battle of ArsalFirst Battle of the Shaer gas fieldEastern Syria offensiveBattle of Tabqa AirbaseNorthern Aleppo offensive (Feb–Jul)Hama OffensiveQuneitra offensiveRif Dimashq offensive (Aug–Nov)Siege of KobanîHoms school bombingDaraa offensive (Oct)Al-Safira offensiveIdlib RaidSecond Inter-Rebel ConflictSecond Battle of the Shaer gas fieldBattle of Al-Shaykh MaskinDeir ez-Zor offensive (Dec)2015Jan–JulAug–DecAir Force An-26 crashDaraa Offensive (Jan)Southern Syria OffensiveEastern al-Hasakah offensiveBattle of Sarrin (Mar–Apr)Battle of Sarrin (Jun–Jul)Battle of BosraIdlib OffensiveSecond Battle of IdlibBattle of Nasib Border CrossingBattle of Yarmouk CampWestern al-Hasakah offensivePalmyra offensive (May)Qamishli bombingsTell Abyad offensiveKobanî massacreQuneitra offensive (Jun)Palmyra offensive (Jul–Aug)Rif Dimashq offensive (Sep)Northwestern Syria offensive (Oct–Nov)Aleppo offensive (Oct–Dec)Al-Hawl offensiveHoms offensive (Nov-Dec)East Aleppo offensive (2015–2016)2015–2016 Latakia offensiveTishrin Dam offensiveRussian Sukhoi Su-24 shootdown2016Jan–AprMay–AugSep–DecSecond Battle of Al-Shaykh MaskinDeir ez-Zor offensive (Jan)January Sayyidah Zaynab bombingsNorthern Aleppo offensive (Feb)Ithriyah-Raqqa offensive (Feb–Mar)Al-Shaddadi offensiveFebruary Homs bombingsFebruary Sayyidah Zaynab bombingsKhanasir offensiveBattle of Tel AbyadBattle of Maarrat al-NumanBattle of Qamishli (Apr)Northern Aleppo offensive (Mar–Jun)Palmyra offensive (Mar)East Ghouta inter-rebel conflict (Apr–May)Rif Dimashq offensive (Apr–May)Northern Raqqa offensive (May)May Jableh & Tartous bombingsIthriyah-Raqqa offensive (Jun)Rif Dimashq offensive (Jun–Oct)Manbij offensiveTokhar massacreSouthern Aleppo campaignBattle of al-Rai (Aug)Operation Euphrates ShieldAleppo summer campaignWestern al-Bab offensive (Sep)5 September bombingsSeptember Deir ez-Zor air raidSeptember Urum al-Kubra aid convoy attackAleppo offensive (Sep–Oct)Dabiq offensiveWestern al-Bab offensive (Oct–Nov)Khan al-Shih offensive (Oct–Nov)Raqqa campaignBattle of al-BabAleppo offensive (Nov-Dec)Palmyra offensive (Dec)2017Jan–AprMay–AugSep–DecWadi Barada offensive (2016–2017)January Azaz bombingDesert campaign (Dec 16–Apr 17)Idlib clashes (Jan–Mar)Deir ez-Zor offensive (Jan–Feb)Daraa offensive (Feb–Jun)Southwestern Daraa offensive (Feb)Qaboun offensivePalmyra offensiveEast Aleppo offensive (Jan–Apr)March Damascus bombingsAl-Jinah airstrikeHama offensive (Mar–Apr)Battle of TabqaKhan Shaykhun chemical attackShayrat missile strikeAleppo bombingApril Turkish airstrikesEast Ghouta inter-rebel conflict (Apr–May)Desert campaign (May–Jul)Maskanah Plains offensiveEast Hama offensiveBattle of RaqqaDaraa offensive (Jun)Southern Raqqa offensive (Jun)Jobar offensive (Jun–Aug)Quneitra offensive (Jun)Idlib clashes (Jul)Central campaignQalamoun (Jul–Aug)Deir ez-Zor offensive (Sep 17–Mar 18)Hama offensive (Sep)Northwestern campaign (Oct 17–Feb 18)Turkish military operation in Idlib GovernorateBattle of HarastaEastern campaign (Sep–Dec)Euphrates Crossing offensiveMayadin offensiveBattle of Deir ez-Zor (Sep–Nov)Abu Kamal offensiveBeit Jinn offensive2018Jan–AprMay–AugSep–DecOperation Olive BranchBattle of KhashamRif Dimashq offensive (Feb–Apr)Southern Damascus offensive (Jan–Feb)Syrian Liberation Front–Tahrir al-Sham conflictSouthern Damascus offensive (Mar)Douma chemical attackMissile strikes (Apr)Northern Homs offensive (Apr–May)Eastern Qalamoun offensive (Apr)Southern Damascus offensive (Apr–May)Deir ez-Zor clashes (Apr)Deir ez-Zor offensive (May–Jun)As-Suwayda offensive (Jun)Southern offensiveAs-Suwayda attacksAs-Suwayda (Aug-Nov)Qamishli clashes (Sep)Missile strikes (Sep)Northern border clashes2019Jan–AprMay–AugSep–DecIdlib inter-rebel conflictManbij bombingBattle of Baghuz FawqaniISIL insurgency in Deir-ez-ZorDêrik prison escape attemptTell Rifaat clashesNorthwestern offensive (Apr–Aug)June bombingsHass refugee camp bombingMissile strikes (Aug)Turkish offensive into northeastBarisha raidNovember bombingsIsraeli missile strikes (Nov)Qah missile strikeNorthwestern offensive (Dec 19–Mar 20)US airstrikes2020Jan–DecCOVID-19 pandemicAfrin bombingIdlib Governorate clashesKafr-Takharim airstrikeAyn Issa clashesDeir ez-Zor ambush2021Jan–DecSiege of Qamishli and Al-HasakahMissile strikes (Jan)US airstrike (Feb)Battle of Qamishli (Apr)US airstrike (Jun)Daraa clashesTahrir al-Sham–Junud al-Sham conflict2022Jan–DecBattle of al-HasakahAhrar al-Sham–Levant Front clashesJabal al-Bishrī clashesJarqli airstrikesNorthern Aleppo clashes (Oct)Operation Claw-SwordNorthwest clashes (Dec)2023Jan-DecAl-Sukhnah attackDamascus airstrikeHama attackNorthern border clashes2024Jan–OctNov–presentOpposition offensivesDeir ez-Zor offensiveBattle of AleppoAleppo University Hospital airstrikeSouthern offensiveOperation Dawn of FreedomManbij offensiveAl-Mustariha strikeKobani clashesHama offensiveHoms offensivePalmyra offensiveFall of DamascusFall of the Assad regimeWestern Syria clashesMassacres of Syrian AlawitesHezbollah-Syria clashesJaramana clashesLebanon–Syria border clashesRif Dimashq clashesMassacres of Syrian DruzeIsraeli invasionSpilloverIsrael and Golan Heights:March 2017 incidentFebruary 2018 incidentMay 2018 Israel–Iran incidentsIraq:Akashat ambushOperation al-ShabahApril 2014 Iraqi border airstrikeJordanian border incidentsApril 2014 Jordanian border airstrikeLebanon:Lebanese border clashesBattle of SidonIranian embassy bombing in BeirutNorth Lebanon clashesQalamoun (Jul–Aug 2017)Turkey:December 2011 Turkish border clash2012 Turkish F-4 Phantom shootdown2012 Turkish border clashes2013 Reyhanlı car bombingsJanuary 2014 Turkish attack in SyriaAssassination of Andrei KarlovRussian Air Force Al-Bab incident2020 Balyun airstrikesOperation Spring ShieldElsewhere:Deir ez-Zor missile strike(Iran)",
                "Background",
                "1963 coup1966 coupCorrective MovementIslamist uprisingLatakia protestsDamascus SpringQamishli riotsSyrian occupation of LebanonDamascus DeclarationHuman rights in Syria2010s in Syria political historyArab Spring",
                "2011Jan–AprMay–AugSep–Dec",
                "Syrian revolutionDeath of Hamza Ali Al-KhateebSiege of DaraaSiege of BaniyasMay Talkalakh siegeSiege of Rastan and TalbisehJune Jisr ash-Shughur operationSiege of HamaSiege of HomsJabal al-Zawiya operationSiege of LatakiaDeir ez-Zor clashes (2011–2014)Rif Dimashq clashes (Nov 2011-Mar 2012)Battle of ZabadaniBattle of DoumaDaraa Governorate clashesBattle of RastanShayrat and Tiyas airbase ambushIdlib Governorate clashesDecember Jabal al-Zawiya massacres",
                "2012Jan–AprMay–AugSep–Dec",
                "January al-Midan bombingBattle of RastanFirst Battle of IdlibBattle of al-QusayrIdlib Governorate operation (Apr)Battle of TaftanazMay Battle of RastanHoula massacreBattle of al-HaffahAl-Qubeir massacreBattle of TremsehBattle of Damascus18 July 2012 Damascus bombingBattle of AleppoBattle of AnadanSiege of Base 46Al-Hasakah Governorate campaign (2012–2013)Rif Dimashq offensive (Aug-Oct)Darayya massacreBattle of Khirbet Al-JozBattle of Maarrat al-NumanFirst siege of Wadi DeifBattle of HaremRif Dimashq offensive (Nov 2012–Feb 2013)Battle of DarayyaAqrab massacreHama offensiveHalfaya massacreBattle of DarayyaQuneitra Governorate clashesTalbiseh bakery massacre",
                "2013Jan–AprMay–Dec",
                "Battle of SafiraBattle of ShadadehDamascus offensiveRaqqa campaign (2012–2013)Battle of Raqqa (Mar)Daraa offensiveRif Dimashq offensive (Mar–Aug)Battle of Jdaidet al-FadlGhouta chemical attackAl-Qusayr offensiveBattle of al-QusayrBayda and Baniyas massacresHama offensiveHatla massacreKhan al-Assal chemical attackKhan al-Assal massacreAdra massacreBattle of Ras al-AynBattle of Tell AbyadRif Dimashq offensive (Sep–Nov)Aleppo offensive (Oct–Dec)Battle of al-YaarubiyahBattle of Tell Hamis and Tell Brak (Dec–Jan)",
                "2014Jan–JulAug–Dec",
                "First Inter-rebel conflictBattle of MarkadaDeir ez-Zor offensiveBattle of MorekDaraa offensive (Feb–May)Maan massacreAl-Otaiba ambushIdlib offensiveBattle of HosnLatakia OffensiveBattle of Al-MalihahKafr Zita chemical attackSecond siege of Wadi DeifQalamoun offensive (Jun–Aug)Battle of ArsalFirst Battle of the Shaer gas fieldEastern Syria offensiveBattle of Tabqa AirbaseNorthern Aleppo offensive (Feb–Jul)Hama OffensiveQuneitra offensiveRif Dimashq offensive (Aug–Nov)Siege of KobanîHoms school bombingDaraa offensive (Oct)Al-Safira offensiveIdlib RaidSecond Inter-Rebel ConflictSecond Battle of the Shaer gas fieldBattle of Al-Shaykh MaskinDeir ez-Zor offensive (Dec)",
                "2015Jan–JulAug–Dec",
                "Air Force An-26 crashDaraa Offensive (Jan)Southern Syria OffensiveEastern al-Hasakah offensiveBattle of Sarrin (Mar–Apr)Battle of Sarrin (Jun–Jul)Battle of BosraIdlib OffensiveSecond Battle of IdlibBattle of Nasib Border CrossingBattle of Yarmouk CampWestern al-Hasakah offensivePalmyra offensive (May)Qamishli bombingsTell Abyad offensiveKobanî massacreQuneitra offensive (Jun)Palmyra offensive (Jul–Aug)Rif Dimashq offensive (Sep)Northwestern Syria offensive (Oct–Nov)Aleppo offensive (Oct–Dec)Al-Hawl offensiveHoms offensive (Nov-Dec)East Aleppo offensive (2015–2016)2015–2016 Latakia offensiveTishrin Dam offensiveRussian Sukhoi Su-24 shootdown",
                "2016Jan–AprMay–AugSep–Dec",
                "Second Battle of Al-Shaykh MaskinDeir ez-Zor offensive (Jan)January Sayyidah Zaynab bombingsNorthern Aleppo offensive (Feb)Ithriyah-Raqqa offensive (Feb–Mar)Al-Shaddadi offensiveFebruary Homs bombingsFebruary Sayyidah Zaynab bombingsKhanasir offensiveBattle of Tel AbyadBattle of Maarrat al-NumanBattle of Qamishli (Apr)Northern Aleppo offensive (Mar–Jun)Palmyra offensive (Mar)East Ghouta inter-rebel conflict (Apr–May)Rif Dimashq offensive (Apr–May)Northern Raqqa offensive (May)May Jableh & Tartous bombingsIthriyah-Raqqa offensive (Jun)Rif Dimashq offensive (Jun–Oct)Manbij offensiveTokhar massacreSouthern Aleppo campaignBattle of al-Rai (Aug)Operation Euphrates ShieldAleppo summer campaignWestern al-Bab offensive (Sep)5 September bombingsSeptember Deir ez-Zor air raidSeptember Urum al-Kubra aid convoy attackAleppo offensive (Sep–Oct)Dabiq offensiveWestern al-Bab offensive (Oct–Nov)Khan al-Shih offensive (Oct–Nov)Raqqa campaignBattle of al-BabAleppo offensive (Nov-Dec)Palmyra offensive (Dec)",
                "2017Jan–AprMay–AugSep–Dec",
                "Wadi Barada offensive (2016–2017)January Azaz bombingDesert campaign (Dec 16–Apr 17)Idlib clashes (Jan–Mar)Deir ez-Zor offensive (Jan–Feb)Daraa offensive (Feb–Jun)Southwestern Daraa offensive (Feb)Qaboun offensivePalmyra offensiveEast Aleppo offensive (Jan–Apr)March Damascus bombingsAl-Jinah airstrikeHama offensive (Mar–Apr)Battle of TabqaKhan Shaykhun chemical attackShayrat missile strikeAleppo bombingApril Turkish airstrikesEast Ghouta inter-rebel conflict (Apr–May)Desert campaign (May–Jul)Maskanah Plains offensiveEast Hama offensiveBattle of RaqqaDaraa offensive (Jun)Southern Raqqa offensive (Jun)Jobar offensive (Jun–Aug)Quneitra offensive (Jun)Idlib clashes (Jul)Central campaignQalamoun (Jul–Aug)Deir ez-Zor offensive (Sep 17–Mar 18)Hama offensive (Sep)Northwestern campaign (Oct 17–Feb 18)Turkish military operation in Idlib GovernorateBattle of HarastaEastern campaign (Sep–Dec)Euphrates Crossing offensiveMayadin offensiveBattle of Deir ez-Zor (Sep–Nov)Abu Kamal offensiveBeit Jinn offensive",
                "2018Jan–AprMay–AugSep–Dec",
                "Operation Olive BranchBattle of KhashamRif Dimashq offensive (Feb–Apr)Southern Damascus offensive (Jan–Feb)Syrian Liberation Front–Tahrir al-Sham conflictSouthern Damascus offensive (Mar)Douma chemical attackMissile strikes (Apr)Northern Homs offensive (Apr–May)Eastern Qalamoun offensive (Apr)Southern Damascus offensive (Apr–May)Deir ez-Zor clashes (Apr)Deir ez-Zor offensive (May–Jun)As-Suwayda offensive (Jun)Southern offensiveAs-Suwayda attacksAs-Suwayda (Aug-Nov)Qamishli clashes (Sep)Missile strikes (Sep)Northern border clashes",
                "2019Jan–AprMay–AugSep–Dec",
                "Idlib inter-rebel conflictManbij bombingBattle of Baghuz FawqaniISIL insurgency in Deir-ez-ZorDêrik prison escape attemptTell Rifaat clashesNorthwestern offensive (Apr–Aug)June bombingsHass refugee camp bombingMissile strikes (Aug)Turkish offensive into northeastBarisha raidNovember bombingsIsraeli missile strikes (Nov)Qah missile strikeNorthwestern offensive (Dec 19–Mar 20)US airstrikes",
                "2020Jan–Dec",
                "COVID-19 pandemicAfrin bombingIdlib Governorate clashesKafr-Takharim airstrikeAyn Issa clashesDeir ez-Zor ambush",
                "2021Jan–Dec",
                "Siege of Qamishli and Al-HasakahMissile strikes (Jan)US airstrike (Feb)Battle of Qamishli (Apr)US airstrike (Jun)Daraa clashesTahrir al-Sham–Junud al-Sham conflict",
                "2022Jan–Dec",
                "Battle of al-HasakahAhrar al-Sham–Levant Front clashesJabal al-Bishrī clashesJarqli airstrikesNorthern Aleppo clashes (Oct)Operation Claw-SwordNorthwest clashes (Dec)",
                "2023Jan-Dec",
                "Al-Sukhnah attackDamascus airstrikeHama attackNorthern border clashes",
                "2024Jan–OctNov–present",
                "Opposition offensivesDeir ez-Zor offensiveBattle of AleppoAleppo University Hospital airstrikeSouthern offensiveOperation Dawn of FreedomManbij offensiveAl-Mustariha strikeKobani clashesHama offensiveHoms offensivePalmyra offensiveFall of DamascusFall of the Assad regimeWestern Syria clashesMassacres of Syrian AlawitesHezbollah-Syria clashesJaramana clashesLebanon–Syria border clashesRif Dimashq clashesMassacres of Syrian DruzeIsraeli invasion",
                "Spillover",
                "Israel and Golan Heights:March 2017 incidentFebruary 2018 incidentMay 2018 Israel–Iran incidentsIraq:Akashat ambushOperation al-ShabahApril 2014 Iraqi border airstrikeJordanian border incidentsApril 2014 Jordanian border airstrikeLebanon:Lebanese border clashesBattle of SidonIranian embassy bombing in BeirutNorth Lebanon clashesQalamoun (Jul–Aug 2017)Turkey:December 2011 Turkish border clash2012 Turkish F-4 Phantom shootdown2012 Turkish border clashes2013 Reyhanlı car bombingsJanuary 2014 Turkish attack in SyriaAssassination of Andrei KarlovRussian Air Force Al-Bab incident2020 Balyun airstrikesOperation Spring ShieldElsewhere:Deir ez-Zor missile strike(Iran)",
                "Israel and Golan Heights:",
                "March 2017 incidentFebruary 2018 incidentMay 2018 Israel–Iran incidents",
                "Iraq:",
                "Akashat ambushOperation al-ShabahApril 2014 Iraqi border airstrike",
                "Jordanian border incidents",
                "April 2014 Jordanian border airstrike",
                "Lebanon:",
                "Lebanese border clashesBattle of SidonIranian embassy bombing in BeirutNorth Lebanon clashesQalamoun (Jul–Aug 2017)",
                "Turkey:",
                "December 2011 Turkish border clash2012 Turkish F-4 Phantom shootdown2012 Turkish border clashes2013 Reyhanlı car bombingsJanuary 2014 Turkish attack in SyriaAssassination of Andrei KarlovRussian Air Force Al-Bab incident2020 Balyun airstrikesOperation Spring Shield",
                "Elsewhere:",
                "Deir ez-Zor missile strike(Iran)"
            ],
            [
                "Background",
                "1963 coup1966 coupCorrective MovementIslamist uprisingLatakia protestsDamascus SpringQamishli riotsSyrian occupation of LebanonDamascus DeclarationHuman rights in Syria2010s in Syria political historyArab Spring"
            ],
            [
                "2011Jan–AprMay–AugSep–Dec",
                "Syrian revolutionDeath of Hamza Ali Al-KhateebSiege of DaraaSiege of BaniyasMay Talkalakh siegeSiege of Rastan and TalbisehJune Jisr ash-Shughur operationSiege of HamaSiege of HomsJabal al-Zawiya operationSiege of LatakiaDeir ez-Zor clashes (2011–2014)Rif Dimashq clashes (Nov 2011-Mar 2012)Battle of ZabadaniBattle of DoumaDaraa Governorate clashesBattle of RastanShayrat and Tiyas airbase ambushIdlib Governorate clashesDecember Jabal al-Zawiya massacres"
            ],
            [
                "2012Jan–AprMay–AugSep–Dec",
                "January al-Midan bombingBattle of RastanFirst Battle of IdlibBattle of al-QusayrIdlib Governorate operation (Apr)Battle of TaftanazMay Battle of RastanHoula massacreBattle of al-HaffahAl-Qubeir massacreBattle of TremsehBattle of Damascus18 July 2012 Damascus bombingBattle of AleppoBattle of AnadanSiege of Base 46Al-Hasakah Governorate campaign (2012–2013)Rif Dimashq offensive (Aug-Oct)Darayya massacreBattle of Khirbet Al-JozBattle of Maarrat al-NumanFirst siege of Wadi DeifBattle of HaremRif Dimashq offensive (Nov 2012–Feb 2013)Battle of DarayyaAqrab massacreHama offensiveHalfaya massacreBattle of DarayyaQuneitra Governorate clashesTalbiseh bakery massacre"
            ],
            [
                "2013Jan–AprMay–Dec",
                "Battle of SafiraBattle of ShadadehDamascus offensiveRaqqa campaign (2012–2013)Battle of Raqqa (Mar)Daraa offensiveRif Dimashq offensive (Mar–Aug)Battle of Jdaidet al-FadlGhouta chemical attackAl-Qusayr offensiveBattle of al-QusayrBayda and Baniyas massacresHama offensiveHatla massacreKhan al-Assal chemical attackKhan al-Assal massacreAdra massacreBattle of Ras al-AynBattle of Tell AbyadRif Dimashq offensive (Sep–Nov)Aleppo offensive (Oct–Dec)Battle of al-YaarubiyahBattle of Tell Hamis and Tell Brak (Dec–Jan)"
            ],
            [
                "2014Jan–JulAug–Dec",
                "First Inter-rebel conflictBattle of MarkadaDeir ez-Zor offensiveBattle of MorekDaraa offensive (Feb–May)Maan massacreAl-Otaiba ambushIdlib offensiveBattle of HosnLatakia OffensiveBattle of Al-MalihahKafr Zita chemical attackSecond siege of Wadi DeifQalamoun offensive (Jun–Aug)Battle of ArsalFirst Battle of the Shaer gas fieldEastern Syria offensiveBattle of Tabqa AirbaseNorthern Aleppo offensive (Feb–Jul)Hama OffensiveQuneitra offensiveRif Dimashq offensive (Aug–Nov)Siege of KobanîHoms school bombingDaraa offensive (Oct)Al-Safira offensiveIdlib RaidSecond Inter-Rebel ConflictSecond Battle of the Shaer gas fieldBattle of Al-Shaykh MaskinDeir ez-Zor offensive (Dec)"
            ],
            [
                "2015Jan–JulAug–Dec",
                "Air Force An-26 crashDaraa Offensive (Jan)Southern Syria OffensiveEastern al-Hasakah offensiveBattle of Sarrin (Mar–Apr)Battle of Sarrin (Jun–Jul)Battle of BosraIdlib OffensiveSecond Battle of IdlibBattle of Nasib Border CrossingBattle of Yarmouk CampWestern al-Hasakah offensivePalmyra offensive (May)Qamishli bombingsTell Abyad offensiveKobanî massacreQuneitra offensive (Jun)Palmyra offensive (Jul–Aug)Rif Dimashq offensive (Sep)Northwestern Syria offensive (Oct–Nov)Aleppo offensive (Oct–Dec)Al-Hawl offensiveHoms offensive (Nov-Dec)East Aleppo offensive (2015–2016)2015–2016 Latakia offensiveTishrin Dam offensiveRussian Sukhoi Su-24 shootdown"
            ],
            [
                "2016Jan–AprMay–AugSep–Dec",
                "Second Battle of Al-Shaykh MaskinDeir ez-Zor offensive (Jan)January Sayyidah Zaynab bombingsNorthern Aleppo offensive (Feb)Ithriyah-Raqqa offensive (Feb–Mar)Al-Shaddadi offensiveFebruary Homs bombingsFebruary Sayyidah Zaynab bombingsKhanasir offensiveBattle of Tel AbyadBattle of Maarrat al-NumanBattle of Qamishli (Apr)Northern Aleppo offensive (Mar–Jun)Palmyra offensive (Mar)East Ghouta inter-rebel conflict (Apr–May)Rif Dimashq offensive (Apr–May)Northern Raqqa offensive (May)May Jableh & Tartous bombingsIthriyah-Raqqa offensive (Jun)Rif Dimashq offensive (Jun–Oct)Manbij offensiveTokhar massacreSouthern Aleppo campaignBattle of al-Rai (Aug)Operation Euphrates ShieldAleppo summer campaignWestern al-Bab offensive (Sep)5 September bombingsSeptember Deir ez-Zor air raidSeptember Urum al-Kubra aid convoy attackAleppo offensive (Sep–Oct)Dabiq offensiveWestern al-Bab offensive (Oct–Nov)Khan al-Shih offensive (Oct–Nov)Raqqa campaignBattle of al-BabAleppo offensive (Nov-Dec)Palmyra offensive (Dec)"
            ],
            [
                "2017Jan–AprMay–AugSep–Dec",
                "Wadi Barada offensive (2016–2017)January Azaz bombingDesert campaign (Dec 16–Apr 17)Idlib clashes (Jan–Mar)Deir ez-Zor offensive (Jan–Feb)Daraa offensive (Feb–Jun)Southwestern Daraa offensive (Feb)Qaboun offensivePalmyra offensiveEast Aleppo offensive (Jan–Apr)March Damascus bombingsAl-Jinah airstrikeHama offensive (Mar–Apr)Battle of TabqaKhan Shaykhun chemical attackShayrat missile strikeAleppo bombingApril Turkish airstrikesEast Ghouta inter-rebel conflict (Apr–May)Desert campaign (May–Jul)Maskanah Plains offensiveEast Hama offensiveBattle of RaqqaDaraa offensive (Jun)Southern Raqqa offensive (Jun)Jobar offensive (Jun–Aug)Quneitra offensive (Jun)Idlib clashes (Jul)Central campaignQalamoun (Jul–Aug)Deir ez-Zor offensive (Sep 17–Mar 18)Hama offensive (Sep)Northwestern campaign (Oct 17–Feb 18)Turkish military operation in Idlib GovernorateBattle of HarastaEastern campaign (Sep–Dec)Euphrates Crossing offensiveMayadin offensiveBattle of Deir ez-Zor (Sep–Nov)Abu Kamal offensiveBeit Jinn offensive"
            ],
            [
                "2018Jan–AprMay–AugSep–Dec",
                "Operation Olive BranchBattle of KhashamRif Dimashq offensive (Feb–Apr)Southern Damascus offensive (Jan–Feb)Syrian Liberation Front–Tahrir al-Sham conflictSouthern Damascus offensive (Mar)Douma chemical attackMissile strikes (Apr)Northern Homs offensive (Apr–May)Eastern Qalamoun offensive (Apr)Southern Damascus offensive (Apr–May)Deir ez-Zor clashes (Apr)Deir ez-Zor offensive (May–Jun)As-Suwayda offensive (Jun)Southern offensiveAs-Suwayda attacksAs-Suwayda (Aug-Nov)Qamishli clashes (Sep)Missile strikes (Sep)Northern border clashes"
            ],
            [
                "2019Jan–AprMay–AugSep–Dec",
                "Idlib inter-rebel conflictManbij bombingBattle of Baghuz FawqaniISIL insurgency in Deir-ez-ZorDêrik prison escape attemptTell Rifaat clashesNorthwestern offensive (Apr–Aug)June bombingsHass refugee camp bombingMissile strikes (Aug)Turkish offensive into northeastBarisha raidNovember bombingsIsraeli missile strikes (Nov)Qah missile strikeNorthwestern offensive (Dec 19–Mar 20)US airstrikes"
            ],
            [
                "2020Jan–Dec",
                "COVID-19 pandemicAfrin bombingIdlib Governorate clashesKafr-Takharim airstrikeAyn Issa clashesDeir ez-Zor ambush"
            ],
            [
                "2021Jan–Dec",
                "Siege of Qamishli and Al-HasakahMissile strikes (Jan)US airstrike (Feb)Battle of Qamishli (Apr)US airstrike (Jun)Daraa clashesTahrir al-Sham–Junud al-Sham conflict"
            ],
            [
                "2022Jan–Dec",
                "Battle of al-HasakahAhrar al-Sham–Levant Front clashesJabal al-Bishrī clashesJarqli airstrikesNorthern Aleppo clashes (Oct)Operation Claw-SwordNorthwest clashes (Dec)"
            ],
            [
                "2023Jan-Dec",
                "Al-Sukhnah attackDamascus airstrikeHama attackNorthern border clashes"
            ],
            [
                "2024Jan–OctNov–present",
                "Opposition offensivesDeir ez-Zor offensiveBattle of AleppoAleppo University Hospital airstrikeSouthern offensiveOperation Dawn of FreedomManbij offensiveAl-Mustariha strikeKobani clashesHama offensiveHoms offensivePalmyra offensiveFall of DamascusFall of the Assad regimeWestern Syria clashesMassacres of Syrian AlawitesHezbollah-Syria clashesJaramana clashesLebanon–Syria border clashesRif Dimashq clashesMassacres of Syrian DruzeIsraeli invasion"
            ],
            [
                "Spillover",
                "Israel and Golan Heights:March 2017 incidentFebruary 2018 incidentMay 2018 Israel–Iran incidentsIraq:Akashat ambushOperation al-ShabahApril 2014 Iraqi border airstrikeJordanian border incidentsApril 2014 Jordanian border airstrikeLebanon:Lebanese border clashesBattle of SidonIranian embassy bombing in BeirutNorth Lebanon clashesQalamoun (Jul–Aug 2017)Turkey:December 2011 Turkish border clash2012 Turkish F-4 Phantom shootdown2012 Turkish border clashes2013 Reyhanlı car bombingsJanuary 2014 Turkish attack in SyriaAssassination of Andrei KarlovRussian Air Force Al-Bab incident2020 Balyun airstrikesOperation Spring ShieldElsewhere:Deir ez-Zor missile strike(Iran)",
                "Israel and Golan Heights:",
                "March 2017 incidentFebruary 2018 incidentMay 2018 Israel–Iran incidents",
                "Iraq:",
                "Akashat ambushOperation al-ShabahApril 2014 Iraqi border airstrike",
                "Jordanian border incidents",
                "April 2014 Jordanian border airstrike",
                "Lebanon:",
                "Lebanese border clashesBattle of SidonIranian embassy bombing in BeirutNorth Lebanon clashesQalamoun (Jul–Aug 2017)",
                "Turkey:",
                "December 2011 Turkish border clash2012 Turkish F-4 Phantom shootdown2012 Turkish border clashes2013 Reyhanlı car bombingsJanuary 2014 Turkish attack in SyriaAssassination of Andrei KarlovRussian Air Force Al-Bab incident2020 Balyun airstrikesOperation Spring Shield",
                "Elsewhere:",
                "Deir ez-Zor missile strike(Iran)"
            ],
            [
                "Israel and Golan Heights:",
                "March 2017 incidentFebruary 2018 incidentMay 2018 Israel–Iran incidents"
            ],
            [
                "Iraq:",
                "Akashat ambushOperation al-ShabahApril 2014 Iraqi border airstrike"
            ],
            [
                "Jordanian border incidents",
                "April 2014 Jordanian border airstrike"
            ],
            [
                "Lebanon:",
                "Lebanese border clashesBattle of SidonIranian embassy bombing in BeirutNorth Lebanon clashesQalamoun (Jul–Aug 2017)"
            ],
            [
                "Turkey:",
                "December 2011 Turkish border clash2012 Turkish F-4 Phantom shootdown2012 Turkish border clashes2013 Reyhanlı car bombingsJanuary 2014 Turkish attack in SyriaAssassination of Andrei KarlovRussian Air Force Al-Bab incident2020 Balyun airstrikesOperation Spring Shield"
            ],
            [
                "Elsewhere:",
                "Deir ez-Zor missile strike(Iran)"
            ],
            [
                "BelligerentsBa'athist regimePolitics of Ba'athist SyriaArab Socialist Ba'ath Party – Syria RegionBa'ath BrigadesSyrian Social Nationalist PartyArab Socialist MovementSyrian Communist PartySyrian Communist Party (Unified)Military and militiasLions of HusseinGuardians of the DawnArab Nationalist GuardJaysh al-MuwahhidinSootoroBa'ath BrigadesNational Defence ForcesPopular CommitteesGolan RegimentSyrian Armed ForcesEagles of the WhirlwindThe Islamic Resistance Front in SyriaMilitary Council for the Liberation of SyriaSyrian Popular ResistanceSyrian ResistancePopular Resistance of the Eastern RegionPFLP-GCJihad Jibril BrigadesGalilee ForcesFree Palestine MovementPalestinian People's PartyLiwa FatemiyounAs-Sa'iqaal-Quds BrigadePalestine Liberation ArmyForeign supportHezbollah involvementIranian involvementLiwa FatemiyounRussian involvementmedical facility targetingmilitary interventionWagner GroupRussia–Syria–Iran–Iraq coalitionPopular Mobilization ForcesOppositionInterim governmentNational CoalitionLocal Coordination CommitteesSyrian National CouncilSupreme Council of the Syrian RevolutionNational Coordination Committee for Democratic ChangeSyrian Revolution General CommissionSyrian Support GroupAdopt a RevolutionSyrian Patriotic GroupOpposition militiasSyrian National ArmyFree Syrian ArmyNational Front for LiberationArmy of GloryAuthenticity and Development FrontArmy of Free TribesRevolutionary Commando ArmyMuslim Brotherhood in SyriaGrey WolvesForeign supportUS interventionJordanian interventionQatarSaudi ArabiaTurkeyAutonomous Administrationof North and East SyriaDFNS GovernmentDemocratic Union PartyKurdish National CouncilSmaller political partiesSDF militiasPeople's Protection UnitsWomen's Protection UnitsAnti-Terror UnitsAl-Sanadid ForcesArmy of RevolutionariesSDF military councilsSyriac Military CouncilLiwa Thuwar al-RaqqaNorthern Democratic BrigadeSupportPatriotic Union of KurdistanKurdistan Workers' PartyInternational Freedom BattalionSinjar Resistance UnitsÊzîdxan Women's UnitsIslamistsIslamic StateMilitary activity of ISILDokumacılarAl-BarakahKhalid ibn al-Walid ArmyYarmouk Martyrs BrigadeIslamic Muthanna MovementJaysh al-JihadJund al-AqsaGroup of the One and OnlyLiwa DawudLiwa Aqab al-IslamiKatibah NusantaraKatiba al-Bittar al-LibiAl-Khansaa Brigadeal-Qaedaand alliesAl-Nusra Front(Jabhat Fatah al-Sham(Khorasan group,Suqour al-Ezz)Jaysh Muhammad in Bilad al-ShamTahrir al-ShamTurkistan Islamic Party in SyriaCaucasus EmirateAjnad al-KavkazJunud al-MakhdiRouse the Believers Operations Room(Ansar al-Tawhid(Firqat al-Ghuraba),Hurras al-Din,Ansar al-Din Front(Harakat Sham al-Islam),Ansar al-Islam in Kurdistan)Jaish al-HaramounJaysh al-SunnaLiwa al-Muhajireen wal-Ansar(Green Battalion)Mujahideen Shura CouncilMalhama TacticalKatibat al-Tawhid wal-JihadKatibat Jabal al-IslamJama'at Ansar al-Furqan in Bilad al ShamGhuraba al-ShamTaliban(Pakistani Taliban,Imam Bukhari Jamaat)Fatah al-IslamMuhajirin wa-Ansar Alliance(Liwaa al-Umma)",
                "Belligerents",
                "Ba'athist regimePolitics of Ba'athist SyriaArab Socialist Ba'ath Party – Syria RegionBa'ath BrigadesSyrian Social Nationalist PartyArab Socialist MovementSyrian Communist PartySyrian Communist Party (Unified)Military and militiasLions of HusseinGuardians of the DawnArab Nationalist GuardJaysh al-MuwahhidinSootoroBa'ath BrigadesNational Defence ForcesPopular CommitteesGolan RegimentSyrian Armed ForcesEagles of the WhirlwindThe Islamic Resistance Front in SyriaMilitary Council for the Liberation of SyriaSyrian Popular ResistanceSyrian ResistancePopular Resistance of the Eastern RegionPFLP-GCJihad Jibril BrigadesGalilee ForcesFree Palestine MovementPalestinian People's PartyLiwa FatemiyounAs-Sa'iqaal-Quds BrigadePalestine Liberation ArmyForeign supportHezbollah involvementIranian involvementLiwa FatemiyounRussian involvementmedical facility targetingmilitary interventionWagner GroupRussia–Syria–Iran–Iraq coalitionPopular Mobilization ForcesOppositionInterim governmentNational CoalitionLocal Coordination CommitteesSyrian National CouncilSupreme Council of the Syrian RevolutionNational Coordination Committee for Democratic ChangeSyrian Revolution General CommissionSyrian Support GroupAdopt a RevolutionSyrian Patriotic GroupOpposition militiasSyrian National ArmyFree Syrian ArmyNational Front for LiberationArmy of GloryAuthenticity and Development FrontArmy of Free TribesRevolutionary Commando ArmyMuslim Brotherhood in SyriaGrey WolvesForeign supportUS interventionJordanian interventionQatarSaudi ArabiaTurkeyAutonomous Administrationof North and East SyriaDFNS GovernmentDemocratic Union PartyKurdish National CouncilSmaller political partiesSDF militiasPeople's Protection UnitsWomen's Protection UnitsAnti-Terror UnitsAl-Sanadid ForcesArmy of RevolutionariesSDF military councilsSyriac Military CouncilLiwa Thuwar al-RaqqaNorthern Democratic BrigadeSupportPatriotic Union of KurdistanKurdistan Workers' PartyInternational Freedom BattalionSinjar Resistance UnitsÊzîdxan Women's UnitsIslamistsIslamic StateMilitary activity of ISILDokumacılarAl-BarakahKhalid ibn al-Walid ArmyYarmouk Martyrs BrigadeIslamic Muthanna MovementJaysh al-JihadJund al-AqsaGroup of the One and OnlyLiwa DawudLiwa Aqab al-IslamiKatibah NusantaraKatiba al-Bittar al-LibiAl-Khansaa Brigadeal-Qaedaand alliesAl-Nusra Front(Jabhat Fatah al-Sham(Khorasan group,Suqour al-Ezz)Jaysh Muhammad in Bilad al-ShamTahrir al-ShamTurkistan Islamic Party in SyriaCaucasus EmirateAjnad al-KavkazJunud al-MakhdiRouse the Believers Operations Room(Ansar al-Tawhid(Firqat al-Ghuraba),Hurras al-Din,Ansar al-Din Front(Harakat Sham al-Islam),Ansar al-Islam in Kurdistan)Jaish al-HaramounJaysh al-SunnaLiwa al-Muhajireen wal-Ansar(Green Battalion)Mujahideen Shura CouncilMalhama TacticalKatibat al-Tawhid wal-JihadKatibat Jabal al-IslamJama'at Ansar al-Furqan in Bilad al ShamGhuraba al-ShamTaliban(Pakistani Taliban,Imam Bukhari Jamaat)Fatah al-IslamMuhajirin wa-Ansar Alliance(Liwaa al-Umma)",
                "Ba'athist regime",
                "Politics of Ba'athist SyriaArab Socialist Ba'ath Party – Syria RegionBa'ath BrigadesSyrian Social Nationalist PartyArab Socialist MovementSyrian Communist PartySyrian Communist Party (Unified)Military and militiasLions of HusseinGuardians of the DawnArab Nationalist GuardJaysh al-MuwahhidinSootoroBa'ath BrigadesNational Defence ForcesPopular CommitteesGolan RegimentSyrian Armed ForcesEagles of the WhirlwindThe Islamic Resistance Front in SyriaMilitary Council for the Liberation of SyriaSyrian Popular ResistanceSyrian ResistancePopular Resistance of the Eastern RegionPFLP-GCJihad Jibril BrigadesGalilee ForcesFree Palestine MovementPalestinian People's PartyLiwa FatemiyounAs-Sa'iqaal-Quds BrigadePalestine Liberation ArmyForeign supportHezbollah involvementIranian involvementLiwa FatemiyounRussian involvementmedical facility targetingmilitary interventionWagner GroupRussia–Syria–Iran–Iraq coalitionPopular Mobilization Forces",
                "Politics of Ba'athist Syria",
                "Arab Socialist Ba'ath Party – Syria RegionBa'ath BrigadesSyrian Social Nationalist PartyArab Socialist MovementSyrian Communist PartySyrian Communist Party (Unified)",
                "Military and militias",
                "Lions of HusseinGuardians of the DawnArab Nationalist GuardJaysh al-MuwahhidinSootoroBa'ath BrigadesNational Defence ForcesPopular CommitteesGolan RegimentSyrian Armed ForcesEagles of the WhirlwindThe Islamic Resistance Front in SyriaMilitary Council for the Liberation of SyriaSyrian Popular ResistanceSyrian ResistancePopular Resistance of the Eastern RegionPFLP-GCJihad Jibril BrigadesGalilee ForcesFree Palestine MovementPalestinian People's PartyLiwa FatemiyounAs-Sa'iqaal-Quds BrigadePalestine Liberation Army",
                "Foreign support",
                "Hezbollah involvementIranian involvementLiwa FatemiyounRussian involvementmedical facility targetingmilitary interventionWagner GroupRussia–Syria–Iran–Iraq coalitionPopular Mobilization Forces",
                "Opposition",
                "Interim governmentNational CoalitionLocal Coordination CommitteesSyrian National CouncilSupreme Council of the Syrian RevolutionNational Coordination Committee for Democratic ChangeSyrian Revolution General CommissionSyrian Support GroupAdopt a RevolutionSyrian Patriotic GroupOpposition militiasSyrian National ArmyFree Syrian ArmyNational Front for LiberationArmy of GloryAuthenticity and Development FrontArmy of Free TribesRevolutionary Commando ArmyMuslim Brotherhood in SyriaGrey WolvesForeign supportUS interventionJordanian interventionQatarSaudi ArabiaTurkey",
                "Interim government",
                "National CoalitionLocal Coordination CommitteesSyrian National CouncilSupreme Council of the Syrian RevolutionNational Coordination Committee for Democratic ChangeSyrian Revolution General CommissionSyrian Support GroupAdopt a RevolutionSyrian Patriotic Group",
                "Opposition militias",
                "Syrian National ArmyFree Syrian ArmyNational Front for LiberationArmy of GloryAuthenticity and Development FrontArmy of Free TribesRevolutionary Commando ArmyMuslim Brotherhood in SyriaGrey Wolves",
                "Foreign support",
                "US interventionJordanian interventionQatarSaudi ArabiaTurkey",
                "Autonomous Administrationof North and East Syria",
                "DFNS GovernmentDemocratic Union PartyKurdish National CouncilSmaller political partiesSDF militiasPeople's Protection UnitsWomen's Protection UnitsAnti-Terror UnitsAl-Sanadid ForcesArmy of RevolutionariesSDF military councilsSyriac Military CouncilLiwa Thuwar al-RaqqaNorthern Democratic BrigadeSupportPatriotic Union of KurdistanKurdistan Workers' PartyInternational Freedom BattalionSinjar Resistance UnitsÊzîdxan Women's Units",
                "DFNS Government",
                "Democratic Union PartyKurdish National CouncilSmaller political parties",
                "SDF militias",
                "People's Protection UnitsWomen's Protection UnitsAnti-Terror UnitsAl-Sanadid ForcesArmy of RevolutionariesSDF military councilsSyriac Military CouncilLiwa Thuwar al-RaqqaNorthern Democratic Brigade",
                "Support",
                "Patriotic Union of KurdistanKurdistan Workers' PartyInternational Freedom BattalionSinjar Resistance UnitsÊzîdxan Women's Units",
                "Islamists",
                "Islamic StateMilitary activity of ISILDokumacılarAl-BarakahKhalid ibn al-Walid ArmyYarmouk Martyrs BrigadeIslamic Muthanna MovementJaysh al-JihadJund al-AqsaGroup of the One and OnlyLiwa DawudLiwa Aqab al-IslamiKatibah NusantaraKatiba al-Bittar al-LibiAl-Khansaa Brigadeal-Qaedaand alliesAl-Nusra Front(Jabhat Fatah al-Sham(Khorasan group,Suqour al-Ezz)Jaysh Muhammad in Bilad al-ShamTahrir al-ShamTurkistan Islamic Party in SyriaCaucasus EmirateAjnad al-KavkazJunud al-MakhdiRouse the Believers Operations Room(Ansar al-Tawhid(Firqat al-Ghuraba),Hurras al-Din,Ansar al-Din Front(Harakat Sham al-Islam),Ansar al-Islam in Kurdistan)Jaish al-HaramounJaysh al-SunnaLiwa al-Muhajireen wal-Ansar(Green Battalion)Mujahideen Shura CouncilMalhama TacticalKatibat al-Tawhid wal-JihadKatibat Jabal al-IslamJama'at Ansar al-Furqan in Bilad al ShamGhuraba al-ShamTaliban(Pakistani Taliban,Imam Bukhari Jamaat)Fatah al-IslamMuhajirin wa-Ansar Alliance(Liwaa al-Umma)",
                "Islamic State",
                "Military activity of ISILDokumacılarAl-BarakahKhalid ibn al-Walid ArmyYarmouk Martyrs BrigadeIslamic Muthanna MovementJaysh al-JihadJund al-AqsaGroup of the One and OnlyLiwa DawudLiwa Aqab al-IslamiKatibah NusantaraKatiba al-Bittar al-LibiAl-Khansaa Brigade",
                "al-Qaedaand allies",
                "Al-Nusra Front(Jabhat Fatah al-Sham(Khorasan group,Suqour al-Ezz)Jaysh Muhammad in Bilad al-ShamTahrir al-ShamTurkistan Islamic Party in SyriaCaucasus EmirateAjnad al-KavkazJunud al-MakhdiRouse the Believers Operations Room(Ansar al-Tawhid(Firqat al-Ghuraba),Hurras al-Din,Ansar al-Din Front(Harakat Sham al-Islam),Ansar al-Islam in Kurdistan)Jaish al-HaramounJaysh al-SunnaLiwa al-Muhajireen wal-Ansar(Green Battalion)Mujahideen Shura CouncilMalhama TacticalKatibat al-Tawhid wal-JihadKatibat Jabal al-IslamJama'at Ansar al-Furqan in Bilad al ShamGhuraba al-ShamTaliban(Pakistani Taliban,Imam Bukhari Jamaat)Fatah al-IslamMuhajirin wa-Ansar Alliance(Liwaa al-Umma)"
            ],
            {
                "vteSyrian civil war": "Belligerents"
            },
            [
                "Ba'athist regimePolitics of Ba'athist SyriaArab Socialist Ba'ath Party – Syria RegionBa'ath BrigadesSyrian Social Nationalist PartyArab Socialist MovementSyrian Communist PartySyrian Communist Party (Unified)Military and militiasLions of HusseinGuardians of the DawnArab Nationalist GuardJaysh al-MuwahhidinSootoroBa'ath BrigadesNational Defence ForcesPopular CommitteesGolan RegimentSyrian Armed ForcesEagles of the WhirlwindThe Islamic Resistance Front in SyriaMilitary Council for the Liberation of SyriaSyrian Popular ResistanceSyrian ResistancePopular Resistance of the Eastern RegionPFLP-GCJihad Jibril BrigadesGalilee ForcesFree Palestine MovementPalestinian People's PartyLiwa FatemiyounAs-Sa'iqaal-Quds BrigadePalestine Liberation ArmyForeign supportHezbollah involvementIranian involvementLiwa FatemiyounRussian involvementmedical facility targetingmilitary interventionWagner GroupRussia–Syria–Iran–Iraq coalitionPopular Mobilization ForcesOppositionInterim governmentNational CoalitionLocal Coordination CommitteesSyrian National CouncilSupreme Council of the Syrian RevolutionNational Coordination Committee for Democratic ChangeSyrian Revolution General CommissionSyrian Support GroupAdopt a RevolutionSyrian Patriotic GroupOpposition militiasSyrian National ArmyFree Syrian ArmyNational Front for LiberationArmy of GloryAuthenticity and Development FrontArmy of Free TribesRevolutionary Commando ArmyMuslim Brotherhood in SyriaGrey WolvesForeign supportUS interventionJordanian interventionQatarSaudi ArabiaTurkeyAutonomous Administrationof North and East SyriaDFNS GovernmentDemocratic Union PartyKurdish National CouncilSmaller political partiesSDF militiasPeople's Protection UnitsWomen's Protection UnitsAnti-Terror UnitsAl-Sanadid ForcesArmy of RevolutionariesSDF military councilsSyriac Military CouncilLiwa Thuwar al-RaqqaNorthern Democratic BrigadeSupportPatriotic Union of KurdistanKurdistan Workers' PartyInternational Freedom BattalionSinjar Resistance UnitsÊzîdxan Women's UnitsIslamistsIslamic StateMilitary activity of ISILDokumacılarAl-BarakahKhalid ibn al-Walid ArmyYarmouk Martyrs BrigadeIslamic Muthanna MovementJaysh al-JihadJund al-AqsaGroup of the One and OnlyLiwa DawudLiwa Aqab al-IslamiKatibah NusantaraKatiba al-Bittar al-LibiAl-Khansaa Brigadeal-Qaedaand alliesAl-Nusra Front(Jabhat Fatah al-Sham(Khorasan group,Suqour al-Ezz)Jaysh Muhammad in Bilad al-ShamTahrir al-ShamTurkistan Islamic Party in SyriaCaucasus EmirateAjnad al-KavkazJunud al-MakhdiRouse the Believers Operations Room(Ansar al-Tawhid(Firqat al-Ghuraba),Hurras al-Din,Ansar al-Din Front(Harakat Sham al-Islam),Ansar al-Islam in Kurdistan)Jaish al-HaramounJaysh al-SunnaLiwa al-Muhajireen wal-Ansar(Green Battalion)Mujahideen Shura CouncilMalhama TacticalKatibat al-Tawhid wal-JihadKatibat Jabal al-IslamJama'at Ansar al-Furqan in Bilad al ShamGhuraba al-ShamTaliban(Pakistani Taliban,Imam Bukhari Jamaat)Fatah al-IslamMuhajirin wa-Ansar Alliance(Liwaa al-Umma)",
                "Ba'athist regime",
                "Politics of Ba'athist SyriaArab Socialist Ba'ath Party – Syria RegionBa'ath BrigadesSyrian Social Nationalist PartyArab Socialist MovementSyrian Communist PartySyrian Communist Party (Unified)Military and militiasLions of HusseinGuardians of the DawnArab Nationalist GuardJaysh al-MuwahhidinSootoroBa'ath BrigadesNational Defence ForcesPopular CommitteesGolan RegimentSyrian Armed ForcesEagles of the WhirlwindThe Islamic Resistance Front in SyriaMilitary Council for the Liberation of SyriaSyrian Popular ResistanceSyrian ResistancePopular Resistance of the Eastern RegionPFLP-GCJihad Jibril BrigadesGalilee ForcesFree Palestine MovementPalestinian People's PartyLiwa FatemiyounAs-Sa'iqaal-Quds BrigadePalestine Liberation ArmyForeign supportHezbollah involvementIranian involvementLiwa FatemiyounRussian involvementmedical facility targetingmilitary interventionWagner GroupRussia–Syria–Iran–Iraq coalitionPopular Mobilization Forces",
                "Politics of Ba'athist Syria",
                "Arab Socialist Ba'ath Party – Syria RegionBa'ath BrigadesSyrian Social Nationalist PartyArab Socialist MovementSyrian Communist PartySyrian Communist Party (Unified)",
                "Military and militias",
                "Lions of HusseinGuardians of the DawnArab Nationalist GuardJaysh al-MuwahhidinSootoroBa'ath BrigadesNational Defence ForcesPopular CommitteesGolan RegimentSyrian Armed ForcesEagles of the WhirlwindThe Islamic Resistance Front in SyriaMilitary Council for the Liberation of SyriaSyrian Popular ResistanceSyrian ResistancePopular Resistance of the Eastern RegionPFLP-GCJihad Jibril BrigadesGalilee ForcesFree Palestine MovementPalestinian People's PartyLiwa FatemiyounAs-Sa'iqaal-Quds BrigadePalestine Liberation Army",
                "Foreign support",
                "Hezbollah involvementIranian involvementLiwa FatemiyounRussian involvementmedical facility targetingmilitary interventionWagner GroupRussia–Syria–Iran–Iraq coalitionPopular Mobilization Forces",
                "Opposition",
                "Interim governmentNational CoalitionLocal Coordination CommitteesSyrian National CouncilSupreme Council of the Syrian RevolutionNational Coordination Committee for Democratic ChangeSyrian Revolution General CommissionSyrian Support GroupAdopt a RevolutionSyrian Patriotic GroupOpposition militiasSyrian National ArmyFree Syrian ArmyNational Front for LiberationArmy of GloryAuthenticity and Development FrontArmy of Free TribesRevolutionary Commando ArmyMuslim Brotherhood in SyriaGrey WolvesForeign supportUS interventionJordanian interventionQatarSaudi ArabiaTurkey",
                "Interim government",
                "National CoalitionLocal Coordination CommitteesSyrian National CouncilSupreme Council of the Syrian RevolutionNational Coordination Committee for Democratic ChangeSyrian Revolution General CommissionSyrian Support GroupAdopt a RevolutionSyrian Patriotic Group",
                "Opposition militias",
                "Syrian National ArmyFree Syrian ArmyNational Front for LiberationArmy of GloryAuthenticity and Development FrontArmy of Free TribesRevolutionary Commando ArmyMuslim Brotherhood in SyriaGrey Wolves",
                "Foreign support",
                "US interventionJordanian interventionQatarSaudi ArabiaTurkey",
                "Autonomous Administrationof North and East Syria",
                "DFNS GovernmentDemocratic Union PartyKurdish National CouncilSmaller political partiesSDF militiasPeople's Protection UnitsWomen's Protection UnitsAnti-Terror UnitsAl-Sanadid ForcesArmy of RevolutionariesSDF military councilsSyriac Military CouncilLiwa Thuwar al-RaqqaNorthern Democratic BrigadeSupportPatriotic Union of KurdistanKurdistan Workers' PartyInternational Freedom BattalionSinjar Resistance UnitsÊzîdxan Women's Units",
                "DFNS Government",
                "Democratic Union PartyKurdish National CouncilSmaller political parties",
                "SDF militias",
                "People's Protection UnitsWomen's Protection UnitsAnti-Terror UnitsAl-Sanadid ForcesArmy of RevolutionariesSDF military councilsSyriac Military CouncilLiwa Thuwar al-RaqqaNorthern Democratic Brigade",
                "Support",
                "Patriotic Union of KurdistanKurdistan Workers' PartyInternational Freedom BattalionSinjar Resistance UnitsÊzîdxan Women's Units",
                "Islamists",
                "Islamic StateMilitary activity of ISILDokumacılarAl-BarakahKhalid ibn al-Walid ArmyYarmouk Martyrs BrigadeIslamic Muthanna MovementJaysh al-JihadJund al-AqsaGroup of the One and OnlyLiwa DawudLiwa Aqab al-IslamiKatibah NusantaraKatiba al-Bittar al-LibiAl-Khansaa Brigadeal-Qaedaand alliesAl-Nusra Front(Jabhat Fatah al-Sham(Khorasan group,Suqour al-Ezz)Jaysh Muhammad in Bilad al-ShamTahrir al-ShamTurkistan Islamic Party in SyriaCaucasus EmirateAjnad al-KavkazJunud al-MakhdiRouse the Believers Operations Room(Ansar al-Tawhid(Firqat al-Ghuraba),Hurras al-Din,Ansar al-Din Front(Harakat Sham al-Islam),Ansar al-Islam in Kurdistan)Jaish al-HaramounJaysh al-SunnaLiwa al-Muhajireen wal-Ansar(Green Battalion)Mujahideen Shura CouncilMalhama TacticalKatibat al-Tawhid wal-JihadKatibat Jabal al-IslamJama'at Ansar al-Furqan in Bilad al ShamGhuraba al-ShamTaliban(Pakistani Taliban,Imam Bukhari Jamaat)Fatah al-IslamMuhajirin wa-Ansar Alliance(Liwaa al-Umma)",
                "Islamic State",
                "Military activity of ISILDokumacılarAl-BarakahKhalid ibn al-Walid ArmyYarmouk Martyrs BrigadeIslamic Muthanna MovementJaysh al-JihadJund al-AqsaGroup of the One and OnlyLiwa DawudLiwa Aqab al-IslamiKatibah NusantaraKatiba al-Bittar al-LibiAl-Khansaa Brigade",
                "al-Qaedaand allies",
                "Al-Nusra Front(Jabhat Fatah al-Sham(Khorasan group,Suqour al-Ezz)Jaysh Muhammad in Bilad al-ShamTahrir al-ShamTurkistan Islamic Party in SyriaCaucasus EmirateAjnad al-KavkazJunud al-MakhdiRouse the Believers Operations Room(Ansar al-Tawhid(Firqat al-Ghuraba),Hurras al-Din,Ansar al-Din Front(Harakat Sham al-Islam),Ansar al-Islam in Kurdistan)Jaish al-HaramounJaysh al-SunnaLiwa al-Muhajireen wal-Ansar(Green Battalion)Mujahideen Shura CouncilMalhama TacticalKatibat al-Tawhid wal-JihadKatibat Jabal al-IslamJama'at Ansar al-Furqan in Bilad al ShamGhuraba al-ShamTaliban(Pakistani Taliban,Imam Bukhari Jamaat)Fatah al-IslamMuhajirin wa-Ansar Alliance(Liwaa al-Umma)"
            ],
            [
                "Ba'athist regime",
                "Politics of Ba'athist SyriaArab Socialist Ba'ath Party – Syria RegionBa'ath BrigadesSyrian Social Nationalist PartyArab Socialist MovementSyrian Communist PartySyrian Communist Party (Unified)Military and militiasLions of HusseinGuardians of the DawnArab Nationalist GuardJaysh al-MuwahhidinSootoroBa'ath BrigadesNational Defence ForcesPopular CommitteesGolan RegimentSyrian Armed ForcesEagles of the WhirlwindThe Islamic Resistance Front in SyriaMilitary Council for the Liberation of SyriaSyrian Popular ResistanceSyrian ResistancePopular Resistance of the Eastern RegionPFLP-GCJihad Jibril BrigadesGalilee ForcesFree Palestine MovementPalestinian People's PartyLiwa FatemiyounAs-Sa'iqaal-Quds BrigadePalestine Liberation ArmyForeign supportHezbollah involvementIranian involvementLiwa FatemiyounRussian involvementmedical facility targetingmilitary interventionWagner GroupRussia–Syria–Iran–Iraq coalitionPopular Mobilization Forces",
                "Politics of Ba'athist Syria",
                "Arab Socialist Ba'ath Party – Syria RegionBa'ath BrigadesSyrian Social Nationalist PartyArab Socialist MovementSyrian Communist PartySyrian Communist Party (Unified)",
                "Military and militias",
                "Lions of HusseinGuardians of the DawnArab Nationalist GuardJaysh al-MuwahhidinSootoroBa'ath BrigadesNational Defence ForcesPopular CommitteesGolan RegimentSyrian Armed ForcesEagles of the WhirlwindThe Islamic Resistance Front in SyriaMilitary Council for the Liberation of SyriaSyrian Popular ResistanceSyrian ResistancePopular Resistance of the Eastern RegionPFLP-GCJihad Jibril BrigadesGalilee ForcesFree Palestine MovementPalestinian People's PartyLiwa FatemiyounAs-Sa'iqaal-Quds BrigadePalestine Liberation Army",
                "Foreign support",
                "Hezbollah involvementIranian involvementLiwa FatemiyounRussian involvementmedical facility targetingmilitary interventionWagner GroupRussia–Syria–Iran–Iraq coalitionPopular Mobilization Forces"
            ],
            [
                "Politics of Ba'athist Syria",
                "Arab Socialist Ba'ath Party – Syria RegionBa'ath BrigadesSyrian Social Nationalist PartyArab Socialist MovementSyrian Communist PartySyrian Communist Party (Unified)"
            ],
            [
                "Military and militias",
                "Lions of HusseinGuardians of the DawnArab Nationalist GuardJaysh al-MuwahhidinSootoroBa'ath BrigadesNational Defence ForcesPopular CommitteesGolan RegimentSyrian Armed ForcesEagles of the WhirlwindThe Islamic Resistance Front in SyriaMilitary Council for the Liberation of SyriaSyrian Popular ResistanceSyrian ResistancePopular Resistance of the Eastern RegionPFLP-GCJihad Jibril BrigadesGalilee ForcesFree Palestine MovementPalestinian People's PartyLiwa FatemiyounAs-Sa'iqaal-Quds BrigadePalestine Liberation Army"
            ],
            [
                "Foreign support",
                "Hezbollah involvementIranian involvementLiwa FatemiyounRussian involvementmedical facility targetingmilitary interventionWagner GroupRussia–Syria–Iran–Iraq coalitionPopular Mobilization Forces"
            ],
            [
                "Opposition",
                "Interim governmentNational CoalitionLocal Coordination CommitteesSyrian National CouncilSupreme Council of the Syrian RevolutionNational Coordination Committee for Democratic ChangeSyrian Revolution General CommissionSyrian Support GroupAdopt a RevolutionSyrian Patriotic GroupOpposition militiasSyrian National ArmyFree Syrian ArmyNational Front for LiberationArmy of GloryAuthenticity and Development FrontArmy of Free TribesRevolutionary Commando ArmyMuslim Brotherhood in SyriaGrey WolvesForeign supportUS interventionJordanian interventionQatarSaudi ArabiaTurkey",
                "Interim government",
                "National CoalitionLocal Coordination CommitteesSyrian National CouncilSupreme Council of the Syrian RevolutionNational Coordination Committee for Democratic ChangeSyrian Revolution General CommissionSyrian Support GroupAdopt a RevolutionSyrian Patriotic Group",
                "Opposition militias",
                "Syrian National ArmyFree Syrian ArmyNational Front for LiberationArmy of GloryAuthenticity and Development FrontArmy of Free TribesRevolutionary Commando ArmyMuslim Brotherhood in SyriaGrey Wolves",
                "Foreign support",
                "US interventionJordanian interventionQatarSaudi ArabiaTurkey"
            ],
            [
                "Interim government",
                "National CoalitionLocal Coordination CommitteesSyrian National CouncilSupreme Council of the Syrian RevolutionNational Coordination Committee for Democratic ChangeSyrian Revolution General CommissionSyrian Support GroupAdopt a RevolutionSyrian Patriotic Group"
            ],
            [
                "Opposition militias",
                "Syrian National ArmyFree Syrian ArmyNational Front for LiberationArmy of GloryAuthenticity and Development FrontArmy of Free TribesRevolutionary Commando ArmyMuslim Brotherhood in SyriaGrey Wolves"
            ],
            [
                "Foreign support",
                "US interventionJordanian interventionQatarSaudi ArabiaTurkey"
            ],
            [
                "Autonomous Administrationof North and East Syria",
                "DFNS GovernmentDemocratic Union PartyKurdish National CouncilSmaller political partiesSDF militiasPeople's Protection UnitsWomen's Protection UnitsAnti-Terror UnitsAl-Sanadid ForcesArmy of RevolutionariesSDF military councilsSyriac Military CouncilLiwa Thuwar al-RaqqaNorthern Democratic BrigadeSupportPatriotic Union of KurdistanKurdistan Workers' PartyInternational Freedom BattalionSinjar Resistance UnitsÊzîdxan Women's Units",
                "DFNS Government",
                "Democratic Union PartyKurdish National CouncilSmaller political parties",
                "SDF militias",
                "People's Protection UnitsWomen's Protection UnitsAnti-Terror UnitsAl-Sanadid ForcesArmy of RevolutionariesSDF military councilsSyriac Military CouncilLiwa Thuwar al-RaqqaNorthern Democratic Brigade",
                "Support",
                "Patriotic Union of KurdistanKurdistan Workers' PartyInternational Freedom BattalionSinjar Resistance UnitsÊzîdxan Women's Units"
            ],
            [
                "DFNS Government",
                "Democratic Union PartyKurdish National CouncilSmaller political parties"
            ],
            [
                "SDF militias",
                "People's Protection UnitsWomen's Protection UnitsAnti-Terror UnitsAl-Sanadid ForcesArmy of RevolutionariesSDF military councilsSyriac Military CouncilLiwa Thuwar al-RaqqaNorthern Democratic Brigade"
            ],
            [
                "Support",
                "Patriotic Union of KurdistanKurdistan Workers' PartyInternational Freedom BattalionSinjar Resistance UnitsÊzîdxan Women's Units"
            ],
            [
                "Islamists",
                "Islamic StateMilitary activity of ISILDokumacılarAl-BarakahKhalid ibn al-Walid ArmyYarmouk Martyrs BrigadeIslamic Muthanna MovementJaysh al-JihadJund al-AqsaGroup of the One and OnlyLiwa DawudLiwa Aqab al-IslamiKatibah NusantaraKatiba al-Bittar al-LibiAl-Khansaa Brigadeal-Qaedaand alliesAl-Nusra Front(Jabhat Fatah al-Sham(Khorasan group,Suqour al-Ezz)Jaysh Muhammad in Bilad al-ShamTahrir al-ShamTurkistan Islamic Party in SyriaCaucasus EmirateAjnad al-KavkazJunud al-MakhdiRouse the Believers Operations Room(Ansar al-Tawhid(Firqat al-Ghuraba),Hurras al-Din,Ansar al-Din Front(Harakat Sham al-Islam),Ansar al-Islam in Kurdistan)Jaish al-HaramounJaysh al-SunnaLiwa al-Muhajireen wal-Ansar(Green Battalion)Mujahideen Shura CouncilMalhama TacticalKatibat al-Tawhid wal-JihadKatibat Jabal al-IslamJama'at Ansar al-Furqan in Bilad al ShamGhuraba al-ShamTaliban(Pakistani Taliban,Imam Bukhari Jamaat)Fatah al-IslamMuhajirin wa-Ansar Alliance(Liwaa al-Umma)",
                "Islamic State",
                "Military activity of ISILDokumacılarAl-BarakahKhalid ibn al-Walid ArmyYarmouk Martyrs BrigadeIslamic Muthanna MovementJaysh al-JihadJund al-AqsaGroup of the One and OnlyLiwa DawudLiwa Aqab al-IslamiKatibah NusantaraKatiba al-Bittar al-LibiAl-Khansaa Brigade",
                "al-Qaedaand allies",
                "Al-Nusra Front(Jabhat Fatah al-Sham(Khorasan group,Suqour al-Ezz)Jaysh Muhammad in Bilad al-ShamTahrir al-ShamTurkistan Islamic Party in SyriaCaucasus EmirateAjnad al-KavkazJunud al-MakhdiRouse the Believers Operations Room(Ansar al-Tawhid(Firqat al-Ghuraba),Hurras al-Din,Ansar al-Din Front(Harakat Sham al-Islam),Ansar al-Islam in Kurdistan)Jaish al-HaramounJaysh al-SunnaLiwa al-Muhajireen wal-Ansar(Green Battalion)Mujahideen Shura CouncilMalhama TacticalKatibat al-Tawhid wal-JihadKatibat Jabal al-IslamJama'at Ansar al-Furqan in Bilad al ShamGhuraba al-ShamTaliban(Pakistani Taliban,Imam Bukhari Jamaat)Fatah al-IslamMuhajirin wa-Ansar Alliance(Liwaa al-Umma)"
            ],
            [
                "Islamic State",
                "Military activity of ISILDokumacılarAl-BarakahKhalid ibn al-Walid ArmyYarmouk Martyrs BrigadeIslamic Muthanna MovementJaysh al-JihadJund al-AqsaGroup of the One and OnlyLiwa DawudLiwa Aqab al-IslamiKatibah NusantaraKatiba al-Bittar al-LibiAl-Khansaa Brigade"
            ],
            [
                "al-Qaedaand allies",
                "Al-Nusra Front(Jabhat Fatah al-Sham(Khorasan group,Suqour al-Ezz)Jaysh Muhammad in Bilad al-ShamTahrir al-ShamTurkistan Islamic Party in SyriaCaucasus EmirateAjnad al-KavkazJunud al-MakhdiRouse the Believers Operations Room(Ansar al-Tawhid(Firqat al-Ghuraba),Hurras al-Din,Ansar al-Din Front(Harakat Sham al-Islam),Ansar al-Islam in Kurdistan)Jaish al-HaramounJaysh al-SunnaLiwa al-Muhajireen wal-Ansar(Green Battalion)Mujahideen Shura CouncilMalhama TacticalKatibat al-Tawhid wal-JihadKatibat Jabal al-IslamJama'at Ansar al-Furqan in Bilad al ShamGhuraba al-ShamTaliban(Pakistani Taliban,Imam Bukhari Jamaat)Fatah al-IslamMuhajirin wa-Ansar Alliance(Liwaa al-Umma)"
            ],
            [
                "PeopleAmmar AbdulhamidAli al-AbdallahAdnan al-Arooral-Assad familyBasharMaherRifaatRami MakhloufHafez MakhloufRiad al-AsaadHadi al-BahraAnwar al-BunniFahd Jassem al-FreijSuheil al-HassanHaitham al-MalehMoaz al-KhatibKamal al-LabwaniHamza al-KhateebTal al-MallohiFida al-SayedRiad al-TurkKhaled KhojaAmmar al-QurabiSuheir AtassiAli Sadreddine Al-BayanouniAref DalilaFarid GhadryBurhan GhaliounRazan GhazzawiGhassan HittoSalim IdrisRanda KassisAbdul Halim KhaddamMichel KiloBassma KodmaniAli Habib MahmudAli Mahmoud OthmanIbrahim QashoushDawoud RajihaYassin al-Haj SalehBouthaina ShaabanAhmed al-SharaaAbdulbaset SiedaRiad SeifFadwa SouleimaneMohamad Anas Haitham SoueidYaser TabbaraRazan ZaitounehRami JarrahAbdurrahman MustafaFadlallah al-Haji",
                "People",
                "Ammar AbdulhamidAli al-AbdallahAdnan al-Arooral-Assad familyBasharMaherRifaatRami MakhloufHafez MakhloufRiad al-AsaadHadi al-BahraAnwar al-BunniFahd Jassem al-FreijSuheil al-HassanHaitham al-MalehMoaz al-KhatibKamal al-LabwaniHamza al-KhateebTal al-MallohiFida al-SayedRiad al-TurkKhaled KhojaAmmar al-QurabiSuheir AtassiAli Sadreddine Al-BayanouniAref DalilaFarid GhadryBurhan GhaliounRazan GhazzawiGhassan HittoSalim IdrisRanda KassisAbdul Halim KhaddamMichel KiloBassma KodmaniAli Habib MahmudAli Mahmoud OthmanIbrahim QashoushDawoud RajihaYassin al-Haj SalehBouthaina ShaabanAhmed al-SharaaAbdulbaset SiedaRiad SeifFadwa SouleimaneMohamad Anas Haitham SoueidYaser TabbaraRazan ZaitounehRami JarrahAbdurrahman MustafaFadlallah al-Haji"
            ],
            {
                "vteSyrian civil war": "People"
            },
            {
                "vteSyrian civil war": "Ammar AbdulhamidAli al-AbdallahAdnan al-Arooral-Assad familyBasharMaherRifaatRami MakhloufHafez MakhloufRiad al-AsaadHadi al-BahraAnwar al-BunniFahd Jassem al-FreijSuheil al-HassanHaitham al-MalehMoaz al-KhatibKamal al-LabwaniHamza al-KhateebTal al-MallohiFida al-SayedRiad al-TurkKhaled KhojaAmmar al-QurabiSuheir AtassiAli Sadreddine Al-BayanouniAref DalilaFarid GhadryBurhan GhaliounRazan GhazzawiGhassan HittoSalim IdrisRanda KassisAbdul Halim KhaddamMichel KiloBassma KodmaniAli Habib MahmudAli Mahmoud OthmanIbrahim QashoushDawoud RajihaYassin al-Haj SalehBouthaina ShaabanAhmed al-SharaaAbdulbaset SiedaRiad SeifFadwa SouleimaneMohamad Anas Haitham SoueidYaser TabbaraRazan ZaitounehRami JarrahAbdurrahman MustafaFadlallah al-Haji"
            },
            [
                "RelatedElections2011 local elections2012 parliamentary election2014 presidential election2015 Northern local elections2016 parliamentary election2017 Northern local elections2017 Northern regional elections2018 local elections2020 parliamentary election2021 presidential electionIssuesCasualtiesCities and townsChemical weaponsDamaged heritage sitesForeign involvementHuman rights violationsHumanitarian aidInternational demonstrations and protestsInternational reactionsMassacresMass gravesRefugeesSectarianism and minoritiesStatus of the Golan HeightsSpillover in LebanonSyrian government reactionsPeace processArab League monitorsFriends of Syria GroupKofi Annan peace planUN supervision missionLakhdar Brahimi peace planU.S.–Russia peace proposals39th G8 summitUN Security Council Resolution 2118Geneva II conference2015 Zabadani cease-fire agreementVienna talks2016 Geneva talksIdlib demilitarization (2018–present)First Northern Syria Demilitarization DealSecond Northern Syria Demilitarization DealSyrian Negotiation CommissionSyrian Constitutional CommitteeInvestigations/legal casesInvestigationsInternational CommissionChemical weaponsWar crimes casesGermanyCanada + Netherlands vs SyriaRelated topicsExclusive mandateFourth Extraordinary Session of the Islamic Summit ConferenceSyria FilesSyrian detainee reportSyrian media coverage2015 European migrant crisisSyrian civil war in popular culture",
                "Related",
                "Elections2011 local elections2012 parliamentary election2014 presidential election2015 Northern local elections2016 parliamentary election2017 Northern local elections2017 Northern regional elections2018 local elections2020 parliamentary election2021 presidential electionIssuesCasualtiesCities and townsChemical weaponsDamaged heritage sitesForeign involvementHuman rights violationsHumanitarian aidInternational demonstrations and protestsInternational reactionsMassacresMass gravesRefugeesSectarianism and minoritiesStatus of the Golan HeightsSpillover in LebanonSyrian government reactionsPeace processArab League monitorsFriends of Syria GroupKofi Annan peace planUN supervision missionLakhdar Brahimi peace planU.S.–Russia peace proposals39th G8 summitUN Security Council Resolution 2118Geneva II conference2015 Zabadani cease-fire agreementVienna talks2016 Geneva talksIdlib demilitarization (2018–present)First Northern Syria Demilitarization DealSecond Northern Syria Demilitarization DealSyrian Negotiation CommissionSyrian Constitutional CommitteeInvestigations/legal casesInvestigationsInternational CommissionChemical weaponsWar crimes casesGermanyCanada + Netherlands vs SyriaRelated topicsExclusive mandateFourth Extraordinary Session of the Islamic Summit ConferenceSyria FilesSyrian detainee reportSyrian media coverage2015 European migrant crisisSyrian civil war in popular culture",
                "Elections",
                "2011 local elections2012 parliamentary election2014 presidential election2015 Northern local elections2016 parliamentary election2017 Northern local elections2017 Northern regional elections2018 local elections2020 parliamentary election2021 presidential election",
                "Issues",
                "CasualtiesCities and townsChemical weaponsDamaged heritage sitesForeign involvementHuman rights violationsHumanitarian aidInternational demonstrations and protestsInternational reactionsMassacresMass gravesRefugeesSectarianism and minoritiesStatus of the Golan HeightsSpillover in LebanonSyrian government reactions",
                "Peace process",
                "Arab League monitorsFriends of Syria GroupKofi Annan peace planUN supervision missionLakhdar Brahimi peace planU.S.–Russia peace proposals39th G8 summitUN Security Council Resolution 2118Geneva II conference2015 Zabadani cease-fire agreementVienna talks2016 Geneva talksIdlib demilitarization (2018–present)First Northern Syria Demilitarization DealSecond Northern Syria Demilitarization DealSyrian Negotiation CommissionSyrian Constitutional Committee",
                "Investigations/legal cases",
                "InvestigationsInternational CommissionChemical weaponsWar crimes casesGermanyCanada + Netherlands vs Syria",
                "Related topics",
                "Exclusive mandateFourth Extraordinary Session of the Islamic Summit ConferenceSyria FilesSyrian detainee reportSyrian media coverage2015 European migrant crisisSyrian civil war in popular culture"
            ],
            {
                "vteSyrian civil war": "Related"
            },
            [
                "Elections2011 local elections2012 parliamentary election2014 presidential election2015 Northern local elections2016 parliamentary election2017 Northern local elections2017 Northern regional elections2018 local elections2020 parliamentary election2021 presidential electionIssuesCasualtiesCities and townsChemical weaponsDamaged heritage sitesForeign involvementHuman rights violationsHumanitarian aidInternational demonstrations and protestsInternational reactionsMassacresMass gravesRefugeesSectarianism and minoritiesStatus of the Golan HeightsSpillover in LebanonSyrian government reactionsPeace processArab League monitorsFriends of Syria GroupKofi Annan peace planUN supervision missionLakhdar Brahimi peace planU.S.–Russia peace proposals39th G8 summitUN Security Council Resolution 2118Geneva II conference2015 Zabadani cease-fire agreementVienna talks2016 Geneva talksIdlib demilitarization (2018–present)First Northern Syria Demilitarization DealSecond Northern Syria Demilitarization DealSyrian Negotiation CommissionSyrian Constitutional CommitteeInvestigations/legal casesInvestigationsInternational CommissionChemical weaponsWar crimes casesGermanyCanada + Netherlands vs SyriaRelated topicsExclusive mandateFourth Extraordinary Session of the Islamic Summit ConferenceSyria FilesSyrian detainee reportSyrian media coverage2015 European migrant crisisSyrian civil war in popular culture",
                "Elections",
                "2011 local elections2012 parliamentary election2014 presidential election2015 Northern local elections2016 parliamentary election2017 Northern local elections2017 Northern regional elections2018 local elections2020 parliamentary election2021 presidential election",
                "Issues",
                "CasualtiesCities and townsChemical weaponsDamaged heritage sitesForeign involvementHuman rights violationsHumanitarian aidInternational demonstrations and protestsInternational reactionsMassacresMass gravesRefugeesSectarianism and minoritiesStatus of the Golan HeightsSpillover in LebanonSyrian government reactions",
                "Peace process",
                "Arab League monitorsFriends of Syria GroupKofi Annan peace planUN supervision missionLakhdar Brahimi peace planU.S.–Russia peace proposals39th G8 summitUN Security Council Resolution 2118Geneva II conference2015 Zabadani cease-fire agreementVienna talks2016 Geneva talksIdlib demilitarization (2018–present)First Northern Syria Demilitarization DealSecond Northern Syria Demilitarization DealSyrian Negotiation CommissionSyrian Constitutional Committee",
                "Investigations/legal cases",
                "InvestigationsInternational CommissionChemical weaponsWar crimes casesGermanyCanada + Netherlands vs Syria",
                "Related topics",
                "Exclusive mandateFourth Extraordinary Session of the Islamic Summit ConferenceSyria FilesSyrian detainee reportSyrian media coverage2015 European migrant crisisSyrian civil war in popular culture"
            ],
            [
                "Elections",
                "2011 local elections2012 parliamentary election2014 presidential election2015 Northern local elections2016 parliamentary election2017 Northern local elections2017 Northern regional elections2018 local elections2020 parliamentary election2021 presidential election"
            ],
            [
                "Issues",
                "CasualtiesCities and townsChemical weaponsDamaged heritage sitesForeign involvementHuman rights violationsHumanitarian aidInternational demonstrations and protestsInternational reactionsMassacresMass gravesRefugeesSectarianism and minoritiesStatus of the Golan HeightsSpillover in LebanonSyrian government reactions"
            ],
            [
                "Peace process",
                "Arab League monitorsFriends of Syria GroupKofi Annan peace planUN supervision missionLakhdar Brahimi peace planU.S.–Russia peace proposals39th G8 summitUN Security Council Resolution 2118Geneva II conference2015 Zabadani cease-fire agreementVienna talks2016 Geneva talksIdlib demilitarization (2018–present)First Northern Syria Demilitarization DealSecond Northern Syria Demilitarization DealSyrian Negotiation CommissionSyrian Constitutional Committee"
            ],
            [
                "Investigations/legal cases",
                "InvestigationsInternational CommissionChemical weaponsWar crimes casesGermanyCanada + Netherlands vs Syria"
            ],
            [
                "Related topics",
                "Exclusive mandateFourth Extraordinary Session of the Islamic Summit ConferenceSyria FilesSyrian detainee reportSyrian media coverage2015 European migrant crisisSyrian civil war in popular culture"
            ],
            {
                "vteSyrian civil war": "Category"
            }
        ]
    },
    {
        "heading": "References",
        "table": [
            [
                "Main overviewsSyriaRojavaSyrian civil warTimelineBackground and causesSyrian government reactionsBelligerentsInter-rebel conflictSpilloverCities and townsSectarianism and minoritiesSyrian Desert campaign (December 2017–present)2024 Syrian opposition offensivesFall of the Assad regimeEffects and ongoing concernsCasualties of the Syrian civil warRefugees of the Syrian civil warHumanitarian aid during the Syrian civil warHuman rights violations during the Syrian civil warPhases and processesSyrian revolutionEarly insurgency phase2012–2013 escalationCeasefiresSyrian peace processWorld reactionInternational reactions to the Syrian civil warForeign involvement in the Syrian civil warReactions to the fall of the Assad regimeSpecific groups and countriesRussian involvementRussian interventionTurkish involvementTurkish occupation of northern SyriaSecond Northern Syria Buffer ZoneRussian-Turkish agreement on SyriaUS intervention in the Syrian civil war2023 attacks on U.S. bases in Iraq and SyriaKurdish Area in SyriaSyrian Democratic ForcesRojava conflictU.S. task forceAgreements and dialoguesRussian-Turkish agreement on SyriaRelations between Syrian government and Kurdish groups in SyriaTransitional phaseFirst Syrian transitional governmentSecond Syrian transitional government",
                "Main overviews",
                "SyriaRojavaSyrian civil warTimelineBackground and causesSyrian government reactionsBelligerentsInter-rebel conflictSpilloverCities and townsSectarianism and minoritiesSyrian Desert campaign (December 2017–present)2024 Syrian opposition offensivesFall of the Assad regime",
                "Effects and ongoing concerns",
                "Casualties of the Syrian civil warRefugees of the Syrian civil warHumanitarian aid during the Syrian civil warHuman rights violations during the Syrian civil war",
                "Phases and processes",
                "Syrian revolutionEarly insurgency phase2012–2013 escalationCeasefiresSyrian peace process",
                "World reaction",
                "International reactions to the Syrian civil warForeign involvement in the Syrian civil warReactions to the fall of the Assad regime",
                "Specific groups and countries",
                "Russian involvementRussian interventionTurkish involvementTurkish occupation of northern SyriaSecond Northern Syria Buffer ZoneRussian-Turkish agreement on SyriaUS intervention in the Syrian civil war2023 attacks on U.S. bases in Iraq and SyriaKurdish Area in SyriaSyrian Democratic ForcesRojava conflictU.S. task force",
                "Agreements and dialogues",
                "Russian-Turkish agreement on SyriaRelations between Syrian government and Kurdish groups in Syria",
                "Transitional phase",
                "First Syrian transitional governmentSecond Syrian transitional government"
            ],
            [
                "Main overviews",
                "SyriaRojavaSyrian civil warTimelineBackground and causesSyrian government reactionsBelligerentsInter-rebel conflictSpilloverCities and townsSectarianism and minoritiesSyrian Desert campaign (December 2017–present)2024 Syrian opposition offensivesFall of the Assad regime"
            ],
            [
                "Effects and ongoing concerns",
                "Casualties of the Syrian civil warRefugees of the Syrian civil warHumanitarian aid during the Syrian civil warHuman rights violations during the Syrian civil war"
            ],
            [
                "Phases and processes",
                "Syrian revolutionEarly insurgency phase2012–2013 escalationCeasefiresSyrian peace process"
            ],
            [
                "World reaction",
                "International reactions to the Syrian civil warForeign involvement in the Syrian civil warReactions to the fall of the Assad regime"
            ],
            [
                "Specific groups and countries",
                "Russian involvementRussian interventionTurkish involvementTurkish occupation of northern SyriaSecond Northern Syria Buffer ZoneRussian-Turkish agreement on SyriaUS intervention in the Syrian civil war2023 attacks on U.S. bases in Iraq and SyriaKurdish Area in SyriaSyrian Democratic ForcesRojava conflictU.S. task force"
            ],
            [
                "Agreements and dialogues",
                "Russian-Turkish agreement on SyriaRelations between Syrian government and Kurdish groups in Syria"
            ],
            [
                "Transitional phase",
                "First Syrian transitional governmentSecond Syrian transitional government"
            ]
        ]
    },
    {
        "heading": "References",
        "table": [
            [
                "Effects and ongoing concerns",
                "Casualties of the Syrian civil warRefugees of the Syrian civil warHumanitarian aid during the Syrian civil warHuman rights violations during the Syrian civil war"
            ],
            [
                "Phases and processes",
                "Syrian revolutionEarly insurgency phase2012–2013 escalationCeasefiresSyrian peace process"
            ],
            [
                "World reaction",
                "International reactions to the Syrian civil warForeign involvement in the Syrian civil warReactions to the fall of the Assad regime"
            ],
            [
                "Specific groups and countries",
                "Russian involvementRussian interventionTurkish involvementTurkish occupation of northern SyriaSecond Northern Syria Buffer ZoneRussian-Turkish agreement on SyriaUS intervention in the Syrian civil war2023 attacks on U.S. bases in Iraq and SyriaKurdish Area in SyriaSyrian Democratic ForcesRojava conflictU.S. task force"
            ],
            [
                "Agreements and dialogues",
                "Russian-Turkish agreement on SyriaRelations between Syrian government and Kurdish groups in Syria"
            ],
            [
                "Transitional phase",
                "First Syrian transitional governmentSecond Syrian transitional government"
            ]
        ]
    },
    {
        "heading": "References",
        "table": [
            [
                "Background1963 coup1966 coupCorrective MovementIslamist uprisingLatakia protestsDamascus SpringQamishli riotsSyrian occupation of LebanonDamascus DeclarationHuman rights in Syria2010s in Syria political historyArab Spring2011Jan–AprMay–AugSep–DecSyrian revolutionDeath of Hamza Ali Al-KhateebSiege of DaraaSiege of BaniyasMay Talkalakh siegeSiege of Rastan and TalbisehJune Jisr ash-Shughur operationSiege of HamaSiege of HomsJabal al-Zawiya operationSiege of LatakiaDeir ez-Zor clashes (2011–2014)Rif Dimashq clashes (Nov 2011-Mar 2012)Battle of ZabadaniBattle of DoumaDaraa Governorate clashesBattle of RastanShayrat and Tiyas airbase ambushIdlib Governorate clashesDecember Jabal al-Zawiya massacres2012Jan–AprMay–AugSep–DecJanuary al-Midan bombingBattle of RastanFirst Battle of IdlibBattle of al-QusayrIdlib Governorate operation (Apr)Battle of TaftanazMay Battle of RastanHoula massacreBattle of al-HaffahAl-Qubeir massacreBattle of TremsehBattle of Damascus18 July 2012 Damascus bombingBattle of AleppoBattle of AnadanSiege of Base 46Al-Hasakah Governorate campaign (2012–2013)Rif Dimashq offensive (Aug-Oct)Darayya massacreBattle of Khirbet Al-JozBattle of Maarrat al-NumanFirst siege of Wadi DeifBattle of HaremRif Dimashq offensive (Nov 2012–Feb 2013)Battle of DarayyaAqrab massacreHama offensiveHalfaya massacreBattle of DarayyaQuneitra Governorate clashesTalbiseh bakery massacre2013Jan–AprMay–DecBattle of SafiraBattle of ShadadehDamascus offensiveRaqqa campaign (2012–2013)Battle of Raqqa (Mar)Daraa offensiveRif Dimashq offensive (Mar–Aug)Battle of Jdaidet al-FadlGhouta chemical attackAl-Qusayr offensiveBattle of al-QusayrBayda and Baniyas massacresHama offensiveHatla massacreKhan al-Assal chemical attackKhan al-Assal massacreAdra massacreBattle of Ras al-AynBattle of Tell AbyadRif Dimashq offensive (Sep–Nov)Aleppo offensive (Oct–Dec)Battle of al-YaarubiyahBattle of Tell Hamis and Tell Brak (Dec–Jan)2014Jan–JulAug–DecFirst Inter-rebel conflictBattle of MarkadaDeir ez-Zor offensiveBattle of MorekDaraa offensive (Feb–May)Maan massacreAl-Otaiba ambushIdlib offensiveBattle of HosnLatakia OffensiveBattle of Al-MalihahKafr Zita chemical attackSecond siege of Wadi DeifQalamoun offensive (Jun–Aug)Battle of ArsalFirst Battle of the Shaer gas fieldEastern Syria offensiveBattle of Tabqa AirbaseNorthern Aleppo offensive (Feb–Jul)Hama OffensiveQuneitra offensiveRif Dimashq offensive (Aug–Nov)Siege of KobanîHoms school bombingDaraa offensive (Oct)Al-Safira offensiveIdlib RaidSecond Inter-Rebel ConflictSecond Battle of the Shaer gas fieldBattle of Al-Shaykh MaskinDeir ez-Zor offensive (Dec)2015Jan–JulAug–DecAir Force An-26 crashDaraa Offensive (Jan)Southern Syria OffensiveEastern al-Hasakah offensiveBattle of Sarrin (Mar–Apr)Battle of Sarrin (Jun–Jul)Battle of BosraIdlib OffensiveSecond Battle of IdlibBattle of Nasib Border CrossingBattle of Yarmouk CampWestern al-Hasakah offensivePalmyra offensive (May)Qamishli bombingsTell Abyad offensiveKobanî massacreQuneitra offensive (Jun)Palmyra offensive (Jul–Aug)Rif Dimashq offensive (Sep)Northwestern Syria offensive (Oct–Nov)Aleppo offensive (Oct–Dec)Al-Hawl offensiveHoms offensive (Nov-Dec)East Aleppo offensive (2015–2016)2015–2016 Latakia offensiveTishrin Dam offensiveRussian Sukhoi Su-24 shootdown2016Jan–AprMay–AugSep–DecSecond Battle of Al-Shaykh MaskinDeir ez-Zor offensive (Jan)January Sayyidah Zaynab bombingsNorthern Aleppo offensive (Feb)Ithriyah-Raqqa offensive (Feb–Mar)Al-Shaddadi offensiveFebruary Homs bombingsFebruary Sayyidah Zaynab bombingsKhanasir offensiveBattle of Tel AbyadBattle of Maarrat al-NumanBattle of Qamishli (Apr)Northern Aleppo offensive (Mar–Jun)Palmyra offensive (Mar)East Ghouta inter-rebel conflict (Apr–May)Rif Dimashq offensive (Apr–May)Northern Raqqa offensive (May)May Jableh & Tartous bombingsIthriyah-Raqqa offensive (Jun)Rif Dimashq offensive (Jun–Oct)Manbij offensiveTokhar massacreSouthern Aleppo campaignBattle of al-Rai (Aug)Operation Euphrates ShieldAleppo summer campaignWestern al-Bab offensive (Sep)5 September bombingsSeptember Deir ez-Zor air raidSeptember Urum al-Kubra aid convoy attackAleppo offensive (Sep–Oct)Dabiq offensiveWestern al-Bab offensive (Oct–Nov)Khan al-Shih offensive (Oct–Nov)Raqqa campaignBattle of al-BabAleppo offensive (Nov-Dec)Palmyra offensive (Dec)2017Jan–AprMay–AugSep–DecWadi Barada offensive (2016–2017)January Azaz bombingDesert campaign (Dec 16–Apr 17)Idlib clashes (Jan–Mar)Deir ez-Zor offensive (Jan–Feb)Daraa offensive (Feb–Jun)Southwestern Daraa offensive (Feb)Qaboun offensivePalmyra offensiveEast Aleppo offensive (Jan–Apr)March Damascus bombingsAl-Jinah airstrikeHama offensive (Mar–Apr)Battle of TabqaKhan Shaykhun chemical attackShayrat missile strikeAleppo bombingApril Turkish airstrikesEast Ghouta inter-rebel conflict (Apr–May)Desert campaign (May–Jul)Maskanah Plains offensiveEast Hama offensiveBattle of RaqqaDaraa offensive (Jun)Southern Raqqa offensive (Jun)Jobar offensive (Jun–Aug)Quneitra offensive (Jun)Idlib clashes (Jul)Central campaignQalamoun (Jul–Aug)Deir ez-Zor offensive (Sep 17–Mar 18)Hama offensive (Sep)Northwestern campaign (Oct 17–Feb 18)Turkish military operation in Idlib GovernorateBattle of HarastaEastern campaign (Sep–Dec)Euphrates Crossing offensiveMayadin offensiveBattle of Deir ez-Zor (Sep–Nov)Abu Kamal offensiveBeit Jinn offensive2018Jan–AprMay–AugSep–DecOperation Olive BranchBattle of KhashamRif Dimashq offensive (Feb–Apr)Southern Damascus offensive (Jan–Feb)Syrian Liberation Front–Tahrir al-Sham conflictSouthern Damascus offensive (Mar)Douma chemical attackMissile strikes (Apr)Northern Homs offensive (Apr–May)Eastern Qalamoun offensive (Apr)Southern Damascus offensive (Apr–May)Deir ez-Zor clashes (Apr)Deir ez-Zor offensive (May–Jun)As-Suwayda offensive (Jun)Southern offensiveAs-Suwayda attacksAs-Suwayda (Aug-Nov)Qamishli clashes (Sep)Missile strikes (Sep)Northern border clashes2019Jan–AprMay–AugSep–DecIdlib inter-rebel conflictManbij bombingBattle of Baghuz FawqaniISIL insurgency in Deir-ez-ZorDêrik prison escape attemptTell Rifaat clashesNorthwestern offensive (Apr–Aug)June bombingsHass refugee camp bombingMissile strikes (Aug)Turkish offensive into northeastBarisha raidNovember bombingsIsraeli missile strikes (Nov)Qah missile strikeNorthwestern offensive (Dec 19–Mar 20)US airstrikes2020Jan–DecCOVID-19 pandemicAfrin bombingIdlib Governorate clashesKafr-Takharim airstrikeAyn Issa clashesDeir ez-Zor ambush2021Jan–DecSiege of Qamishli and Al-HasakahMissile strikes (Jan)US airstrike (Feb)Battle of Qamishli (Apr)US airstrike (Jun)Daraa clashesTahrir al-Sham–Junud al-Sham conflict2022Jan–DecBattle of al-HasakahAhrar al-Sham–Levant Front clashesJabal al-Bishrī clashesJarqli airstrikesNorthern Aleppo clashes (Oct)Operation Claw-SwordNorthwest clashes (Dec)2023Jan-DecAl-Sukhnah attackDamascus airstrikeHama attackNorthern border clashes2024Jan–OctNov–presentOpposition offensivesDeir ez-Zor offensiveBattle of AleppoAleppo University Hospital airstrikeSouthern offensiveOperation Dawn of FreedomManbij offensiveAl-Mustariha strikeKobani clashesHama offensiveHoms offensivePalmyra offensiveFall of DamascusFall of the Assad regimeWestern Syria clashesMassacres of Syrian AlawitesHezbollah-Syria clashesJaramana clashesLebanon–Syria border clashesRif Dimashq clashesMassacres of Syrian DruzeIsraeli invasionSpilloverIsrael and Golan Heights:March 2017 incidentFebruary 2018 incidentMay 2018 Israel–Iran incidentsIraq:Akashat ambushOperation al-ShabahApril 2014 Iraqi border airstrikeJordanian border incidentsApril 2014 Jordanian border airstrikeLebanon:Lebanese border clashesBattle of SidonIranian embassy bombing in BeirutNorth Lebanon clashesQalamoun (Jul–Aug 2017)Turkey:December 2011 Turkish border clash2012 Turkish F-4 Phantom shootdown2012 Turkish border clashes2013 Reyhanlı car bombingsJanuary 2014 Turkish attack in SyriaAssassination of Andrei KarlovRussian Air Force Al-Bab incident2020 Balyun airstrikesOperation Spring ShieldElsewhere:Deir ez-Zor missile strike(Iran)",
                "Background",
                "1963 coup1966 coupCorrective MovementIslamist uprisingLatakia protestsDamascus SpringQamishli riotsSyrian occupation of LebanonDamascus DeclarationHuman rights in Syria2010s in Syria political historyArab Spring",
                "2011Jan–AprMay–AugSep–Dec",
                "Syrian revolutionDeath of Hamza Ali Al-KhateebSiege of DaraaSiege of BaniyasMay Talkalakh siegeSiege of Rastan and TalbisehJune Jisr ash-Shughur operationSiege of HamaSiege of HomsJabal al-Zawiya operationSiege of LatakiaDeir ez-Zor clashes (2011–2014)Rif Dimashq clashes (Nov 2011-Mar 2012)Battle of ZabadaniBattle of DoumaDaraa Governorate clashesBattle of RastanShayrat and Tiyas airbase ambushIdlib Governorate clashesDecember Jabal al-Zawiya massacres",
                "2012Jan–AprMay–AugSep–Dec",
                "January al-Midan bombingBattle of RastanFirst Battle of IdlibBattle of al-QusayrIdlib Governorate operation (Apr)Battle of TaftanazMay Battle of RastanHoula massacreBattle of al-HaffahAl-Qubeir massacreBattle of TremsehBattle of Damascus18 July 2012 Damascus bombingBattle of AleppoBattle of AnadanSiege of Base 46Al-Hasakah Governorate campaign (2012–2013)Rif Dimashq offensive (Aug-Oct)Darayya massacreBattle of Khirbet Al-JozBattle of Maarrat al-NumanFirst siege of Wadi DeifBattle of HaremRif Dimashq offensive (Nov 2012–Feb 2013)Battle of DarayyaAqrab massacreHama offensiveHalfaya massacreBattle of DarayyaQuneitra Governorate clashesTalbiseh bakery massacre",
                "2013Jan–AprMay–Dec",
                "Battle of SafiraBattle of ShadadehDamascus offensiveRaqqa campaign (2012–2013)Battle of Raqqa (Mar)Daraa offensiveRif Dimashq offensive (Mar–Aug)Battle of Jdaidet al-FadlGhouta chemical attackAl-Qusayr offensiveBattle of al-QusayrBayda and Baniyas massacresHama offensiveHatla massacreKhan al-Assal chemical attackKhan al-Assal massacreAdra massacreBattle of Ras al-AynBattle of Tell AbyadRif Dimashq offensive (Sep–Nov)Aleppo offensive (Oct–Dec)Battle of al-YaarubiyahBattle of Tell Hamis and Tell Brak (Dec–Jan)",
                "2014Jan–JulAug–Dec",
                "First Inter-rebel conflictBattle of MarkadaDeir ez-Zor offensiveBattle of MorekDaraa offensive (Feb–May)Maan massacreAl-Otaiba ambushIdlib offensiveBattle of HosnLatakia OffensiveBattle of Al-MalihahKafr Zita chemical attackSecond siege of Wadi DeifQalamoun offensive (Jun–Aug)Battle of ArsalFirst Battle of the Shaer gas fieldEastern Syria offensiveBattle of Tabqa AirbaseNorthern Aleppo offensive (Feb–Jul)Hama OffensiveQuneitra offensiveRif Dimashq offensive (Aug–Nov)Siege of KobanîHoms school bombingDaraa offensive (Oct)Al-Safira offensiveIdlib RaidSecond Inter-Rebel ConflictSecond Battle of the Shaer gas fieldBattle of Al-Shaykh MaskinDeir ez-Zor offensive (Dec)",
                "2015Jan–JulAug–Dec",
                "Air Force An-26 crashDaraa Offensive (Jan)Southern Syria OffensiveEastern al-Hasakah offensiveBattle of Sarrin (Mar–Apr)Battle of Sarrin (Jun–Jul)Battle of BosraIdlib OffensiveSecond Battle of IdlibBattle of Nasib Border CrossingBattle of Yarmouk CampWestern al-Hasakah offensivePalmyra offensive (May)Qamishli bombingsTell Abyad offensiveKobanî massacreQuneitra offensive (Jun)Palmyra offensive (Jul–Aug)Rif Dimashq offensive (Sep)Northwestern Syria offensive (Oct–Nov)Aleppo offensive (Oct–Dec)Al-Hawl offensiveHoms offensive (Nov-Dec)East Aleppo offensive (2015–2016)2015–2016 Latakia offensiveTishrin Dam offensiveRussian Sukhoi Su-24 shootdown",
                "2016Jan–AprMay–AugSep–Dec",
                "Second Battle of Al-Shaykh MaskinDeir ez-Zor offensive (Jan)January Sayyidah Zaynab bombingsNorthern Aleppo offensive (Feb)Ithriyah-Raqqa offensive (Feb–Mar)Al-Shaddadi offensiveFebruary Homs bombingsFebruary Sayyidah Zaynab bombingsKhanasir offensiveBattle of Tel AbyadBattle of Maarrat al-NumanBattle of Qamishli (Apr)Northern Aleppo offensive (Mar–Jun)Palmyra offensive (Mar)East Ghouta inter-rebel conflict (Apr–May)Rif Dimashq offensive (Apr–May)Northern Raqqa offensive (May)May Jableh & Tartous bombingsIthriyah-Raqqa offensive (Jun)Rif Dimashq offensive (Jun–Oct)Manbij offensiveTokhar massacreSouthern Aleppo campaignBattle of al-Rai (Aug)Operation Euphrates ShieldAleppo summer campaignWestern al-Bab offensive (Sep)5 September bombingsSeptember Deir ez-Zor air raidSeptember Urum al-Kubra aid convoy attackAleppo offensive (Sep–Oct)Dabiq offensiveWestern al-Bab offensive (Oct–Nov)Khan al-Shih offensive (Oct–Nov)Raqqa campaignBattle of al-BabAleppo offensive (Nov-Dec)Palmyra offensive (Dec)",
                "2017Jan–AprMay–AugSep–Dec",
                "Wadi Barada offensive (2016–2017)January Azaz bombingDesert campaign (Dec 16–Apr 17)Idlib clashes (Jan–Mar)Deir ez-Zor offensive (Jan–Feb)Daraa offensive (Feb–Jun)Southwestern Daraa offensive (Feb)Qaboun offensivePalmyra offensiveEast Aleppo offensive (Jan–Apr)March Damascus bombingsAl-Jinah airstrikeHama offensive (Mar–Apr)Battle of TabqaKhan Shaykhun chemical attackShayrat missile strikeAleppo bombingApril Turkish airstrikesEast Ghouta inter-rebel conflict (Apr–May)Desert campaign (May–Jul)Maskanah Plains offensiveEast Hama offensiveBattle of RaqqaDaraa offensive (Jun)Southern Raqqa offensive (Jun)Jobar offensive (Jun–Aug)Quneitra offensive (Jun)Idlib clashes (Jul)Central campaignQalamoun (Jul–Aug)Deir ez-Zor offensive (Sep 17–Mar 18)Hama offensive (Sep)Northwestern campaign (Oct 17–Feb 18)Turkish military operation in Idlib GovernorateBattle of HarastaEastern campaign (Sep–Dec)Euphrates Crossing offensiveMayadin offensiveBattle of Deir ez-Zor (Sep–Nov)Abu Kamal offensiveBeit Jinn offensive",
                "2018Jan–AprMay–AugSep–Dec",
                "Operation Olive BranchBattle of KhashamRif Dimashq offensive (Feb–Apr)Southern Damascus offensive (Jan–Feb)Syrian Liberation Front–Tahrir al-Sham conflictSouthern Damascus offensive (Mar)Douma chemical attackMissile strikes (Apr)Northern Homs offensive (Apr–May)Eastern Qalamoun offensive (Apr)Southern Damascus offensive (Apr–May)Deir ez-Zor clashes (Apr)Deir ez-Zor offensive (May–Jun)As-Suwayda offensive (Jun)Southern offensiveAs-Suwayda attacksAs-Suwayda (Aug-Nov)Qamishli clashes (Sep)Missile strikes (Sep)Northern border clashes",
                "2019Jan–AprMay–AugSep–Dec",
                "Idlib inter-rebel conflictManbij bombingBattle of Baghuz FawqaniISIL insurgency in Deir-ez-ZorDêrik prison escape attemptTell Rifaat clashesNorthwestern offensive (Apr–Aug)June bombingsHass refugee camp bombingMissile strikes (Aug)Turkish offensive into northeastBarisha raidNovember bombingsIsraeli missile strikes (Nov)Qah missile strikeNorthwestern offensive (Dec 19–Mar 20)US airstrikes",
                "2020Jan–Dec",
                "COVID-19 pandemicAfrin bombingIdlib Governorate clashesKafr-Takharim airstrikeAyn Issa clashesDeir ez-Zor ambush",
                "2021Jan–Dec",
                "Siege of Qamishli and Al-HasakahMissile strikes (Jan)US airstrike (Feb)Battle of Qamishli (Apr)US airstrike (Jun)Daraa clashesTahrir al-Sham–Junud al-Sham conflict",
                "2022Jan–Dec",
                "Battle of al-HasakahAhrar al-Sham–Levant Front clashesJabal al-Bishrī clashesJarqli airstrikesNorthern Aleppo clashes (Oct)Operation Claw-SwordNorthwest clashes (Dec)",
                "2023Jan-Dec",
                "Al-Sukhnah attackDamascus airstrikeHama attackNorthern border clashes",
                "2024Jan–OctNov–present",
                "Opposition offensivesDeir ez-Zor offensiveBattle of AleppoAleppo University Hospital airstrikeSouthern offensiveOperation Dawn of FreedomManbij offensiveAl-Mustariha strikeKobani clashesHama offensiveHoms offensivePalmyra offensiveFall of DamascusFall of the Assad regimeWestern Syria clashesMassacres of Syrian AlawitesHezbollah-Syria clashesJaramana clashesLebanon–Syria border clashesRif Dimashq clashesMassacres of Syrian DruzeIsraeli invasion",
                "Spillover",
                "Israel and Golan Heights:March 2017 incidentFebruary 2018 incidentMay 2018 Israel–Iran incidentsIraq:Akashat ambushOperation al-ShabahApril 2014 Iraqi border airstrikeJordanian border incidentsApril 2014 Jordanian border airstrikeLebanon:Lebanese border clashesBattle of SidonIranian embassy bombing in BeirutNorth Lebanon clashesQalamoun (Jul–Aug 2017)Turkey:December 2011 Turkish border clash2012 Turkish F-4 Phantom shootdown2012 Turkish border clashes2013 Reyhanlı car bombingsJanuary 2014 Turkish attack in SyriaAssassination of Andrei KarlovRussian Air Force Al-Bab incident2020 Balyun airstrikesOperation Spring ShieldElsewhere:Deir ez-Zor missile strike(Iran)",
                "Israel and Golan Heights:",
                "March 2017 incidentFebruary 2018 incidentMay 2018 Israel–Iran incidents",
                "Iraq:",
                "Akashat ambushOperation al-ShabahApril 2014 Iraqi border airstrike",
                "Jordanian border incidents",
                "April 2014 Jordanian border airstrike",
                "Lebanon:",
                "Lebanese border clashesBattle of SidonIranian embassy bombing in BeirutNorth Lebanon clashesQalamoun (Jul–Aug 2017)",
                "Turkey:",
                "December 2011 Turkish border clash2012 Turkish F-4 Phantom shootdown2012 Turkish border clashes2013 Reyhanlı car bombingsJanuary 2014 Turkish attack in SyriaAssassination of Andrei KarlovRussian Air Force Al-Bab incident2020 Balyun airstrikesOperation Spring Shield",
                "Elsewhere:",
                "Deir ez-Zor missile strike(Iran)"
            ],
            [
                "Background",
                "1963 coup1966 coupCorrective MovementIslamist uprisingLatakia protestsDamascus SpringQamishli riotsSyrian occupation of LebanonDamascus DeclarationHuman rights in Syria2010s in Syria political historyArab Spring"
            ],
            [
                "2011Jan–AprMay–AugSep–Dec",
                "Syrian revolutionDeath of Hamza Ali Al-KhateebSiege of DaraaSiege of BaniyasMay Talkalakh siegeSiege of Rastan and TalbisehJune Jisr ash-Shughur operationSiege of HamaSiege of HomsJabal al-Zawiya operationSiege of LatakiaDeir ez-Zor clashes (2011–2014)Rif Dimashq clashes (Nov 2011-Mar 2012)Battle of ZabadaniBattle of DoumaDaraa Governorate clashesBattle of RastanShayrat and Tiyas airbase ambushIdlib Governorate clashesDecember Jabal al-Zawiya massacres"
            ],
            [
                "2012Jan–AprMay–AugSep–Dec",
                "January al-Midan bombingBattle of RastanFirst Battle of IdlibBattle of al-QusayrIdlib Governorate operation (Apr)Battle of TaftanazMay Battle of RastanHoula massacreBattle of al-HaffahAl-Qubeir massacreBattle of TremsehBattle of Damascus18 July 2012 Damascus bombingBattle of AleppoBattle of AnadanSiege of Base 46Al-Hasakah Governorate campaign (2012–2013)Rif Dimashq offensive (Aug-Oct)Darayya massacreBattle of Khirbet Al-JozBattle of Maarrat al-NumanFirst siege of Wadi DeifBattle of HaremRif Dimashq offensive (Nov 2012–Feb 2013)Battle of DarayyaAqrab massacreHama offensiveHalfaya massacreBattle of DarayyaQuneitra Governorate clashesTalbiseh bakery massacre"
            ],
            [
                "2013Jan–AprMay–Dec",
                "Battle of SafiraBattle of ShadadehDamascus offensiveRaqqa campaign (2012–2013)Battle of Raqqa (Mar)Daraa offensiveRif Dimashq offensive (Mar–Aug)Battle of Jdaidet al-FadlGhouta chemical attackAl-Qusayr offensiveBattle of al-QusayrBayda and Baniyas massacresHama offensiveHatla massacreKhan al-Assal chemical attackKhan al-Assal massacreAdra massacreBattle of Ras al-AynBattle of Tell AbyadRif Dimashq offensive (Sep–Nov)Aleppo offensive (Oct–Dec)Battle of al-YaarubiyahBattle of Tell Hamis and Tell Brak (Dec–Jan)"
            ],
            [
                "2014Jan–JulAug–Dec",
                "First Inter-rebel conflictBattle of MarkadaDeir ez-Zor offensiveBattle of MorekDaraa offensive (Feb–May)Maan massacreAl-Otaiba ambushIdlib offensiveBattle of HosnLatakia OffensiveBattle of Al-MalihahKafr Zita chemical attackSecond siege of Wadi DeifQalamoun offensive (Jun–Aug)Battle of ArsalFirst Battle of the Shaer gas fieldEastern Syria offensiveBattle of Tabqa AirbaseNorthern Aleppo offensive (Feb–Jul)Hama OffensiveQuneitra offensiveRif Dimashq offensive (Aug–Nov)Siege of KobanîHoms school bombingDaraa offensive (Oct)Al-Safira offensiveIdlib RaidSecond Inter-Rebel ConflictSecond Battle of the Shaer gas fieldBattle of Al-Shaykh MaskinDeir ez-Zor offensive (Dec)"
            ],
            [
                "2015Jan–JulAug–Dec",
                "Air Force An-26 crashDaraa Offensive (Jan)Southern Syria OffensiveEastern al-Hasakah offensiveBattle of Sarrin (Mar–Apr)Battle of Sarrin (Jun–Jul)Battle of BosraIdlib OffensiveSecond Battle of IdlibBattle of Nasib Border CrossingBattle of Yarmouk CampWestern al-Hasakah offensivePalmyra offensive (May)Qamishli bombingsTell Abyad offensiveKobanî massacreQuneitra offensive (Jun)Palmyra offensive (Jul–Aug)Rif Dimashq offensive (Sep)Northwestern Syria offensive (Oct–Nov)Aleppo offensive (Oct–Dec)Al-Hawl offensiveHoms offensive (Nov-Dec)East Aleppo offensive (2015–2016)2015–2016 Latakia offensiveTishrin Dam offensiveRussian Sukhoi Su-24 shootdown"
            ],
            [
                "2016Jan–AprMay–AugSep–Dec",
                "Second Battle of Al-Shaykh MaskinDeir ez-Zor offensive (Jan)January Sayyidah Zaynab bombingsNorthern Aleppo offensive (Feb)Ithriyah-Raqqa offensive (Feb–Mar)Al-Shaddadi offensiveFebruary Homs bombingsFebruary Sayyidah Zaynab bombingsKhanasir offensiveBattle of Tel AbyadBattle of Maarrat al-NumanBattle of Qamishli (Apr)Northern Aleppo offensive (Mar–Jun)Palmyra offensive (Mar)East Ghouta inter-rebel conflict (Apr–May)Rif Dimashq offensive (Apr–May)Northern Raqqa offensive (May)May Jableh & Tartous bombingsIthriyah-Raqqa offensive (Jun)Rif Dimashq offensive (Jun–Oct)Manbij offensiveTokhar massacreSouthern Aleppo campaignBattle of al-Rai (Aug)Operation Euphrates ShieldAleppo summer campaignWestern al-Bab offensive (Sep)5 September bombingsSeptember Deir ez-Zor air raidSeptember Urum al-Kubra aid convoy attackAleppo offensive (Sep–Oct)Dabiq offensiveWestern al-Bab offensive (Oct–Nov)Khan al-Shih offensive (Oct–Nov)Raqqa campaignBattle of al-BabAleppo offensive (Nov-Dec)Palmyra offensive (Dec)"
            ],
            [
                "2017Jan–AprMay–AugSep–Dec",
                "Wadi Barada offensive (2016–2017)January Azaz bombingDesert campaign (Dec 16–Apr 17)Idlib clashes (Jan–Mar)Deir ez-Zor offensive (Jan–Feb)Daraa offensive (Feb–Jun)Southwestern Daraa offensive (Feb)Qaboun offensivePalmyra offensiveEast Aleppo offensive (Jan–Apr)March Damascus bombingsAl-Jinah airstrikeHama offensive (Mar–Apr)Battle of TabqaKhan Shaykhun chemical attackShayrat missile strikeAleppo bombingApril Turkish airstrikesEast Ghouta inter-rebel conflict (Apr–May)Desert campaign (May–Jul)Maskanah Plains offensiveEast Hama offensiveBattle of RaqqaDaraa offensive (Jun)Southern Raqqa offensive (Jun)Jobar offensive (Jun–Aug)Quneitra offensive (Jun)Idlib clashes (Jul)Central campaignQalamoun (Jul–Aug)Deir ez-Zor offensive (Sep 17–Mar 18)Hama offensive (Sep)Northwestern campaign (Oct 17–Feb 18)Turkish military operation in Idlib GovernorateBattle of HarastaEastern campaign (Sep–Dec)Euphrates Crossing offensiveMayadin offensiveBattle of Deir ez-Zor (Sep–Nov)Abu Kamal offensiveBeit Jinn offensive"
            ],
            [
                "2018Jan–AprMay–AugSep–Dec",
                "Operation Olive BranchBattle of KhashamRif Dimashq offensive (Feb–Apr)Southern Damascus offensive (Jan–Feb)Syrian Liberation Front–Tahrir al-Sham conflictSouthern Damascus offensive (Mar)Douma chemical attackMissile strikes (Apr)Northern Homs offensive (Apr–May)Eastern Qalamoun offensive (Apr)Southern Damascus offensive (Apr–May)Deir ez-Zor clashes (Apr)Deir ez-Zor offensive (May–Jun)As-Suwayda offensive (Jun)Southern offensiveAs-Suwayda attacksAs-Suwayda (Aug-Nov)Qamishli clashes (Sep)Missile strikes (Sep)Northern border clashes"
            ],
            [
                "2019Jan–AprMay–AugSep–Dec",
                "Idlib inter-rebel conflictManbij bombingBattle of Baghuz FawqaniISIL insurgency in Deir-ez-ZorDêrik prison escape attemptTell Rifaat clashesNorthwestern offensive (Apr–Aug)June bombingsHass refugee camp bombingMissile strikes (Aug)Turkish offensive into northeastBarisha raidNovember bombingsIsraeli missile strikes (Nov)Qah missile strikeNorthwestern offensive (Dec 19–Mar 20)US airstrikes"
            ],
            [
                "2020Jan–Dec",
                "COVID-19 pandemicAfrin bombingIdlib Governorate clashesKafr-Takharim airstrikeAyn Issa clashesDeir ez-Zor ambush"
            ],
            [
                "2021Jan–Dec",
                "Siege of Qamishli and Al-HasakahMissile strikes (Jan)US airstrike (Feb)Battle of Qamishli (Apr)US airstrike (Jun)Daraa clashesTahrir al-Sham–Junud al-Sham conflict"
            ],
            [
                "2022Jan–Dec",
                "Battle of al-HasakahAhrar al-Sham–Levant Front clashesJabal al-Bishrī clashesJarqli airstrikesNorthern Aleppo clashes (Oct)Operation Claw-SwordNorthwest clashes (Dec)"
            ],
            [
                "2023Jan-Dec",
                "Al-Sukhnah attackDamascus airstrikeHama attackNorthern border clashes"
            ],
            [
                "2024Jan–OctNov–present",
                "Opposition offensivesDeir ez-Zor offensiveBattle of AleppoAleppo University Hospital airstrikeSouthern offensiveOperation Dawn of FreedomManbij offensiveAl-Mustariha strikeKobani clashesHama offensiveHoms offensivePalmyra offensiveFall of DamascusFall of the Assad regimeWestern Syria clashesMassacres of Syrian AlawitesHezbollah-Syria clashesJaramana clashesLebanon–Syria border clashesRif Dimashq clashesMassacres of Syrian DruzeIsraeli invasion"
            ],
            [
                "Spillover",
                "Israel and Golan Heights:March 2017 incidentFebruary 2018 incidentMay 2018 Israel–Iran incidentsIraq:Akashat ambushOperation al-ShabahApril 2014 Iraqi border airstrikeJordanian border incidentsApril 2014 Jordanian border airstrikeLebanon:Lebanese border clashesBattle of SidonIranian embassy bombing in BeirutNorth Lebanon clashesQalamoun (Jul–Aug 2017)Turkey:December 2011 Turkish border clash2012 Turkish F-4 Phantom shootdown2012 Turkish border clashes2013 Reyhanlı car bombingsJanuary 2014 Turkish attack in SyriaAssassination of Andrei KarlovRussian Air Force Al-Bab incident2020 Balyun airstrikesOperation Spring ShieldElsewhere:Deir ez-Zor missile strike(Iran)",
                "Israel and Golan Heights:",
                "March 2017 incidentFebruary 2018 incidentMay 2018 Israel–Iran incidents",
                "Iraq:",
                "Akashat ambushOperation al-ShabahApril 2014 Iraqi border airstrike",
                "Jordanian border incidents",
                "April 2014 Jordanian border airstrike",
                "Lebanon:",
                "Lebanese border clashesBattle of SidonIranian embassy bombing in BeirutNorth Lebanon clashesQalamoun (Jul–Aug 2017)",
                "Turkey:",
                "December 2011 Turkish border clash2012 Turkish F-4 Phantom shootdown2012 Turkish border clashes2013 Reyhanlı car bombingsJanuary 2014 Turkish attack in SyriaAssassination of Andrei KarlovRussian Air Force Al-Bab incident2020 Balyun airstrikesOperation Spring Shield",
                "Elsewhere:",
                "Deir ez-Zor missile strike(Iran)"
            ],
            [
                "Israel and Golan Heights:",
                "March 2017 incidentFebruary 2018 incidentMay 2018 Israel–Iran incidents"
            ],
            [
                "Iraq:",
                "Akashat ambushOperation al-ShabahApril 2014 Iraqi border airstrike"
            ],
            [
                "Jordanian border incidents",
                "April 2014 Jordanian border airstrike"
            ],
            [
                "Lebanon:",
                "Lebanese border clashesBattle of SidonIranian embassy bombing in BeirutNorth Lebanon clashesQalamoun (Jul–Aug 2017)"
            ],
            [
                "Turkey:",
                "December 2011 Turkish border clash2012 Turkish F-4 Phantom shootdown2012 Turkish border clashes2013 Reyhanlı car bombingsJanuary 2014 Turkish attack in SyriaAssassination of Andrei KarlovRussian Air Force Al-Bab incident2020 Balyun airstrikesOperation Spring Shield"
            ],
            [
                "Elsewhere:",
                "Deir ez-Zor missile strike(Iran)"
            ]
        ]
    },
    {
        "heading": "References",
        "table": [
            [
                "2011Jan–AprMay–AugSep–Dec",
                "Syrian revolutionDeath of Hamza Ali Al-KhateebSiege of DaraaSiege of BaniyasMay Talkalakh siegeSiege of Rastan and TalbisehJune Jisr ash-Shughur operationSiege of HamaSiege of HomsJabal al-Zawiya operationSiege of LatakiaDeir ez-Zor clashes (2011–2014)Rif Dimashq clashes (Nov 2011-Mar 2012)Battle of ZabadaniBattle of DoumaDaraa Governorate clashesBattle of RastanShayrat and Tiyas airbase ambushIdlib Governorate clashesDecember Jabal al-Zawiya massacres"
            ],
            [
                "2012Jan–AprMay–AugSep–Dec",
                "January al-Midan bombingBattle of RastanFirst Battle of IdlibBattle of al-QusayrIdlib Governorate operation (Apr)Battle of TaftanazMay Battle of RastanHoula massacreBattle of al-HaffahAl-Qubeir massacreBattle of TremsehBattle of Damascus18 July 2012 Damascus bombingBattle of AleppoBattle of AnadanSiege of Base 46Al-Hasakah Governorate campaign (2012–2013)Rif Dimashq offensive (Aug-Oct)Darayya massacreBattle of Khirbet Al-JozBattle of Maarrat al-NumanFirst siege of Wadi DeifBattle of HaremRif Dimashq offensive (Nov 2012–Feb 2013)Battle of DarayyaAqrab massacreHama offensiveHalfaya massacreBattle of DarayyaQuneitra Governorate clashesTalbiseh bakery massacre"
            ],
            [
                "2013Jan–AprMay–Dec",
                "Battle of SafiraBattle of ShadadehDamascus offensiveRaqqa campaign (2012–2013)Battle of Raqqa (Mar)Daraa offensiveRif Dimashq offensive (Mar–Aug)Battle of Jdaidet al-FadlGhouta chemical attackAl-Qusayr offensiveBattle of al-QusayrBayda and Baniyas massacresHama offensiveHatla massacreKhan al-Assal chemical attackKhan al-Assal massacreAdra massacreBattle of Ras al-AynBattle of Tell AbyadRif Dimashq offensive (Sep–Nov)Aleppo offensive (Oct–Dec)Battle of al-YaarubiyahBattle of Tell Hamis and Tell Brak (Dec–Jan)"
            ],
            [
                "2014Jan–JulAug–Dec",
                "First Inter-rebel conflictBattle of MarkadaDeir ez-Zor offensiveBattle of MorekDaraa offensive (Feb–May)Maan massacreAl-Otaiba ambushIdlib offensiveBattle of HosnLatakia OffensiveBattle of Al-MalihahKafr Zita chemical attackSecond siege of Wadi DeifQalamoun offensive (Jun–Aug)Battle of ArsalFirst Battle of the Shaer gas fieldEastern Syria offensiveBattle of Tabqa AirbaseNorthern Aleppo offensive (Feb–Jul)Hama OffensiveQuneitra offensiveRif Dimashq offensive (Aug–Nov)Siege of KobanîHoms school bombingDaraa offensive (Oct)Al-Safira offensiveIdlib RaidSecond Inter-Rebel ConflictSecond Battle of the Shaer gas fieldBattle of Al-Shaykh MaskinDeir ez-Zor offensive (Dec)"
            ],
            [
                "2015Jan–JulAug–Dec",
                "Air Force An-26 crashDaraa Offensive (Jan)Southern Syria OffensiveEastern al-Hasakah offensiveBattle of Sarrin (Mar–Apr)Battle of Sarrin (Jun–Jul)Battle of BosraIdlib OffensiveSecond Battle of IdlibBattle of Nasib Border CrossingBattle of Yarmouk CampWestern al-Hasakah offensivePalmyra offensive (May)Qamishli bombingsTell Abyad offensiveKobanî massacreQuneitra offensive (Jun)Palmyra offensive (Jul–Aug)Rif Dimashq offensive (Sep)Northwestern Syria offensive (Oct–Nov)Aleppo offensive (Oct–Dec)Al-Hawl offensiveHoms offensive (Nov-Dec)East Aleppo offensive (2015–2016)2015–2016 Latakia offensiveTishrin Dam offensiveRussian Sukhoi Su-24 shootdown"
            ],
            [
                "2016Jan–AprMay–AugSep–Dec",
                "Second Battle of Al-Shaykh MaskinDeir ez-Zor offensive (Jan)January Sayyidah Zaynab bombingsNorthern Aleppo offensive (Feb)Ithriyah-Raqqa offensive (Feb–Mar)Al-Shaddadi offensiveFebruary Homs bombingsFebruary Sayyidah Zaynab bombingsKhanasir offensiveBattle of Tel AbyadBattle of Maarrat al-NumanBattle of Qamishli (Apr)Northern Aleppo offensive (Mar–Jun)Palmyra offensive (Mar)East Ghouta inter-rebel conflict (Apr–May)Rif Dimashq offensive (Apr–May)Northern Raqqa offensive (May)May Jableh & Tartous bombingsIthriyah-Raqqa offensive (Jun)Rif Dimashq offensive (Jun–Oct)Manbij offensiveTokhar massacreSouthern Aleppo campaignBattle of al-Rai (Aug)Operation Euphrates ShieldAleppo summer campaignWestern al-Bab offensive (Sep)5 September bombingsSeptember Deir ez-Zor air raidSeptember Urum al-Kubra aid convoy attackAleppo offensive (Sep–Oct)Dabiq offensiveWestern al-Bab offensive (Oct–Nov)Khan al-Shih offensive (Oct–Nov)Raqqa campaignBattle of al-BabAleppo offensive (Nov-Dec)Palmyra offensive (Dec)"
            ],
            [
                "2017Jan–AprMay–AugSep–Dec",
                "Wadi Barada offensive (2016–2017)January Azaz bombingDesert campaign (Dec 16–Apr 17)Idlib clashes (Jan–Mar)Deir ez-Zor offensive (Jan–Feb)Daraa offensive (Feb–Jun)Southwestern Daraa offensive (Feb)Qaboun offensivePalmyra offensiveEast Aleppo offensive (Jan–Apr)March Damascus bombingsAl-Jinah airstrikeHama offensive (Mar–Apr)Battle of TabqaKhan Shaykhun chemical attackShayrat missile strikeAleppo bombingApril Turkish airstrikesEast Ghouta inter-rebel conflict (Apr–May)Desert campaign (May–Jul)Maskanah Plains offensiveEast Hama offensiveBattle of RaqqaDaraa offensive (Jun)Southern Raqqa offensive (Jun)Jobar offensive (Jun–Aug)Quneitra offensive (Jun)Idlib clashes (Jul)Central campaignQalamoun (Jul–Aug)Deir ez-Zor offensive (Sep 17–Mar 18)Hama offensive (Sep)Northwestern campaign (Oct 17–Feb 18)Turkish military operation in Idlib GovernorateBattle of HarastaEastern campaign (Sep–Dec)Euphrates Crossing offensiveMayadin offensiveBattle of Deir ez-Zor (Sep–Nov)Abu Kamal offensiveBeit Jinn offensive"
            ],
            [
                "2018Jan–AprMay–AugSep–Dec",
                "Operation Olive BranchBattle of KhashamRif Dimashq offensive (Feb–Apr)Southern Damascus offensive (Jan–Feb)Syrian Liberation Front–Tahrir al-Sham conflictSouthern Damascus offensive (Mar)Douma chemical attackMissile strikes (Apr)Northern Homs offensive (Apr–May)Eastern Qalamoun offensive (Apr)Southern Damascus offensive (Apr–May)Deir ez-Zor clashes (Apr)Deir ez-Zor offensive (May–Jun)As-Suwayda offensive (Jun)Southern offensiveAs-Suwayda attacksAs-Suwayda (Aug-Nov)Qamishli clashes (Sep)Missile strikes (Sep)Northern border clashes"
            ],
            [
                "2019Jan–AprMay–AugSep–Dec",
                "Idlib inter-rebel conflictManbij bombingBattle of Baghuz FawqaniISIL insurgency in Deir-ez-ZorDêrik prison escape attemptTell Rifaat clashesNorthwestern offensive (Apr–Aug)June bombingsHass refugee camp bombingMissile strikes (Aug)Turkish offensive into northeastBarisha raidNovember bombingsIsraeli missile strikes (Nov)Qah missile strikeNorthwestern offensive (Dec 19–Mar 20)US airstrikes"
            ],
            [
                "2020Jan–Dec",
                "COVID-19 pandemicAfrin bombingIdlib Governorate clashesKafr-Takharim airstrikeAyn Issa clashesDeir ez-Zor ambush"
            ],
            [
                "2021Jan–Dec",
                "Siege of Qamishli and Al-HasakahMissile strikes (Jan)US airstrike (Feb)Battle of Qamishli (Apr)US airstrike (Jun)Daraa clashesTahrir al-Sham–Junud al-Sham conflict"
            ],
            [
                "2022Jan–Dec",
                "Battle of al-HasakahAhrar al-Sham–Levant Front clashesJabal al-Bishrī clashesJarqli airstrikesNorthern Aleppo clashes (Oct)Operation Claw-SwordNorthwest clashes (Dec)"
            ],
            [
                "2023Jan-Dec",
                "Al-Sukhnah attackDamascus airstrikeHama attackNorthern border clashes"
            ],
            [
                "2024Jan–OctNov–present",
                "Opposition offensivesDeir ez-Zor offensiveBattle of AleppoAleppo University Hospital airstrikeSouthern offensiveOperation Dawn of FreedomManbij offensiveAl-Mustariha strikeKobani clashesHama offensiveHoms offensivePalmyra offensiveFall of DamascusFall of the Assad regimeWestern Syria clashesMassacres of Syrian AlawitesHezbollah-Syria clashesJaramana clashesLebanon–Syria border clashesRif Dimashq clashesMassacres of Syrian DruzeIsraeli invasion"
            ],
            [
                "Spillover",
                "Israel and Golan Heights:March 2017 incidentFebruary 2018 incidentMay 2018 Israel–Iran incidentsIraq:Akashat ambushOperation al-ShabahApril 2014 Iraqi border airstrikeJordanian border incidentsApril 2014 Jordanian border airstrikeLebanon:Lebanese border clashesBattle of SidonIranian embassy bombing in BeirutNorth Lebanon clashesQalamoun (Jul–Aug 2017)Turkey:December 2011 Turkish border clash2012 Turkish F-4 Phantom shootdown2012 Turkish border clashes2013 Reyhanlı car bombingsJanuary 2014 Turkish attack in SyriaAssassination of Andrei KarlovRussian Air Force Al-Bab incident2020 Balyun airstrikesOperation Spring ShieldElsewhere:Deir ez-Zor missile strike(Iran)",
                "Israel and Golan Heights:",
                "March 2017 incidentFebruary 2018 incidentMay 2018 Israel–Iran incidents",
                "Iraq:",
                "Akashat ambushOperation al-ShabahApril 2014 Iraqi border airstrike",
                "Jordanian border incidents",
                "April 2014 Jordanian border airstrike",
                "Lebanon:",
                "Lebanese border clashesBattle of SidonIranian embassy bombing in BeirutNorth Lebanon clashesQalamoun (Jul–Aug 2017)",
                "Turkey:",
                "December 2011 Turkish border clash2012 Turkish F-4 Phantom shootdown2012 Turkish border clashes2013 Reyhanlı car bombingsJanuary 2014 Turkish attack in SyriaAssassination of Andrei KarlovRussian Air Force Al-Bab incident2020 Balyun airstrikesOperation Spring Shield",
                "Elsewhere:",
                "Deir ez-Zor missile strike(Iran)"
            ],
            [
                "Israel and Golan Heights:",
                "March 2017 incidentFebruary 2018 incidentMay 2018 Israel–Iran incidents"
            ],
            [
                "Iraq:",
                "Akashat ambushOperation al-ShabahApril 2014 Iraqi border airstrike"
            ],
            [
                "Jordanian border incidents",
                "April 2014 Jordanian border airstrike"
            ],
            [
                "Lebanon:",
                "Lebanese border clashesBattle of SidonIranian embassy bombing in BeirutNorth Lebanon clashesQalamoun (Jul–Aug 2017)"
            ],
            [
                "Turkey:",
                "December 2011 Turkish border clash2012 Turkish F-4 Phantom shootdown2012 Turkish border clashes2013 Reyhanlı car bombingsJanuary 2014 Turkish attack in SyriaAssassination of Andrei KarlovRussian Air Force Al-Bab incident2020 Balyun airstrikesOperation Spring Shield"
            ],
            [
                "Elsewhere:",
                "Deir ez-Zor missile strike(Iran)"
            ]
        ]
    },
    {
        "heading": "References",
        "table": [
            [
                "Iraq:",
                "Akashat ambushOperation al-ShabahApril 2014 Iraqi border airstrike"
            ],
            [
                "Jordanian border incidents",
                "April 2014 Jordanian border airstrike"
            ],
            [
                "Lebanon:",
                "Lebanese border clashesBattle of SidonIranian embassy bombing in BeirutNorth Lebanon clashesQalamoun (Jul–Aug 2017)"
            ],
            [
                "Turkey:",
                "December 2011 Turkish border clash2012 Turkish F-4 Phantom shootdown2012 Turkish border clashes2013 Reyhanlı car bombingsJanuary 2014 Turkish attack in SyriaAssassination of Andrei KarlovRussian Air Force Al-Bab incident2020 Balyun airstrikesOperation Spring Shield"
            ],
            [
                "Elsewhere:",
                "Deir ez-Zor missile strike(Iran)"
            ]
        ]
    },
    {
        "heading": "References",
        "table": [
            [
                "Ba'athist regimePolitics of Ba'athist SyriaArab Socialist Ba'ath Party – Syria RegionBa'ath BrigadesSyrian Social Nationalist PartyArab Socialist MovementSyrian Communist PartySyrian Communist Party (Unified)Military and militiasLions of HusseinGuardians of the DawnArab Nationalist GuardJaysh al-MuwahhidinSootoroBa'ath BrigadesNational Defence ForcesPopular CommitteesGolan RegimentSyrian Armed ForcesEagles of the WhirlwindThe Islamic Resistance Front in SyriaMilitary Council for the Liberation of SyriaSyrian Popular ResistanceSyrian ResistancePopular Resistance of the Eastern RegionPFLP-GCJihad Jibril BrigadesGalilee ForcesFree Palestine MovementPalestinian People's PartyLiwa FatemiyounAs-Sa'iqaal-Quds BrigadePalestine Liberation ArmyForeign supportHezbollah involvementIranian involvementLiwa FatemiyounRussian involvementmedical facility targetingmilitary interventionWagner GroupRussia–Syria–Iran–Iraq coalitionPopular Mobilization ForcesOppositionInterim governmentNational CoalitionLocal Coordination CommitteesSyrian National CouncilSupreme Council of the Syrian RevolutionNational Coordination Committee for Democratic ChangeSyrian Revolution General CommissionSyrian Support GroupAdopt a RevolutionSyrian Patriotic GroupOpposition militiasSyrian National ArmyFree Syrian ArmyNational Front for LiberationArmy of GloryAuthenticity and Development FrontArmy of Free TribesRevolutionary Commando ArmyMuslim Brotherhood in SyriaGrey WolvesForeign supportUS interventionJordanian interventionQatarSaudi ArabiaTurkeyAutonomous Administrationof North and East SyriaDFNS GovernmentDemocratic Union PartyKurdish National CouncilSmaller political partiesSDF militiasPeople's Protection UnitsWomen's Protection UnitsAnti-Terror UnitsAl-Sanadid ForcesArmy of RevolutionariesSDF military councilsSyriac Military CouncilLiwa Thuwar al-RaqqaNorthern Democratic BrigadeSupportPatriotic Union of KurdistanKurdistan Workers' PartyInternational Freedom BattalionSinjar Resistance UnitsÊzîdxan Women's UnitsIslamistsIslamic StateMilitary activity of ISILDokumacılarAl-BarakahKhalid ibn al-Walid ArmyYarmouk Martyrs BrigadeIslamic Muthanna MovementJaysh al-JihadJund al-AqsaGroup of the One and OnlyLiwa DawudLiwa Aqab al-IslamiKatibah NusantaraKatiba al-Bittar al-LibiAl-Khansaa Brigadeal-Qaedaand alliesAl-Nusra Front(Jabhat Fatah al-Sham(Khorasan group,Suqour al-Ezz)Jaysh Muhammad in Bilad al-ShamTahrir al-ShamTurkistan Islamic Party in SyriaCaucasus EmirateAjnad al-KavkazJunud al-MakhdiRouse the Believers Operations Room(Ansar al-Tawhid(Firqat al-Ghuraba),Hurras al-Din,Ansar al-Din Front(Harakat Sham al-Islam),Ansar al-Islam in Kurdistan)Jaish al-HaramounJaysh al-SunnaLiwa al-Muhajireen wal-Ansar(Green Battalion)Mujahideen Shura CouncilMalhama TacticalKatibat al-Tawhid wal-JihadKatibat Jabal al-IslamJama'at Ansar al-Furqan in Bilad al ShamGhuraba al-ShamTaliban(Pakistani Taliban,Imam Bukhari Jamaat)Fatah al-IslamMuhajirin wa-Ansar Alliance(Liwaa al-Umma)",
                "Ba'athist regime",
                "Politics of Ba'athist SyriaArab Socialist Ba'ath Party – Syria RegionBa'ath BrigadesSyrian Social Nationalist PartyArab Socialist MovementSyrian Communist PartySyrian Communist Party (Unified)Military and militiasLions of HusseinGuardians of the DawnArab Nationalist GuardJaysh al-MuwahhidinSootoroBa'ath BrigadesNational Defence ForcesPopular CommitteesGolan RegimentSyrian Armed ForcesEagles of the WhirlwindThe Islamic Resistance Front in SyriaMilitary Council for the Liberation of SyriaSyrian Popular ResistanceSyrian ResistancePopular Resistance of the Eastern RegionPFLP-GCJihad Jibril BrigadesGalilee ForcesFree Palestine MovementPalestinian People's PartyLiwa FatemiyounAs-Sa'iqaal-Quds BrigadePalestine Liberation ArmyForeign supportHezbollah involvementIranian involvementLiwa FatemiyounRussian involvementmedical facility targetingmilitary interventionWagner GroupRussia–Syria–Iran–Iraq coalitionPopular Mobilization Forces",
                "Politics of Ba'athist Syria",
                "Arab Socialist Ba'ath Party – Syria RegionBa'ath BrigadesSyrian Social Nationalist PartyArab Socialist MovementSyrian Communist PartySyrian Communist Party (Unified)",
                "Military and militias",
                "Lions of HusseinGuardians of the DawnArab Nationalist GuardJaysh al-MuwahhidinSootoroBa'ath BrigadesNational Defence ForcesPopular CommitteesGolan RegimentSyrian Armed ForcesEagles of the WhirlwindThe Islamic Resistance Front in SyriaMilitary Council for the Liberation of SyriaSyrian Popular ResistanceSyrian ResistancePopular Resistance of the Eastern RegionPFLP-GCJihad Jibril BrigadesGalilee ForcesFree Palestine MovementPalestinian People's PartyLiwa FatemiyounAs-Sa'iqaal-Quds BrigadePalestine Liberation Army",
                "Foreign support",
                "Hezbollah involvementIranian involvementLiwa FatemiyounRussian involvementmedical facility targetingmilitary interventionWagner GroupRussia–Syria–Iran–Iraq coalitionPopular Mobilization Forces",
                "Opposition",
                "Interim governmentNational CoalitionLocal Coordination CommitteesSyrian National CouncilSupreme Council of the Syrian RevolutionNational Coordination Committee for Democratic ChangeSyrian Revolution General CommissionSyrian Support GroupAdopt a RevolutionSyrian Patriotic GroupOpposition militiasSyrian National ArmyFree Syrian ArmyNational Front for LiberationArmy of GloryAuthenticity and Development FrontArmy of Free TribesRevolutionary Commando ArmyMuslim Brotherhood in SyriaGrey WolvesForeign supportUS interventionJordanian interventionQatarSaudi ArabiaTurkey",
                "Interim government",
                "National CoalitionLocal Coordination CommitteesSyrian National CouncilSupreme Council of the Syrian RevolutionNational Coordination Committee for Democratic ChangeSyrian Revolution General CommissionSyrian Support GroupAdopt a RevolutionSyrian Patriotic Group",
                "Opposition militias",
                "Syrian National ArmyFree Syrian ArmyNational Front for LiberationArmy of GloryAuthenticity and Development FrontArmy of Free TribesRevolutionary Commando ArmyMuslim Brotherhood in SyriaGrey Wolves",
                "Foreign support",
                "US interventionJordanian interventionQatarSaudi ArabiaTurkey",
                "Autonomous Administrationof North and East Syria",
                "DFNS GovernmentDemocratic Union PartyKurdish National CouncilSmaller political partiesSDF militiasPeople's Protection UnitsWomen's Protection UnitsAnti-Terror UnitsAl-Sanadid ForcesArmy of RevolutionariesSDF military councilsSyriac Military CouncilLiwa Thuwar al-RaqqaNorthern Democratic BrigadeSupportPatriotic Union of KurdistanKurdistan Workers' PartyInternational Freedom BattalionSinjar Resistance UnitsÊzîdxan Women's Units",
                "DFNS Government",
                "Democratic Union PartyKurdish National CouncilSmaller political parties",
                "SDF militias",
                "People's Protection UnitsWomen's Protection UnitsAnti-Terror UnitsAl-Sanadid ForcesArmy of RevolutionariesSDF military councilsSyriac Military CouncilLiwa Thuwar al-RaqqaNorthern Democratic Brigade",
                "Support",
                "Patriotic Union of KurdistanKurdistan Workers' PartyInternational Freedom BattalionSinjar Resistance UnitsÊzîdxan Women's Units",
                "Islamists",
                "Islamic StateMilitary activity of ISILDokumacılarAl-BarakahKhalid ibn al-Walid ArmyYarmouk Martyrs BrigadeIslamic Muthanna MovementJaysh al-JihadJund al-AqsaGroup of the One and OnlyLiwa DawudLiwa Aqab al-IslamiKatibah NusantaraKatiba al-Bittar al-LibiAl-Khansaa Brigadeal-Qaedaand alliesAl-Nusra Front(Jabhat Fatah al-Sham(Khorasan group,Suqour al-Ezz)Jaysh Muhammad in Bilad al-ShamTahrir al-ShamTurkistan Islamic Party in SyriaCaucasus EmirateAjnad al-KavkazJunud al-MakhdiRouse the Believers Operations Room(Ansar al-Tawhid(Firqat al-Ghuraba),Hurras al-Din,Ansar al-Din Front(Harakat Sham al-Islam),Ansar al-Islam in Kurdistan)Jaish al-HaramounJaysh al-SunnaLiwa al-Muhajireen wal-Ansar(Green Battalion)Mujahideen Shura CouncilMalhama TacticalKatibat al-Tawhid wal-JihadKatibat Jabal al-IslamJama'at Ansar al-Furqan in Bilad al ShamGhuraba al-ShamTaliban(Pakistani Taliban,Imam Bukhari Jamaat)Fatah al-IslamMuhajirin wa-Ansar Alliance(Liwaa al-Umma)",
                "Islamic State",
                "Military activity of ISILDokumacılarAl-BarakahKhalid ibn al-Walid ArmyYarmouk Martyrs BrigadeIslamic Muthanna MovementJaysh al-JihadJund al-AqsaGroup of the One and OnlyLiwa DawudLiwa Aqab al-IslamiKatibah NusantaraKatiba al-Bittar al-LibiAl-Khansaa Brigade",
                "al-Qaedaand allies",
                "Al-Nusra Front(Jabhat Fatah al-Sham(Khorasan group,Suqour al-Ezz)Jaysh Muhammad in Bilad al-ShamTahrir al-ShamTurkistan Islamic Party in SyriaCaucasus EmirateAjnad al-KavkazJunud al-MakhdiRouse the Believers Operations Room(Ansar al-Tawhid(Firqat al-Ghuraba),Hurras al-Din,Ansar al-Din Front(Harakat Sham al-Islam),Ansar al-Islam in Kurdistan)Jaish al-HaramounJaysh al-SunnaLiwa al-Muhajireen wal-Ansar(Green Battalion)Mujahideen Shura CouncilMalhama TacticalKatibat al-Tawhid wal-JihadKatibat Jabal al-IslamJama'at Ansar al-Furqan in Bilad al ShamGhuraba al-ShamTaliban(Pakistani Taliban,Imam Bukhari Jamaat)Fatah al-IslamMuhajirin wa-Ansar Alliance(Liwaa al-Umma)"
            ],
            [
                "Ba'athist regime",
                "Politics of Ba'athist SyriaArab Socialist Ba'ath Party – Syria RegionBa'ath BrigadesSyrian Social Nationalist PartyArab Socialist MovementSyrian Communist PartySyrian Communist Party (Unified)Military and militiasLions of HusseinGuardians of the DawnArab Nationalist GuardJaysh al-MuwahhidinSootoroBa'ath BrigadesNational Defence ForcesPopular CommitteesGolan RegimentSyrian Armed ForcesEagles of the WhirlwindThe Islamic Resistance Front in SyriaMilitary Council for the Liberation of SyriaSyrian Popular ResistanceSyrian ResistancePopular Resistance of the Eastern RegionPFLP-GCJihad Jibril BrigadesGalilee ForcesFree Palestine MovementPalestinian People's PartyLiwa FatemiyounAs-Sa'iqaal-Quds BrigadePalestine Liberation ArmyForeign supportHezbollah involvementIranian involvementLiwa FatemiyounRussian involvementmedical facility targetingmilitary interventionWagner GroupRussia–Syria–Iran–Iraq coalitionPopular Mobilization Forces",
                "Politics of Ba'athist Syria",
                "Arab Socialist Ba'ath Party – Syria RegionBa'ath BrigadesSyrian Social Nationalist PartyArab Socialist MovementSyrian Communist PartySyrian Communist Party (Unified)",
                "Military and militias",
                "Lions of HusseinGuardians of the DawnArab Nationalist GuardJaysh al-MuwahhidinSootoroBa'ath BrigadesNational Defence ForcesPopular CommitteesGolan RegimentSyrian Armed ForcesEagles of the WhirlwindThe Islamic Resistance Front in SyriaMilitary Council for the Liberation of SyriaSyrian Popular ResistanceSyrian ResistancePopular Resistance of the Eastern RegionPFLP-GCJihad Jibril BrigadesGalilee ForcesFree Palestine MovementPalestinian People's PartyLiwa FatemiyounAs-Sa'iqaal-Quds BrigadePalestine Liberation Army",
                "Foreign support",
                "Hezbollah involvementIranian involvementLiwa FatemiyounRussian involvementmedical facility targetingmilitary interventionWagner GroupRussia–Syria–Iran–Iraq coalitionPopular Mobilization Forces"
            ],
            [
                "Politics of Ba'athist Syria",
                "Arab Socialist Ba'ath Party – Syria RegionBa'ath BrigadesSyrian Social Nationalist PartyArab Socialist MovementSyrian Communist PartySyrian Communist Party (Unified)"
            ],
            [
                "Military and militias",
                "Lions of HusseinGuardians of the DawnArab Nationalist GuardJaysh al-MuwahhidinSootoroBa'ath BrigadesNational Defence ForcesPopular CommitteesGolan RegimentSyrian Armed ForcesEagles of the WhirlwindThe Islamic Resistance Front in SyriaMilitary Council for the Liberation of SyriaSyrian Popular ResistanceSyrian ResistancePopular Resistance of the Eastern RegionPFLP-GCJihad Jibril BrigadesGalilee ForcesFree Palestine MovementPalestinian People's PartyLiwa FatemiyounAs-Sa'iqaal-Quds BrigadePalestine Liberation Army"
            ],
            [
                "Foreign support",
                "Hezbollah involvementIranian involvementLiwa FatemiyounRussian involvementmedical facility targetingmilitary interventionWagner GroupRussia–Syria–Iran–Iraq coalitionPopular Mobilization Forces"
            ],
            [
                "Opposition",
                "Interim governmentNational CoalitionLocal Coordination CommitteesSyrian National CouncilSupreme Council of the Syrian RevolutionNational Coordination Committee for Democratic ChangeSyrian Revolution General CommissionSyrian Support GroupAdopt a RevolutionSyrian Patriotic GroupOpposition militiasSyrian National ArmyFree Syrian ArmyNational Front for LiberationArmy of GloryAuthenticity and Development FrontArmy of Free TribesRevolutionary Commando ArmyMuslim Brotherhood in SyriaGrey WolvesForeign supportUS interventionJordanian interventionQatarSaudi ArabiaTurkey",
                "Interim government",
                "National CoalitionLocal Coordination CommitteesSyrian National CouncilSupreme Council of the Syrian RevolutionNational Coordination Committee for Democratic ChangeSyrian Revolution General CommissionSyrian Support GroupAdopt a RevolutionSyrian Patriotic Group",
                "Opposition militias",
                "Syrian National ArmyFree Syrian ArmyNational Front for LiberationArmy of GloryAuthenticity and Development FrontArmy of Free TribesRevolutionary Commando ArmyMuslim Brotherhood in SyriaGrey Wolves",
                "Foreign support",
                "US interventionJordanian interventionQatarSaudi ArabiaTurkey"
            ],
            [
                "Interim government",
                "National CoalitionLocal Coordination CommitteesSyrian National CouncilSupreme Council of the Syrian RevolutionNational Coordination Committee for Democratic ChangeSyrian Revolution General CommissionSyrian Support GroupAdopt a RevolutionSyrian Patriotic Group"
            ],
            [
                "Opposition militias",
                "Syrian National ArmyFree Syrian ArmyNational Front for LiberationArmy of GloryAuthenticity and Development FrontArmy of Free TribesRevolutionary Commando ArmyMuslim Brotherhood in SyriaGrey Wolves"
            ],
            [
                "Foreign support",
                "US interventionJordanian interventionQatarSaudi ArabiaTurkey"
            ],
            [
                "Autonomous Administrationof North and East Syria",
                "DFNS GovernmentDemocratic Union PartyKurdish National CouncilSmaller political partiesSDF militiasPeople's Protection UnitsWomen's Protection UnitsAnti-Terror UnitsAl-Sanadid ForcesArmy of RevolutionariesSDF military councilsSyriac Military CouncilLiwa Thuwar al-RaqqaNorthern Democratic BrigadeSupportPatriotic Union of KurdistanKurdistan Workers' PartyInternational Freedom BattalionSinjar Resistance UnitsÊzîdxan Women's Units",
                "DFNS Government",
                "Democratic Union PartyKurdish National CouncilSmaller political parties",
                "SDF militias",
                "People's Protection UnitsWomen's Protection UnitsAnti-Terror UnitsAl-Sanadid ForcesArmy of RevolutionariesSDF military councilsSyriac Military CouncilLiwa Thuwar al-RaqqaNorthern Democratic Brigade",
                "Support",
                "Patriotic Union of KurdistanKurdistan Workers' PartyInternational Freedom BattalionSinjar Resistance UnitsÊzîdxan Women's Units"
            ],
            [
                "DFNS Government",
                "Democratic Union PartyKurdish National CouncilSmaller political parties"
            ],
            [
                "SDF militias",
                "People's Protection UnitsWomen's Protection UnitsAnti-Terror UnitsAl-Sanadid ForcesArmy of RevolutionariesSDF military councilsSyriac Military CouncilLiwa Thuwar al-RaqqaNorthern Democratic Brigade"
            ],
            [
                "Support",
                "Patriotic Union of KurdistanKurdistan Workers' PartyInternational Freedom BattalionSinjar Resistance UnitsÊzîdxan Women's Units"
            ],
            [
                "Islamists",
                "Islamic StateMilitary activity of ISILDokumacılarAl-BarakahKhalid ibn al-Walid ArmyYarmouk Martyrs BrigadeIslamic Muthanna MovementJaysh al-JihadJund al-AqsaGroup of the One and OnlyLiwa DawudLiwa Aqab al-IslamiKatibah NusantaraKatiba al-Bittar al-LibiAl-Khansaa Brigadeal-Qaedaand alliesAl-Nusra Front(Jabhat Fatah al-Sham(Khorasan group,Suqour al-Ezz)Jaysh Muhammad in Bilad al-ShamTahrir al-ShamTurkistan Islamic Party in SyriaCaucasus EmirateAjnad al-KavkazJunud al-MakhdiRouse the Believers Operations Room(Ansar al-Tawhid(Firqat al-Ghuraba),Hurras al-Din,Ansar al-Din Front(Harakat Sham al-Islam),Ansar al-Islam in Kurdistan)Jaish al-HaramounJaysh al-SunnaLiwa al-Muhajireen wal-Ansar(Green Battalion)Mujahideen Shura CouncilMalhama TacticalKatibat al-Tawhid wal-JihadKatibat Jabal al-IslamJama'at Ansar al-Furqan in Bilad al ShamGhuraba al-ShamTaliban(Pakistani Taliban,Imam Bukhari Jamaat)Fatah al-IslamMuhajirin wa-Ansar Alliance(Liwaa al-Umma)",
                "Islamic State",
                "Military activity of ISILDokumacılarAl-BarakahKhalid ibn al-Walid ArmyYarmouk Martyrs BrigadeIslamic Muthanna MovementJaysh al-JihadJund al-AqsaGroup of the One and OnlyLiwa DawudLiwa Aqab al-IslamiKatibah NusantaraKatiba al-Bittar al-LibiAl-Khansaa Brigade",
                "al-Qaedaand allies",
                "Al-Nusra Front(Jabhat Fatah al-Sham(Khorasan group,Suqour al-Ezz)Jaysh Muhammad in Bilad al-ShamTahrir al-ShamTurkistan Islamic Party in SyriaCaucasus EmirateAjnad al-KavkazJunud al-MakhdiRouse the Believers Operations Room(Ansar al-Tawhid(Firqat al-Ghuraba),Hurras al-Din,Ansar al-Din Front(Harakat Sham al-Islam),Ansar al-Islam in Kurdistan)Jaish al-HaramounJaysh al-SunnaLiwa al-Muhajireen wal-Ansar(Green Battalion)Mujahideen Shura CouncilMalhama TacticalKatibat al-Tawhid wal-JihadKatibat Jabal al-IslamJama'at Ansar al-Furqan in Bilad al ShamGhuraba al-ShamTaliban(Pakistani Taliban,Imam Bukhari Jamaat)Fatah al-IslamMuhajirin wa-Ansar Alliance(Liwaa al-Umma)"
            ],
            [
                "Islamic State",
                "Military activity of ISILDokumacılarAl-BarakahKhalid ibn al-Walid ArmyYarmouk Martyrs BrigadeIslamic Muthanna MovementJaysh al-JihadJund al-AqsaGroup of the One and OnlyLiwa DawudLiwa Aqab al-IslamiKatibah NusantaraKatiba al-Bittar al-LibiAl-Khansaa Brigade"
            ],
            [
                "al-Qaedaand allies",
                "Al-Nusra Front(Jabhat Fatah al-Sham(Khorasan group,Suqour al-Ezz)Jaysh Muhammad in Bilad al-ShamTahrir al-ShamTurkistan Islamic Party in SyriaCaucasus EmirateAjnad al-KavkazJunud al-MakhdiRouse the Believers Operations Room(Ansar al-Tawhid(Firqat al-Ghuraba),Hurras al-Din,Ansar al-Din Front(Harakat Sham al-Islam),Ansar al-Islam in Kurdistan)Jaish al-HaramounJaysh al-SunnaLiwa al-Muhajireen wal-Ansar(Green Battalion)Mujahideen Shura CouncilMalhama TacticalKatibat al-Tawhid wal-JihadKatibat Jabal al-IslamJama'at Ansar al-Furqan in Bilad al ShamGhuraba al-ShamTaliban(Pakistani Taliban,Imam Bukhari Jamaat)Fatah al-IslamMuhajirin wa-Ansar Alliance(Liwaa al-Umma)"
            ]
        ]
    },
    {
        "heading": "References",
        "table": [
            [
                "Politics of Ba'athist Syria",
                "Arab Socialist Ba'ath Party – Syria RegionBa'ath BrigadesSyrian Social Nationalist PartyArab Socialist MovementSyrian Communist PartySyrian Communist Party (Unified)"
            ],
            [
                "Military and militias",
                "Lions of HusseinGuardians of the DawnArab Nationalist GuardJaysh al-MuwahhidinSootoroBa'ath BrigadesNational Defence ForcesPopular CommitteesGolan RegimentSyrian Armed ForcesEagles of the WhirlwindThe Islamic Resistance Front in SyriaMilitary Council for the Liberation of SyriaSyrian Popular ResistanceSyrian ResistancePopular Resistance of the Eastern RegionPFLP-GCJihad Jibril BrigadesGalilee ForcesFree Palestine MovementPalestinian People's PartyLiwa FatemiyounAs-Sa'iqaal-Quds BrigadePalestine Liberation Army"
            ],
            [
                "Foreign support",
                "Hezbollah involvementIranian involvementLiwa FatemiyounRussian involvementmedical facility targetingmilitary interventionWagner GroupRussia–Syria–Iran–Iraq coalitionPopular Mobilization Forces"
            ],
            [
                "Opposition",
                "Interim governmentNational CoalitionLocal Coordination CommitteesSyrian National CouncilSupreme Council of the Syrian RevolutionNational Coordination Committee for Democratic ChangeSyrian Revolution General CommissionSyrian Support GroupAdopt a RevolutionSyrian Patriotic GroupOpposition militiasSyrian National ArmyFree Syrian ArmyNational Front for LiberationArmy of GloryAuthenticity and Development FrontArmy of Free TribesRevolutionary Commando ArmyMuslim Brotherhood in SyriaGrey WolvesForeign supportUS interventionJordanian interventionQatarSaudi ArabiaTurkey",
                "Interim government",
                "National CoalitionLocal Coordination CommitteesSyrian National CouncilSupreme Council of the Syrian RevolutionNational Coordination Committee for Democratic ChangeSyrian Revolution General CommissionSyrian Support GroupAdopt a RevolutionSyrian Patriotic Group",
                "Opposition militias",
                "Syrian National ArmyFree Syrian ArmyNational Front for LiberationArmy of GloryAuthenticity and Development FrontArmy of Free TribesRevolutionary Commando ArmyMuslim Brotherhood in SyriaGrey Wolves",
                "Foreign support",
                "US interventionJordanian interventionQatarSaudi ArabiaTurkey"
            ],
            [
                "Interim government",
                "National CoalitionLocal Coordination CommitteesSyrian National CouncilSupreme Council of the Syrian RevolutionNational Coordination Committee for Democratic ChangeSyrian Revolution General CommissionSyrian Support GroupAdopt a RevolutionSyrian Patriotic Group"
            ],
            [
                "Opposition militias",
                "Syrian National ArmyFree Syrian ArmyNational Front for LiberationArmy of GloryAuthenticity and Development FrontArmy of Free TribesRevolutionary Commando ArmyMuslim Brotherhood in SyriaGrey Wolves"
            ],
            [
                "Foreign support",
                "US interventionJordanian interventionQatarSaudi ArabiaTurkey"
            ],
            [
                "Autonomous Administrationof North and East Syria",
                "DFNS GovernmentDemocratic Union PartyKurdish National CouncilSmaller political partiesSDF militiasPeople's Protection UnitsWomen's Protection UnitsAnti-Terror UnitsAl-Sanadid ForcesArmy of RevolutionariesSDF military councilsSyriac Military CouncilLiwa Thuwar al-RaqqaNorthern Democratic BrigadeSupportPatriotic Union of KurdistanKurdistan Workers' PartyInternational Freedom BattalionSinjar Resistance UnitsÊzîdxan Women's Units",
                "DFNS Government",
                "Democratic Union PartyKurdish National CouncilSmaller political parties",
                "SDF militias",
                "People's Protection UnitsWomen's Protection UnitsAnti-Terror UnitsAl-Sanadid ForcesArmy of RevolutionariesSDF military councilsSyriac Military CouncilLiwa Thuwar al-RaqqaNorthern Democratic Brigade",
                "Support",
                "Patriotic Union of KurdistanKurdistan Workers' PartyInternational Freedom BattalionSinjar Resistance UnitsÊzîdxan Women's Units"
            ],
            [
                "DFNS Government",
                "Democratic Union PartyKurdish National CouncilSmaller political parties"
            ],
            [
                "SDF militias",
                "People's Protection UnitsWomen's Protection UnitsAnti-Terror UnitsAl-Sanadid ForcesArmy of RevolutionariesSDF military councilsSyriac Military CouncilLiwa Thuwar al-RaqqaNorthern Democratic Brigade"
            ],
            [
                "Support",
                "Patriotic Union of KurdistanKurdistan Workers' PartyInternational Freedom BattalionSinjar Resistance UnitsÊzîdxan Women's Units"
            ],
            [
                "Islamists",
                "Islamic StateMilitary activity of ISILDokumacılarAl-BarakahKhalid ibn al-Walid ArmyYarmouk Martyrs BrigadeIslamic Muthanna MovementJaysh al-JihadJund al-AqsaGroup of the One and OnlyLiwa DawudLiwa Aqab al-IslamiKatibah NusantaraKatiba al-Bittar al-LibiAl-Khansaa Brigadeal-Qaedaand alliesAl-Nusra Front(Jabhat Fatah al-Sham(Khorasan group,Suqour al-Ezz)Jaysh Muhammad in Bilad al-ShamTahrir al-ShamTurkistan Islamic Party in SyriaCaucasus EmirateAjnad al-KavkazJunud al-MakhdiRouse the Believers Operations Room(Ansar al-Tawhid(Firqat al-Ghuraba),Hurras al-Din,Ansar al-Din Front(Harakat Sham al-Islam),Ansar al-Islam in Kurdistan)Jaish al-HaramounJaysh al-SunnaLiwa al-Muhajireen wal-Ansar(Green Battalion)Mujahideen Shura CouncilMalhama TacticalKatibat al-Tawhid wal-JihadKatibat Jabal al-IslamJama'at Ansar al-Furqan in Bilad al ShamGhuraba al-ShamTaliban(Pakistani Taliban,Imam Bukhari Jamaat)Fatah al-IslamMuhajirin wa-Ansar Alliance(Liwaa al-Umma)",
                "Islamic State",
                "Military activity of ISILDokumacılarAl-BarakahKhalid ibn al-Walid ArmyYarmouk Martyrs BrigadeIslamic Muthanna MovementJaysh al-JihadJund al-AqsaGroup of the One and OnlyLiwa DawudLiwa Aqab al-IslamiKatibah NusantaraKatiba al-Bittar al-LibiAl-Khansaa Brigade",
                "al-Qaedaand allies",
                "Al-Nusra Front(Jabhat Fatah al-Sham(Khorasan group,Suqour al-Ezz)Jaysh Muhammad in Bilad al-ShamTahrir al-ShamTurkistan Islamic Party in SyriaCaucasus EmirateAjnad al-KavkazJunud al-MakhdiRouse the Believers Operations Room(Ansar al-Tawhid(Firqat al-Ghuraba),Hurras al-Din,Ansar al-Din Front(Harakat Sham al-Islam),Ansar al-Islam in Kurdistan)Jaish al-HaramounJaysh al-SunnaLiwa al-Muhajireen wal-Ansar(Green Battalion)Mujahideen Shura CouncilMalhama TacticalKatibat al-Tawhid wal-JihadKatibat Jabal al-IslamJama'at Ansar al-Furqan in Bilad al ShamGhuraba al-ShamTaliban(Pakistani Taliban,Imam Bukhari Jamaat)Fatah al-IslamMuhajirin wa-Ansar Alliance(Liwaa al-Umma)"
            ],
            [
                "Islamic State",
                "Military activity of ISILDokumacılarAl-BarakahKhalid ibn al-Walid ArmyYarmouk Martyrs BrigadeIslamic Muthanna MovementJaysh al-JihadJund al-AqsaGroup of the One and OnlyLiwa DawudLiwa Aqab al-IslamiKatibah NusantaraKatiba al-Bittar al-LibiAl-Khansaa Brigade"
            ],
            [
                "al-Qaedaand allies",
                "Al-Nusra Front(Jabhat Fatah al-Sham(Khorasan group,Suqour al-Ezz)Jaysh Muhammad in Bilad al-ShamTahrir al-ShamTurkistan Islamic Party in SyriaCaucasus EmirateAjnad al-KavkazJunud al-MakhdiRouse the Believers Operations Room(Ansar al-Tawhid(Firqat al-Ghuraba),Hurras al-Din,Ansar al-Din Front(Harakat Sham al-Islam),Ansar al-Islam in Kurdistan)Jaish al-HaramounJaysh al-SunnaLiwa al-Muhajireen wal-Ansar(Green Battalion)Mujahideen Shura CouncilMalhama TacticalKatibat al-Tawhid wal-JihadKatibat Jabal al-IslamJama'at Ansar al-Furqan in Bilad al ShamGhuraba al-ShamTaliban(Pakistani Taliban,Imam Bukhari Jamaat)Fatah al-IslamMuhajirin wa-Ansar Alliance(Liwaa al-Umma)"
            ]
        ]
    },
    {
        "heading": "References",
        "table": [
            [
                "Military and militias",
                "Lions of HusseinGuardians of the DawnArab Nationalist GuardJaysh al-MuwahhidinSootoroBa'ath BrigadesNational Defence ForcesPopular CommitteesGolan RegimentSyrian Armed ForcesEagles of the WhirlwindThe Islamic Resistance Front in SyriaMilitary Council for the Liberation of SyriaSyrian Popular ResistanceSyrian ResistancePopular Resistance of the Eastern RegionPFLP-GCJihad Jibril BrigadesGalilee ForcesFree Palestine MovementPalestinian People's PartyLiwa FatemiyounAs-Sa'iqaal-Quds BrigadePalestine Liberation Army"
            ],
            [
                "Foreign support",
                "Hezbollah involvementIranian involvementLiwa FatemiyounRussian involvementmedical facility targetingmilitary interventionWagner GroupRussia–Syria–Iran–Iraq coalitionPopular Mobilization Forces"
            ]
        ]
    },
    {
        "heading": "References",
        "table": [
            [
                "Opposition militias",
                "Syrian National ArmyFree Syrian ArmyNational Front for LiberationArmy of GloryAuthenticity and Development FrontArmy of Free TribesRevolutionary Commando ArmyMuslim Brotherhood in SyriaGrey Wolves"
            ],
            [
                "Foreign support",
                "US interventionJordanian interventionQatarSaudi ArabiaTurkey"
            ]
        ]
    },
    {
        "heading": "References",
        "table": [
            [
                "SDF militias",
                "People's Protection UnitsWomen's Protection UnitsAnti-Terror UnitsAl-Sanadid ForcesArmy of RevolutionariesSDF military councilsSyriac Military CouncilLiwa Thuwar al-RaqqaNorthern Democratic Brigade"
            ],
            [
                "Support",
                "Patriotic Union of KurdistanKurdistan Workers' PartyInternational Freedom BattalionSinjar Resistance UnitsÊzîdxan Women's Units"
            ]
        ]
    },
    {
        "heading": "References",
        "table": [
            [
                "al-Qaedaand allies",
                "Al-Nusra Front(Jabhat Fatah al-Sham(Khorasan group,Suqour al-Ezz)Jaysh Muhammad in Bilad al-ShamTahrir al-ShamTurkistan Islamic Party in SyriaCaucasus EmirateAjnad al-KavkazJunud al-MakhdiRouse the Believers Operations Room(Ansar al-Tawhid(Firqat al-Ghuraba),Hurras al-Din,Ansar al-Din Front(Harakat Sham al-Islam),Ansar al-Islam in Kurdistan)Jaish al-HaramounJaysh al-SunnaLiwa al-Muhajireen wal-Ansar(Green Battalion)Mujahideen Shura CouncilMalhama TacticalKatibat al-Tawhid wal-JihadKatibat Jabal al-IslamJama'at Ansar al-Furqan in Bilad al ShamGhuraba al-ShamTaliban(Pakistani Taliban,Imam Bukhari Jamaat)Fatah al-IslamMuhajirin wa-Ansar Alliance(Liwaa al-Umma)"
            ]
        ]
    },
    {
        "heading": "References",
        "table": [
            {
                "People": "Ammar AbdulhamidAli al-AbdallahAdnan al-Arooral-Assad familyBasharMaherRifaatRami MakhloufHafez MakhloufRiad al-AsaadHadi al-BahraAnwar al-BunniFahd Jassem al-FreijSuheil al-HassanHaitham al-MalehMoaz al-KhatibKamal al-LabwaniHamza al-KhateebTal al-MallohiFida al-SayedRiad al-TurkKhaled KhojaAmmar al-QurabiSuheir AtassiAli Sadreddine Al-BayanouniAref DalilaFarid GhadryBurhan GhaliounRazan GhazzawiGhassan HittoSalim IdrisRanda KassisAbdul Halim KhaddamMichel KiloBassma KodmaniAli Habib MahmudAli Mahmoud OthmanIbrahim QashoushDawoud RajihaYassin al-Haj SalehBouthaina ShaabanAhmed al-SharaaAbdulbaset SiedaRiad SeifFadwa SouleimaneMohamad Anas Haitham SoueidYaser TabbaraRazan ZaitounehRami JarrahAbdurrahman MustafaFadlallah al-Haji"
            }
        ]
    },
    {
        "heading": "References",
        "table": [
            [
                "Elections2011 local elections2012 parliamentary election2014 presidential election2015 Northern local elections2016 parliamentary election2017 Northern local elections2017 Northern regional elections2018 local elections2020 parliamentary election2021 presidential electionIssuesCasualtiesCities and townsChemical weaponsDamaged heritage sitesForeign involvementHuman rights violationsHumanitarian aidInternational demonstrations and protestsInternational reactionsMassacresMass gravesRefugeesSectarianism and minoritiesStatus of the Golan HeightsSpillover in LebanonSyrian government reactionsPeace processArab League monitorsFriends of Syria GroupKofi Annan peace planUN supervision missionLakhdar Brahimi peace planU.S.–Russia peace proposals39th G8 summitUN Security Council Resolution 2118Geneva II conference2015 Zabadani cease-fire agreementVienna talks2016 Geneva talksIdlib demilitarization (2018–present)First Northern Syria Demilitarization DealSecond Northern Syria Demilitarization DealSyrian Negotiation CommissionSyrian Constitutional CommitteeInvestigations/legal casesInvestigationsInternational CommissionChemical weaponsWar crimes casesGermanyCanada + Netherlands vs SyriaRelated topicsExclusive mandateFourth Extraordinary Session of the Islamic Summit ConferenceSyria FilesSyrian detainee reportSyrian media coverage2015 European migrant crisisSyrian civil war in popular culture",
                "Elections",
                "2011 local elections2012 parliamentary election2014 presidential election2015 Northern local elections2016 parliamentary election2017 Northern local elections2017 Northern regional elections2018 local elections2020 parliamentary election2021 presidential election",
                "Issues",
                "CasualtiesCities and townsChemical weaponsDamaged heritage sitesForeign involvementHuman rights violationsHumanitarian aidInternational demonstrations and protestsInternational reactionsMassacresMass gravesRefugeesSectarianism and minoritiesStatus of the Golan HeightsSpillover in LebanonSyrian government reactions",
                "Peace process",
                "Arab League monitorsFriends of Syria GroupKofi Annan peace planUN supervision missionLakhdar Brahimi peace planU.S.–Russia peace proposals39th G8 summitUN Security Council Resolution 2118Geneva II conference2015 Zabadani cease-fire agreementVienna talks2016 Geneva talksIdlib demilitarization (2018–present)First Northern Syria Demilitarization DealSecond Northern Syria Demilitarization DealSyrian Negotiation CommissionSyrian Constitutional Committee",
                "Investigations/legal cases",
                "InvestigationsInternational CommissionChemical weaponsWar crimes casesGermanyCanada + Netherlands vs Syria",
                "Related topics",
                "Exclusive mandateFourth Extraordinary Session of the Islamic Summit ConferenceSyria FilesSyrian detainee reportSyrian media coverage2015 European migrant crisisSyrian civil war in popular culture"
            ],
            [
                "Elections",
                "2011 local elections2012 parliamentary election2014 presidential election2015 Northern local elections2016 parliamentary election2017 Northern local elections2017 Northern regional elections2018 local elections2020 parliamentary election2021 presidential election"
            ],
            [
                "Issues",
                "CasualtiesCities and townsChemical weaponsDamaged heritage sitesForeign involvementHuman rights violationsHumanitarian aidInternational demonstrations and protestsInternational reactionsMassacresMass gravesRefugeesSectarianism and minoritiesStatus of the Golan HeightsSpillover in LebanonSyrian government reactions"
            ],
            [
                "Peace process",
                "Arab League monitorsFriends of Syria GroupKofi Annan peace planUN supervision missionLakhdar Brahimi peace planU.S.–Russia peace proposals39th G8 summitUN Security Council Resolution 2118Geneva II conference2015 Zabadani cease-fire agreementVienna talks2016 Geneva talksIdlib demilitarization (2018–present)First Northern Syria Demilitarization DealSecond Northern Syria Demilitarization DealSyrian Negotiation CommissionSyrian Constitutional Committee"
            ],
            [
                "Investigations/legal cases",
                "InvestigationsInternational CommissionChemical weaponsWar crimes casesGermanyCanada + Netherlands vs Syria"
            ],
            [
                "Related topics",
                "Exclusive mandateFourth Extraordinary Session of the Islamic Summit ConferenceSyria FilesSyrian detainee reportSyrian media coverage2015 European migrant crisisSyrian civil war in popular culture"
            ]
        ]
    },
    {
        "heading": "References",
        "table": [
            [
                "Issues",
                "CasualtiesCities and townsChemical weaponsDamaged heritage sitesForeign involvementHuman rights violationsHumanitarian aidInternational demonstrations and protestsInternational reactionsMassacresMass gravesRefugeesSectarianism and minoritiesStatus of the Golan HeightsSpillover in LebanonSyrian government reactions"
            ],
            [
                "Peace process",
                "Arab League monitorsFriends of Syria GroupKofi Annan peace planUN supervision missionLakhdar Brahimi peace planU.S.–Russia peace proposals39th G8 summitUN Security Council Resolution 2118Geneva II conference2015 Zabadani cease-fire agreementVienna talks2016 Geneva talksIdlib demilitarization (2018–present)First Northern Syria Demilitarization DealSecond Northern Syria Demilitarization DealSyrian Negotiation CommissionSyrian Constitutional Committee"
            ],
            [
                "Investigations/legal cases",
                "InvestigationsInternational CommissionChemical weaponsWar crimes casesGermanyCanada + Netherlands vs Syria"
            ],
            [
                "Related topics",
                "Exclusive mandateFourth Extraordinary Session of the Islamic Summit ConferenceSyria FilesSyrian detainee reportSyrian media coverage2015 European migrant crisisSyrian civil war in popular culture"
            ]
        ]
    },
    {
        "heading": "References",
        "table": [
            [
                "Iraq5,861 refugees as of 2015Iraqi Kurdistan239,955 refugees as of 2015Jordan628,427 refugeesLebanon1,196,560 refugees as of 2015Refugees inTurkey3,614,108 (registered as of 2018)Al-Obaidi1,519Arbat5,878Basirma3,661Darashakran9,809Domiz 143,235Domiz 25,810Gawilan6,131Kawergosk10,215MoqeblehunknownQushtapa6,285Azraq17,738Mrajeeb Al Fhood5,366Zaatari83,501Sabra and Shatila10,000-22,000Ain al-Hilweh50,000Kilis Oncupinar14,000Islahiye refugee campK.Maras refugee campOsmaniye refugee campNizip refugee campKarkamis refugee campAkcakale refugee campCeylanpinar-Telhamut refugee camp",
                "Iraq5,861 refugees as of 2015",
                "Iraqi Kurdistan239,955 refugees as of 2015",
                "Jordan628,427 refugees",
                "Lebanon1,196,560 refugees as of 2015",
                "Refugees inTurkey3,614,108 (registered as of 2018)",
                "Al-Obaidi1,519",
                "Al-Obaidi",
                "1,519",
                "Arbat5,878Basirma3,661Darashakran9,809Domiz 143,235Domiz 25,810Gawilan6,131Kawergosk10,215MoqeblehunknownQushtapa6,285",
                "Arbat",
                "5,878",
                "Basirma",
                "3,661",
                "Darashakran",
                "9,809",
                "Domiz 1",
                "43,235",
                "Domiz 2",
                "5,810",
                "Gawilan",
                "6,131",
                "Kawergosk",
                "10,215",
                "Moqebleh",
                "unknown",
                "Qushtapa",
                "6,285",
                "Azraq17,738Mrajeeb Al Fhood5,366Zaatari83,501",
                "Azraq",
                "17,738",
                "Mrajeeb Al Fhood",
                "5,366",
                "Zaatari",
                "83,501",
                "Sabra and Shatila10,000-22,000Ain al-Hilweh50,000",
                "Sabra and Shatila",
                "10,000-22,000",
                "Ain al-Hilweh",
                "50,000",
                "Kilis Oncupinar14,000Islahiye refugee campK.Maras refugee campOsmaniye refugee campNizip refugee campKarkamis refugee campAkcakale refugee campCeylanpinar-Telhamut refugee camp",
                "Kilis Oncupinar",
                "14,000",
                "Islahiye refugee camp",
                "",
                "K.Maras refugee camp",
                "",
                "Osmaniye refugee camp",
                "",
                "Nizip refugee camp",
                "",
                "Karkamis refugee camp",
                "",
                "Akcakale refugee camp",
                "",
                "Ceylanpinar-Telhamut refugee camp",
                ""
            ],
            [
                "Iraq5,861 refugees as of 2015",
                "Iraqi Kurdistan239,955 refugees as of 2015",
                "Jordan628,427 refugees",
                "Lebanon1,196,560 refugees as of 2015",
                "Refugees inTurkey3,614,108 (registered as of 2018)"
            ],
            [
                "Al-Obaidi1,519",
                "Al-Obaidi",
                "1,519",
                "Arbat5,878Basirma3,661Darashakran9,809Domiz 143,235Domiz 25,810Gawilan6,131Kawergosk10,215MoqeblehunknownQushtapa6,285",
                "Arbat",
                "5,878",
                "Basirma",
                "3,661",
                "Darashakran",
                "9,809",
                "Domiz 1",
                "43,235",
                "Domiz 2",
                "5,810",
                "Gawilan",
                "6,131",
                "Kawergosk",
                "10,215",
                "Moqebleh",
                "unknown",
                "Qushtapa",
                "6,285",
                "Azraq17,738Mrajeeb Al Fhood5,366Zaatari83,501",
                "Azraq",
                "17,738",
                "Mrajeeb Al Fhood",
                "5,366",
                "Zaatari",
                "83,501",
                "Sabra and Shatila10,000-22,000Ain al-Hilweh50,000",
                "Sabra and Shatila",
                "10,000-22,000",
                "Ain al-Hilweh",
                "50,000",
                "Kilis Oncupinar14,000Islahiye refugee campK.Maras refugee campOsmaniye refugee campNizip refugee campKarkamis refugee campAkcakale refugee campCeylanpinar-Telhamut refugee camp",
                "Kilis Oncupinar",
                "14,000",
                "Islahiye refugee camp",
                "",
                "K.Maras refugee camp",
                "",
                "Osmaniye refugee camp",
                "",
                "Nizip refugee camp",
                "",
                "Karkamis refugee camp",
                "",
                "Akcakale refugee camp",
                "",
                "Ceylanpinar-Telhamut refugee camp",
                ""
            ],
            [
                "Al-Obaidi",
                "1,519"
            ],
            [
                "Arbat",
                "5,878"
            ],
            [
                "Basirma",
                "3,661"
            ],
            [
                "Darashakran",
                "9,809"
            ],
            [
                "Domiz 1",
                "43,235"
            ],
            [
                "Domiz 2",
                "5,810"
            ],
            [
                "Gawilan",
                "6,131"
            ],
            [
                "Kawergosk",
                "10,215"
            ],
            [
                "Moqebleh",
                "unknown"
            ],
            [
                "Qushtapa",
                "6,285"
            ],
            [
                "Azraq",
                "17,738"
            ],
            [
                "Mrajeeb Al Fhood",
                "5,366"
            ],
            [
                "Zaatari",
                "83,501"
            ],
            [
                "Sabra and Shatila",
                "10,000-22,000"
            ],
            [
                "Ain al-Hilweh",
                "50,000"
            ],
            [
                "Kilis Oncupinar",
                "14,000"
            ],
            [
                "Islahiye refugee camp",
                ""
            ],
            [
                "K.Maras refugee camp",
                ""
            ],
            [
                "Osmaniye refugee camp",
                ""
            ],
            [
                "Nizip refugee camp",
                ""
            ],
            [
                "Karkamis refugee camp",
                ""
            ],
            [
                "Akcakale refugee camp",
                ""
            ],
            [
                "Ceylanpinar-Telhamut refugee camp",
                ""
            ]
        ]
    },
    {
        "heading": "References",
        "table": [
            [
                "Al-Obaidi1,519",
                "Al-Obaidi",
                "1,519",
                "Arbat5,878Basirma3,661Darashakran9,809Domiz 143,235Domiz 25,810Gawilan6,131Kawergosk10,215MoqeblehunknownQushtapa6,285",
                "Arbat",
                "5,878",
                "Basirma",
                "3,661",
                "Darashakran",
                "9,809",
                "Domiz 1",
                "43,235",
                "Domiz 2",
                "5,810",
                "Gawilan",
                "6,131",
                "Kawergosk",
                "10,215",
                "Moqebleh",
                "unknown",
                "Qushtapa",
                "6,285",
                "Azraq17,738Mrajeeb Al Fhood5,366Zaatari83,501",
                "Azraq",
                "17,738",
                "Mrajeeb Al Fhood",
                "5,366",
                "Zaatari",
                "83,501",
                "Sabra and Shatila10,000-22,000Ain al-Hilweh50,000",
                "Sabra and Shatila",
                "10,000-22,000",
                "Ain al-Hilweh",
                "50,000",
                "Kilis Oncupinar14,000Islahiye refugee campK.Maras refugee campOsmaniye refugee campNizip refugee campKarkamis refugee campAkcakale refugee campCeylanpinar-Telhamut refugee camp",
                "Kilis Oncupinar",
                "14,000",
                "Islahiye refugee camp",
                "",
                "K.Maras refugee camp",
                "",
                "Osmaniye refugee camp",
                "",
                "Nizip refugee camp",
                "",
                "Karkamis refugee camp",
                "",
                "Akcakale refugee camp",
                "",
                "Ceylanpinar-Telhamut refugee camp",
                ""
            ],
            [
                "Al-Obaidi",
                "1,519"
            ],
            [
                "Arbat",
                "5,878"
            ],
            [
                "Basirma",
                "3,661"
            ],
            [
                "Darashakran",
                "9,809"
            ],
            [
                "Domiz 1",
                "43,235"
            ],
            [
                "Domiz 2",
                "5,810"
            ],
            [
                "Gawilan",
                "6,131"
            ],
            [
                "Kawergosk",
                "10,215"
            ],
            [
                "Moqebleh",
                "unknown"
            ],
            [
                "Qushtapa",
                "6,285"
            ],
            [
                "Azraq",
                "17,738"
            ],
            [
                "Mrajeeb Al Fhood",
                "5,366"
            ],
            [
                "Zaatari",
                "83,501"
            ],
            [
                "Sabra and Shatila",
                "10,000-22,000"
            ],
            [
                "Ain al-Hilweh",
                "50,000"
            ],
            [
                "Kilis Oncupinar",
                "14,000"
            ],
            [
                "Islahiye refugee camp",
                ""
            ],
            [
                "K.Maras refugee camp",
                ""
            ],
            [
                "Osmaniye refugee camp",
                ""
            ],
            [
                "Nizip refugee camp",
                ""
            ],
            [
                "Karkamis refugee camp",
                ""
            ],
            [
                "Akcakale refugee camp",
                ""
            ],
            [
                "Ceylanpinar-Telhamut refugee camp",
                ""
            ]
        ]
    },
    {
        "heading": "References",
        "table": [
            [
                "Basirma",
                "3,661"
            ],
            [
                "Darashakran",
                "9,809"
            ],
            [
                "Domiz 1",
                "43,235"
            ],
            [
                "Domiz 2",
                "5,810"
            ],
            [
                "Gawilan",
                "6,131"
            ],
            [
                "Kawergosk",
                "10,215"
            ],
            [
                "Moqebleh",
                "unknown"
            ],
            [
                "Qushtapa",
                "6,285"
            ]
        ]
    },
    {
        "heading": "References",
        "table": [
            [
                "Mrajeeb Al Fhood",
                "5,366"
            ],
            [
                "Zaatari",
                "83,501"
            ]
        ]
    },
    {
        "heading": "References",
        "table": [
            [
                "Ain al-Hilweh",
                "50,000"
            ]
        ]
    },
    {
        "heading": "References",
        "table": [
            [
                "Islahiye refugee camp",
                ""
            ],
            [
                "K.Maras refugee camp",
                ""
            ],
            [
                "Osmaniye refugee camp",
                ""
            ],
            [
                "Nizip refugee camp",
                ""
            ],
            [
                "Karkamis refugee camp",
                ""
            ],
            [
                "Akcakale refugee camp",
                ""
            ],
            [
                "Ceylanpinar-Telhamut refugee camp",
                ""
            ]
        ]
    }
]