[
    {
        "url": "https://en.wikipedia.org/wiki/Zalando"
    },
    {
        "heading": "Zalando",
        "table": [
            [
                "Headquarters in Berlin"
            ],
            [
                "Company type",
                "Public(Societas Europaea)"
            ],
            [
                "Traded as",
                "FWB:ZALDAXcomponent"
            ],
            [
                "ISIN",
                "DE000ZAL1111"
            ],
            [
                "Industry",
                "E-commerce"
            ],
            [
                "Founded",
                "October 2008; 16 years ago(2008-10)"
            ],
            [
                "Founders",
                "Robert GentzDavid Schneider"
            ],
            [
                "Headquarters",
                "Berlin, Germany"
            ],
            [
                "Area served",
                "Europe"
            ],
            [
                "Key people",
                "Robert Gentz (co-CEO)David Schröder (co-CEO)"
            ],
            [
                "Services",
                "Online shopping"
            ],
            [
                "Revenue",
                "€10.6 billion (2024)[1]"
            ],
            [
                "Operating income",
                "€392 million (2024)[1]"
            ],
            [
                "Net income",
                "€251 million (2024)[1]"
            ],
            [
                "Total assets",
                "€7.98 billion (2024)[2]"
            ],
            [
                "Total equity",
                "€2.67 billion (2024)[2]"
            ],
            [
                "Owners",
                "Baillie Gifford & Co(11.20%)Anders Holch Povlsen(10.09%)Blackrock(5.35%)T. Rowe Price(5.22%)Founders(5.13%)The Vanguard Group(4.99%)Allianz Global Investors(4.95%)Morgan Stanley(4.87%)AKO Capital(3.15%)Generation Investment Management(2.67%)Treasury shares(1.32%)Other shareholders (41.07%)[3]"
            ],
            [
                "Number of employees",
                "15,309 (2024)[4]"
            ],
            [
                "Subsidiaries",
                "Zalando Lounge GmbH, Zalando Payments GmbH, Zalando Marketing Services GmbH, Zalando Stores GmbH & Co. KG, Zalando Studios Berlin GmbH & Co. KG, Tradebyte Software GmbH, Anatwine Limited, Fision AG"
            ],
            [
                "Website",
                "zalando.com"
            ]
        ]
    },
    {
        "heading": "Zalando",
        "paragraphs": [
            "Zalando SEis a publicly traded international online retailer based in Berlin which is active across Europe and specializes in shoes, fashion and beauty products. The company was founded in 2008 by David Schneider and Robert Gentz and has more than 51 million active users in 25 European markets.",
            "Zalando is active in a variety of business fields – from multi-brand online shopping (including their own brands), the shopping club Lounge by Zalando, outlets in 12 German cities, as well as logistics and marketing offers for retailers. In 2022, Zalando generated revenue of 10.3 billion Euro, with roughly 16,000 employees."
        ]
    },
    {
        "heading": "History",
        "paragraphs": [
            "Zalando was founded in 2008 by Robert Gentz and David Schneider in Berlin with investment capital from the threeSamwer brothers. Gentz, Schneider and Oliver Samwer met each other through their studies atWHU – Otto Beisheim School of Management.",
            "Inspired by US online retailerZappos, Zalando initially specialized in the sale of footwear. The name of the company was derived from the Spanish word for shoes (zapatos). ",
            "In 2010, the company launched in the Netherlands and France and added apparel to its portfolio. In 2011, it opened online retail sites in the UK, Italy, and Switzerland. In the following year, Zalando expanded to Sweden, Denmark, Finland, Norway, Belgium, Spain, and Poland. In 2012, Zalando began operating outside of Germany offering deliveries to Austria.",
            "Since 2013, following examples of tech companies from the East, especiallyChina, Zalando transitioned into a European digital platform. Emulating Chinese companies, Zalando set off into remaking itself into a digital shopping mall, allowing fashion houses and retailers to make sales via the Partner Program as well, often with limited input from Zalando. ",
            "In 2014, Zalando was listed on theFrankfurt Stock Exchange. Since 22 June 2015, Zalando has been included in theMDAX. In 2015, Zalando started collaborating withTopshopand began selling merchandise online. Advertisements featuring modelCara Delevingnewere broadcast in Germany, Switzerland, and France. ",
            "In June 2015, the fashion trade fair \"Bread & Butter\" was acquired by Zalando, with the intention to open the globally important event to a broader audience as a \"fashion festival\". The first edition of \"Bread & Butter by Zalando\" took place in 2016, hosting 20,000 visitors atArena Berlin. Zalando announced the discontinuation of \"Bread & Butter\" due to a shift in strategy two years later. ",
            "In March 2017, Zalando acquired Kickz, a German company, for an unknown sum. At the time, Kickz owned 15 shops across Germany, all specializing in basketball footwear. ",
            "In 2018, Zalando launched Beauty in Germany, Poland, and Austria and opened a beauty concept store in Berlin offering a regularly changing range of beauty products. ",
            "In February 2018, Zalando expanded its collaboration with physical retailers in Germany. ",
            "In June 2018, Zalando expanded its operations to Ireland and Czechia. The markets are served over the existing logistic sites of Zalando. ",
            "In October 2020, a Germanworks councilwith 31 members was elected for the first time at Zalando. ",
            "In December 2020, co-CEO Rubin Ritter announced that he would be stepping down next year, two years before the end of his contract, to allow his wife to pursue her professional ambitions. ",
            "In June 2021, the company announced that it would give all of its 14,500 workers an extra 5 days off work in August, in recognition of their work throughout the coronavirus pandemic. ",
            "In September 2021, the DAX was expanded to 40 companies, with Zalando becoming part of the DAX.",
            "In November 2022, Zalando discontinued its standalone resale app, Zircle. The pre-owned category on its platform will continue to allow customers to sell and buy second-hand fashion from each other. ",
            "On theESGandsustainable fashionfront for 2023, the company is one year ahead of its schedule to reduce Scope 1 and Scope 2 emissions by 80% by 2025, reaching 78%. The target to reduce emissions from private-label products by 40% by the same deadline is also already exceeded, with reductions of 43% already achieved in 2023. Work with partners is also progressing well: by 2025, 90% must setscience-based targets(SBTs) related to emissions reductions. At the moment, 64% meet this request (72% of the target has been achieved). 9,925 people have already participated in Zalando's educational programmes out of the planned 10,000.\nHowever, with the planned complete phase-out ofsingle-use plasticpackaging by 2023, the average amount of single-use plastic packaging per product is 7.4 grams. Also, the life of only 6.3 million products (12% of the planned) has been extended so far, and the share of sustainable (made fromrecycled, organic and natural fabrics) products in the assortment has so far reached only 10.5% of the 25% planned. ",
            "In March 2024, the company announced a share buyback of up to 100 million euros ($109 million) and the opening of its logistics platform (logistics network, software and related services) to work with other companies. Meanwhile, the platform may also work with other categories besides fashion. ",
            "In 2025 Zalando adjusted its return policy, reducing the time between purchase and a free return from 100 to 30 days for customers in Germany, the Netherlands and Italy. In April 2025 Zalando announced a change in the terms of service, to allow an estimated 0,02 percent of its customer base, who have been identified to abuse the return system, to be banned from making new orders for one year. "
        ]
    },
    {
        "heading": "Geographical presence",
        "paragraphs": [
            "The company operates in the following countries: Germany, Austria, Switzerland, France, Belgium, the Netherlands, Italy, Spain, Poland, Sweden, Denmark, Finland, Norway, Estonia, Slovenia, Ireland, Luxembourg, Czechia, Slovakia, Croatia, the United Kingdom, Lithuania, Latvia, Hungary and Romania. "
        ]
    },
    {
        "heading": "United Kingdom",
        "paragraphs": [
            "In 2011, Zalando launched Zalando.co.uk, thereby offering its retail services to UK customers. Deliveries were operated by YODEL. In the same year, theE-commerceplatform launched a TV ad in English, replicating the humorous format used in its German-language commercials. In it, a long-suffering husband bemoans his wife's addiction to buying shoes and warns other men about the dangers of introducing women to Zalando.",
            "In 2015, Zalando acquired a 20% stake in Cheltenham-based software company Anatwine, headed by a former e-commerce director of SuperGroup, for a seven-figure sum. Anatwine's software – which helps online fashion retailers and brands integrate their processes, systems, and stock files – will enable current and future clothing and accessory brand clients to use Anatwine's technology to sell their merchandise through Zalando. Zalando is expected to speedily widen Anatwine's range of brands. "
        ]
    },
    {
        "heading": "Central and Eastern Europe (CEE)",
        "paragraphs": [
            "On 2 June 2021, Zalando launched its new online platform in Slovenia, Lithuania, and Slovakia. The company was said to be targeting a bigger stake in the European fashion market. ",
            "\"For us, the launch of our platform in the three countries is a major step toward being the starting point for Fashion in Europe and opening up the Zalando universe to even more customers\", Lisa Miczaika, Zalando's vice president for Central Europe said.",
            "Zalando expanded to Croatia, Estonia, and Latvia in 2021, and to Hungary and Romania in 2022.  "
        ]
    },
    {
        "heading": "Business figures",
        "table": [
            {
                "Year": "2010",
                "Revenue (€ bn)": "0.15",
                "Net profit/loss (€ m)": "−20",
                "Number ofemployees": "",
                "Sources": "[31][32]"
            },
            {
                "Year": "2011",
                "Revenue (€ bn)": "0.51",
                "Net profit/loss (€ m)": "−60",
                "Number ofemployees": "",
                "Sources": ""
            },
            {
                "Year": "2012",
                "Revenue (€ bn)": "1.1",
                "Net profit/loss (€ m)": "−90",
                "Number ofemployees": "",
                "Sources": ""
            },
            {
                "Year": "2013",
                "Revenue (€ bn)": "1.8",
                "Net profit/loss (€ m)": "−120",
                "Number ofemployees": "",
                "Sources": "[33][34]"
            },
            {
                "Year": "2014",
                "Revenue (€ bn)": "2.2",
                "Net profit/loss (€ m)": "82",
                "Number ofemployees": "7,588",
                "Sources": "[35]"
            },
            {
                "Year": "2015",
                "Revenue (€ bn)": "2.9",
                "Net profit/loss (€ m)": "107",
                "Number ofemployees": "9,987",
                "Sources": "[36]"
            },
            {
                "Year": "2016",
                "Revenue (€ bn)": "3.6",
                "Net profit/loss (€ m)": "216",
                "Number ofemployees": "11,998",
                "Sources": "[37]"
            },
            {
                "Year": "2017",
                "Revenue (€ bn)": "4.4",
                "Net profit/loss (€ m)": "215",
                "Number ofemployees": "15,091",
                "Sources": "[38]"
            },
            {
                "Year": "2018",
                "Revenue (€ bn)": "5.3",
                "Net profit/loss (€ m)": "173",
                "Number ofemployees": "15,619",
                "Sources": "[39]"
            },
            {
                "Year": "2019",
                "Revenue (€ bn)": "6.4",
                "Net profit/loss (€ m)": "225",
                "Number ofemployees": "13,763",
                "Sources": "[40]"
            },
            {
                "Year": "2020",
                "Revenue (€ bn)": "7.9",
                "Net profit/loss (€ m)": "421",
                "Number ofemployees": "14,194",
                "Sources": "[41]"
            },
            {
                "Year": "2021",
                "Revenue (€ bn)": "10.3",
                "Net profit/loss (€ m)": "235",
                "Number ofemployees": "17,043",
                "Sources": ""
            },
            {
                "Year": "2022",
                "Revenue (€ bn)": "10.3",
                "Net profit/loss (€ m)": "17",
                "Number ofemployees": "16,999",
                "Sources": ""
            },
            {
                "Year": "2023",
                "Revenue (€ bn)": "10.1",
                "Net profit/loss (€ m)": "83",
                "Number ofemployees": "15,793",
                "Sources": ""
            },
            {
                "Year": "2024",
                "Revenue (€ bn)": "10.5",
                "Net profit/loss (€ m)": "251",
                "Number ofemployees": "15,309",
                "Sources": ""
            }
        ]
    },
    {
        "heading": "Business figures",
        "paragraphs": [
            "Zalando was accumulating losses ever since it was founded until it started making a profit in 2014. The most important cost factors for Zalando are fulfilment and marketing costs, both taking up 50% of total revenues alone without the costs of sales included, with marketing costs as high as 25% in 2010. Zalando managed to become profitable for the first time in 2014, which was due to cost management and sales in their additional markets. Almost 50% of sales revenues are generated in Germany, Austria, and Switzerland which is defined as one geographic unit under \"DACH\".",
            "In 2021, the company was said to be targeting a gross merchandise volume (GMV) of over €30bn by 2025, and in the long term wants to take more than 10% of the €450bn European fashion market. ",
            "The key trends for Zalando are (as at the financial year ending December 31): "
        ]
    },
    {
        "heading": "Controversies",
        "paragraphs": [
            "The German newspaper Bild reported on statements of the German Federal Economic Ministry indicating that from 2007 to 2012 Zalando received around 3.3 millioneuroin subsidies from regional development programs. Zalando also requested subsidies for 2013. The Deutsche Mittelstandsnachrichten reported that the Samwer brothers’ business model is predicated on using foreign capital and cheap labour to quickly build up a company, selling it as fast as possible.",
            "In July 2012, German TV channelZDFbroadcast a report on the packing and distribution centre operated for Zalando by a provider near Berlin. The report showed the appalling working conditions at the company providing logistical services to Zalando. In the logistical center of Großbeeren certain staff,  who often commute more than 200 km per day from nearby Poland, are not allowed to sit down during their working day. It was further shown that employees were subject to continuous scrutiny, work space was extremely confined, and for several hundreds of employees there was only one filthy toilet container. The ZDF also criticized the hourly wage of €7,01, which was nonetheless in conformity with the minimum hourly wages for agency workers in Germany. Following the ZDF report, it was revealed that Zalando had also received a 22,5 million euro subsidy from the government of Thüringen to build new headquarters. According to a ZDF reporter who went undercover, around 40 employees are being paid by the taxpayer between seven and nine days every month in the framework of apprenticeship programs, while one-third of the employees are agency workers. Following the report, Zalando announced that it would scrutinize its service providers more strictly.",
            "In April 2014, RTL broadcast the documentaryUnrelenting pressure in the workplace(Arbeiten unter Dauerdruck), which had been made with the support of undercover journalist Günter Wallraff. The documentary led to renewed criticism on the labour conditions at Zalando. Journalist Caro Lobig worked undercover for three months as an order picker in the logistical center at Erfurt. During an eight-hour shift she had to walk up to 27 kilometres (17 mi). After five weeks she started to suffer from circulation problems. According to an anonymous employee working at the ambulance service, there is hardly a day when they are not called to the logistics center. According to a labour judge interviewed by RTL, Zalando violates German Labour law because of its rules on breaks, by prohibiting its employees from sitting down and by imposing airport-security-type measures on its employees. Through its tight control over its employees, Zalando would also be in violation of privacy rules. RTL requested Zalando to give comments to the allegations but Zalando refused. Instead, Zalando filed a complaint against Lobig for revealing corporate secrets. Lobig in turn filed a complaint against the company regarding her severance pay. ",
            "In November 2015, theCentre for Protection against Unfair Competitionin Germany filed a suit claiming that Zalando misled consumers on the availability of certain products suggesting that they needed to act fast to buy them. Zalando said that they had already changed their marketing practices, taking the centre's concerns into account. They claimed that they no longer informed consumers that there were \"three items available\" when more than three were available. "
        ]
    },
    {
        "heading": "External links",
        "table": [
            {
                "vteDAXcompanies ofGermany": "AdidasAirbusAllianzBASFBayerBeiersdorfBMWBrenntagCommerzbankContinentalCovestroDaimler TruckDeutsche BankDeutsche BörseDeutsche TelekomDHL GroupE.ONFreseniusHannover RückHeidelberg MaterialsHenkelInfineon TechnologiesMercedes-BenzMerckMTU Aero EnginesMunich RePorsche AGPorsche SEQiagenRWERheinmetallSAPSartoriusSiemensSiemens EnergySiemens HealthineersSymriseVolkswagenVonoviaZalando"
            }
        ]
    },
    {
        "heading": "External links",
        "table": [
            [
                "International",
                "VIAF"
            ],
            [
                "National",
                "Germany"
            ]
        ]
    }
]