[
    {
        "url": "https://en.wikipedia.org/wiki/Adidas"
    },
    {
        "heading": "Adidas",
        "paragraphs": [
            "Adidas AG(German pronunciation:[ˈʔadiˌdas]ⓘ; stylized inall lowercasesince 1949)is a German athletic apparel and footwearcorporationheadquartered inHerzogenaurach, Bavaria, Germany. It is the largestsportswearmanufacturer inEurope, and the second largest in the world, afterNike.It is theholding companyfor theAdidas Group, which also owns an 8.33% stake of the football clubBayern Munich,andRuntastic, an Austrian fitness technology company. Adidas's revenue for 2024 was listed at €23.683billion.",
            "The company was started byAdolf Dasslerin his mother's house. He was joined by his elder brotherRudolfin 1924 under the nameGebrüder Dassler Schuhfabrik(\"Dassler Brothers Shoe Factory\"). Dassler assisted in the development of spiked running shoes (spikes) for multiple athletic events. To enhance the quality of spiked athletic footwear, he transitioned from a previous model of heavy metal spikes to utilising canvas and rubber. Dassler persuaded U.S. sprinterJesse Owensto use his handmade spikes at the1936 Summer Olympics. In 1949, following a breakdown in the relationship between the brothers, Adolf created Adidas and Rudolf establishedPuma, which became Adidas's business rival.",
            "Thethree stripesare Adidas's identity mark, having been used on the company's clothing and shoe designs as a marketing aid. The branding, which Adidas bought in 1952 from Finnish sports companyKarhu Sportsfor the equivalent of €1,600 and two bottles of whiskey,became so successful that Dassler described Adidas as \"The three stripes company\"."
        ]
    },
    {
        "heading": "Early years: the \"Gebrüder Dassler Schuhfabrik\"",
        "paragraphs": [
            "The company was founded byAdolf \"Adi\" Dasslerwho made sports shoes in his mother'ssculleryor laundry room inHerzogenaurach, Germany after his return fromWorld War I. In July 1924, his older brotherRudolfjoined the business, which became \"Dassler Brothers Shoe Factory\" (Gebrüder Dassler Schuhfabrik).The electricity supply in Herzogenaurach was unreliable, so the brothers sometimes had to use pedal power from a stationary bicycle to run their equipment.",
            "Dassler assisted in the development ofspiked running shoes(spikes) for multiple athletic events. To enhance the quality of spiked athletic footwear, he transitioned from a previous model of heavy metal spikes to utilising canvas and rubber.In 1936, Dassler persuaded U.S.sprinterJesse Owensto use his hand made spikes at the1936 Summer Olympics. Following Owens' four gold medals, the name and reputation of Dassler shoes became known to the world's sportsmen and their trainers. Business was successful and the Dasslers were selling 200,000 pairs of shoes every year beforeWorld War II.",
            "Both Dassler brothers joined the Nazi Party (NSDAP) in May 1933 and became members of theNational Socialist Motor Corps.Adolf took the rank ofSportwartin theHitler Youthfrom 1935 until the end of the war.During the war, the company was running the last sport shoe factory in Germany and predominantly supplied theWehrmachtwith shoes. In 1943, their shoe production was forced to cease operations and the company's facilities and workforce was used to manufactureanti-tank weapons. From 1942 to 1945, at least nineforced labourerswere working at both sites of the company.",
            "The Dassler factory, used for production ofanti-tank weaponsduring World War II, was nearly destroyed in 1945 by US forces. It was spared when Adolf Dassler's wife convinced the American soldiers that the company and its employees were only interested in manufacturing sports shoes. American occupying forces subsequently became major buyers of the Dassler brothers' shoes."
        ]
    },
    {
        "heading": "Split and rivalry with Puma",
        "paragraphs": [
            "Thebrothers split upin 1947 after relations between them had broken down,with Adolf forming a company registered as Adidas AG, fromAdi Dassler, on 18 August 1949, and Rudolf forming a new firm that he called Ruda – fromRudolf Dassler, later rebrandedPuma.Urban mythshave popularised two falsebackronymsfor the name \"Adidas\":All Day I Dream About SportsandAll Day I Dream About Sex.",
            "Adidas andPuma SEentered into a fierce and bitter business rivalry after the split. The town ofHerzogenaurachwas divided on the issue, leading to the nickname \"the town of bent necks\"—people looked down to see which shoes strangers wore.Even the town's twofootball clubswere divided:ASV Herzogenaurachclub was supported by Adidas, while1 FC Herzogenaurachendorsed Rudolf's footwear.When handymen were called to Rudolf's home, they would deliberately wear Adidas shoes. Rudolf would tell them to go to the basement and pick out a pair of free Pumas.The two brothers never reconciled and although they are now buried in the same cemetery, they are spaced as far apart as possible.",
            "In 1948, the first football match afterWorld War II, several members of theWest Germany national football teamwore Puma boots, including the scorer of West Germany's first post-war goal,Herbert Burdenski. Four years later, at the1952 Summer Olympics,1500 metresrunnerJosy BarthelofLuxembourgwon Puma's first Olympic gold inHelsinki, Finland.",
            "At the1960 Summer Olympics, Puma paid German sprinterArmin Haryto wear Pumas in the 100 meter sprint final. Hary had worn Adidas before and asked Adolf for payment, but Adidas rejected this request. The German won gold in Pumas, but then laced up Adidas for the medals ceremony, to the shock of the two Dassler brothers. Hary hoped to cash in from both, but Adi was so enraged he banned the Olympic champion.",
            "The \"Pelé Pact\" was the most notable event in the Dassler brothers feud, when both owners of Adidas and Puma agreed not to sign a sponsorship deal withPeléfor the1970 FIFA World Cup, feeling that a bidding war for the most famous athlete in the world would become too expensive, only for Puma to break the pact and sign him.Many business experts credit the brothers' rivalry and competition for transforming sports apparel into a multi-billion pound industry."
        ]
    },
    {
        "heading": "Corporate image",
        "paragraphs": [
            "In 1952, following the1952 Summer Olympics, Adidas acquired its signature 3-stripe logo from the Finnish athletic footwear brandKarhu Sports, for two bottles of whiskey and the equivalent of €1600.",
            "The Trefoil logo was designed in 1971 and launched in 1972,just in time for the1972 Summer Olympicsheld inMunich.This logo lasted until 1997, when the company introduced the \"three bars\" logo (that had been designed by then Creative Director Peter Moore), initially used on theEquipmentrange of products."
        ]
    },
    {
        "heading": "Tapie affair",
        "paragraphs": [
            "After a period of trouble following the death of Adolf Dassler's sonHorst Dasslerin 1987, the company was bought in 1990 by French industrialistBernard Tapie, for₣1.6billion(now €243.9 million), which Tapie borrowed.Tapie was at the time a famous specialist of rescuing bankrupt companies, an expertise on which he built his fortune.",
            "Tapie decided to move productionoffshoreto Asia. He also hiredMadonnafor promotion.He sent, fromChristchurch, New Zealand, a shoe sales representative to Germany and met Adolf Dassler's descendants (Amelia Randall Dassler and Bella Beck Dassler) and was sent back with a few items to promote the company there.",
            "In 1992, unable to pay the loan interest, Tapie mandated theCrédit Lyonnaisbank to sell Adidas,and the bank subsequently converted the outstanding debt owed intoequityof the enterprise, which was unusual as per the prevalent French banking practice. Thestate-ownedbank had tried to get Tapie out of dire financial straits as a personal favour to Tapie, it is reported, because Tapie wasMinisterof Urban Affairs (ministre de la Ville) in the French government at the time.",
            "Robert Louis-Dreyfus, a friend of Tapie, became the new CEO of the company in 1994. He was also the president ofOlympique de Marseille, a team Tapie had owned until 1993.Tapie filed for personal bankruptcy in 1994.He was the object of several lawsuits, notably related tomatch fixingat the football club. During 1997, he served 6 months of an 18-month prison sentence inLa Santéprison in Paris. In February 2000, Crédit Lyonnais sold Adidas to Louis-Dreyfus for a much higher amount of money than Tapie owed, 4.485 billion (€683.514 million) francs rather than 2.85 billion (€434.479 million)."
        ]
    },
    {
        "heading": "Post-Tapie era",
        "paragraphs": [
            "In 1994, combined withFIFAYouth Group,SOS Children's Villagesbecame the main beneficiary.",
            "In 1997, Adidas AG acquired theSalomon Groupwho specialized in ski wear, and its official corporate name was changed to Adidas-Salomon AG. With this acquisition Adidas also acquired theTaylorMadegolf company andMaxfli, which allowed them to compete withNikeGolf.",
            "In 1998, Adidas sued theNCAAover their rules limiting the size and number of commercial logos on team uniforms and team clothing. Adidas withdrew the suit, and the two groups established guidelines as to what three-stripe designs would be considered uses of the Adidas trademark.",
            "As CEO of Adidas, Louis-Dreyfus quadrupled revenue to €5.84 billion ($7.5 billion) from 1993 through 2000.In 2000, he announced he would resign the following year, due to illness.",
            "In 2003, Adidas filed a lawsuit in a British court challenging Fitness World Trading's use of a two-stripe motif similar to Adidas'sthree stripes. The court ruled that despite the simplicity of the mark,Fitness World's use was infringing because the public could establish a link between that use and Adidas's mark.",
            "In September 2004, English fashion designerStella McCartneylaunched a joint-venture line with Adidas, establishing a long-term partnership with the corporation. This line is a sports performance collection for women called \"Adidas by Stella McCartney\".",
            "On 3 May 2005, Adidas informed the public that they had sold their partner companySalomon Groupfor €485 million toAmer Sportsof Finland.",
            "In August 2005, Adidas declared its intention to buyReebokfor $3.8 billion (US$). This takeover was completed with partnership in January 2006and meant that the company had business sales closer to those ofNikein North America. The acquisition of Reebok also allowed Adidas to compete with Nike worldwide as the number two athletic shoemaker in the world.",
            "In 2005, Adidas introduced theAdidas 1, the first ever production shoe to use amicroprocessor. Dubbed by the company \"The World's First Intelligent Shoe\", it features a microprocessor capable of performing 5 million calculations per second that automatically adjusts the shoe's level of cushioning to suit its environment. The shoe requires a small, user-replaceable battery that lasts for approximately 100 hours of running. On 25 November 2005, Adidas released a new version of the Adidas 1 with an increased range of cushioning, allowing the shoe to become softer or firmer, and a new motor with 153 percent more torque.",
            "In April 2006, Adidas announced an 11-year deal to become the officialNBAclothing provider. The company has been makingNBA,NBDL, andWNBAjerseys and products as well as team-coloured versions of the \"Superstar\" basketball shoe. This deal (worth over $400 million) took over the previous Reebok deal that had been put in place in 2001 for 10 years.",
            "In November 2011, Adidas announced that it would acquire outdoor action sport performance brandFive Tenthrough a share purchase agreement. The total purchase price was US$25 million in cash at closing."
        ]
    },
    {
        "heading": "Recent years",
        "paragraphs": [
            "By the end of 2012, Adidas was reporting their highest revenues ever and Chief Executive Herbert Hainer expressed optimism for the year ahead. Adidas now has global corporate headquarters inHerzogenaurach, Germany and many other business locations around the world such asLondon,Portland,Toronto,Tokyo,Australia,TaiwanandSpain.",
            "In January 2015, Adidas launched the footwear industry's first reservation mobile app. The Adidas Confirmed app allows consumers to get access to and reserve the brand's limited edition sneakers by using geo targeting technology.",
            "On 24 March 2015, Adidas and McDonald's unveiled the 2015 McDonald's All-American uniforms. For the third year in a row, players will be wearing short-sleeved jerseys, made with the same lightweight and breathable material as the ones used in the NBA.",
            "In August 2015, Adidas acquired fitness technology firmRuntasticfor approximately $240 million.",
            "In May 2017, Adidas soldTaylorMadegolf company (includingAshworth) to KPS Capital Partners for $425 million.",
            "In March 2022, Adidas sold Reebok to theAuthentic Brands Group,for ca. $2.5 billion.",
            "In August 2022, the company announced that CEO Kasper Rørsted would step down in 2023.Bjørn Gulden became CEO in January 2023."
        ]
    },
    {
        "heading": "Business trends",
        "paragraphs": [
            "The key trends for Adidas are (as at the financial year ending December 31):"
        ]
    },
    {
        "heading": "Apparel",
        "paragraphs": [
            "Adidas manufactures a range ofclothingitems, varying from men's and women'st-shirts,jackets,hoodies,pantsandleggings.",
            "The first Adidas item of apparel was theFranz Beckenbauertracksuit created in 1967.Adidas AG is the largest manufacturer of sports bras in Europe, and the second largest manufacturer in the world."
        ]
    },
    {
        "heading": "Sportswear",
        "paragraphs": [
            "One of the main focuses of Adidas has always beenfootball kits, and the associated equipment. Adidas remains a major company in the global supply of team kits for international association football teams and clubs.",
            "Adidas makesrefereekits that are used in international competition and by many countries and leagues in the world. The company has been an innovator in the area of footwear for the sport, with notable examples including the 1979 release of theCopa Mundialmoulded boot used for matches on firm dry pitches. It holds the accolade of the best selling boot of all time. The soft-ground equivalent was named World Cup and it too remains on the market.",
            "Since 1970,FIFA, the world governing body of football, has commissionedspecially designedfootballsfor use in its ownWorld Cuptournaments. TheAdidas Telstarwas the first ball commissioned for the World Cup in 1970. The balls supplied for the2006 World Cup, the \"Teamgeist\", were particularly noteworthy for their ability to travel further than previous types when struck, leading to longer range goals. Goalkeepers were generally believed to be less comfortable with the design of the ball, claiming it was prone to move significantly and unpredictably in flight.",
            "Adidas introduced theJabulanifor the2010 World Cup. The ball was designed and developed byLoughborough Universityin conjunction withBayern München. TheAdidas Brazucafor the2014 World Cupwas the first World Cup ball named by the fans.In 2022, for the 14th time in a row, Adidas created the2022 World Cupball,Al Rihla.",
            "Adidas is one of the official sponsors of theUEFA Champions League, and theAdidas Finaleis the competition's official match ball.Along with the aforementionedAdidas Predatorboot, Adidas manufactures theadiPurerange of football boots. Adidas named an official match ball of theUEFA Euro 2016tournament theAdidas Beau Jeuwhich translates to \"The Beautiful Game\" in English.Adidas provides clothing and equipment for all teams inMajor League Soccer.",
            "Adidas has also provided baseball equipment and sponsors numerous players ofMajor League BaseballandNippon Professional Baseballin Japan.",
            "Adidas Baseball hardgoods are licensed to Dick's Sporting Goods.",
            "From 1997 to 2008, Adidas sponsored theNew York Yankees.",
            "Adidas's Superstar and Pro Model shoes, affectionately known as \"shelltoes\" for their stylized hard rubber toe box, were fueled by, among others, coaches such asUCLA'sJohn Wooden.Adidas drew about even withConversein basketball by the mid-1970s before both started to fall behind then-upstartNikein the early 1980s.Subsequently, Adidas Superstar became very popular in the 1980ship hop streetwearscene alongside Adidas's stripe-sided polyester suits.",
            "From 2006 to 2017, Adidas was the uniform supplier of all the 30 teams in theNational Basketball Association, replacing theReebokbrand after Adidas's acquisition of Reebok. Adidas was replaced by Nike as the official uniform supplier of the league after the 2016–17 season.",
            "Adidas began manufacturing cricket footwear in the mid-1970s, with their initial target market being Australia. Their shoes were a radical departure from traditional leather cricket boots which had remained basically unchanged for decades, being lighter and more flexible but also offering less toe protection, so that it became not uncommon to see batsmen who had been struck by the ball on the foot hopping around in pain. Having continued to manufacture cricket footwear for many years, in 2006 the company finally entered the field of bat manufacture in 2008 and currently their bat range includes the Pellara, Incurza, Libro and M-Blaster models.",
            "In the 1990s, Adidas signed the superstar Indian batsmanSachin Tendulkarand made shoes for him.From 2008 until his retirement, Adidas had sponsored the cricket bat used by Tendulkar. It created a new bat, 'Adidas MasterBlaster Elite', personalized for him.",
            "In 2008, Adidas made a concerted move into English cricket market by sponsoring English batting starKevin Pietersenafter the cancellation of his lifetime deal with Woodworm, when they ran into financial difficulties.The following year they signed up fellow England playerIan Bell,Pakistanopening batsmanSalman Buttand Indian PlayerRavindra Jadeja.",
            "In theIndian Premier League(IPL), Adidas sponsored the teamMumbai Indiansfrom 2008 to 2014 andDelhi Daredevilsfrom 2008 to 2013.They were the official sponsors ofPune Warriors Indiain 2011 and 2012, however the team was banned from IPL due to payment issues. In the 2015 Season, Adidas sponsoredRoyal Challengers Bangalore.",
            "In 2023 Adidas sponsoredIndian national cricket teamas a Sportswear for men's and women's.",
            "In January 2025, it was announced thatFormula OneteamMercedesentered a multi-year partnership with Adidas.",
            "Adidas Golfmanufactures golf clothing, footwear, and accessories. Men's and women's equipment includes footwear, shirts, shorts, pants, outerwear (wind suits), base layer and eyewear.",
            "From 2000 to 2012, Adidas has provided men's and women's gymnastics wear forTeam USA, throughUSA Gymnastics. USA Gymnastics and Adidas sponsorship concluded at the end of 2012. In 2006, Adidas gymnastics leotards for women and Adidas men's competition shirts, gymnastics pants and gymnastics shorts have been available in the United States, with seasonal leotards offered for Spring, Summer, Fall and Holidays. Adidas previous collaborated with GK Elite, since Spring 2013, Adidas gymnastics products have been available worldwide through Elegant Sports. USA Olympic team membersMcKayla Maroney,Jordyn Wieber,Jake DaltonandDanell Leyvaare all sponsored by Adidas gymnastics.",
            "Adidas provided uniforms for theNational Hockey Leaguefrom the2017–18 seasonuntil the2023–24 season.",
            "In 2007, Adidas announced its entering to thelacrosseequipment, also sponsoring the Adidas National Lacrosse Classic in July 2008 for the top 600 high school underclassmen players in the United States.The company made their self into their own brand such as \"Adidas Lacrosse\", getting several scholarships, Bucknell (men and women), Bryant (men), Delaware (men and women), New Jersey Institute of Technology (men), and D3 powerhouse Lynchburg (men and women in fall of 2016 with soft good only)\". Materials that Adidas provided were jerseys, shorts, shoes, shafts, heads, gloves, and protective pieces.",
            "Products manufactured for the sport aresticks, gloves, protective gear and boots.",
            "Adidas currently manufactures several running and lifestyle shoes, including the Energy-boost, and the spring-blade trainers.[needs update]The brand has built a strong runners' network within big European capitals, such as Paris' \"Boost Energy League\". In 2016, the 3rd season launched. In Paris, the Boost Energy League gathers 11 teams representing different districts of Paris.",
            "Adidas launched two new color ways of the NMD R1 and one new color way of the NMD XR1 in September 2016.",
            "In November 2016, Adidas teased a sneaker made fromocean plastic. The shoe is created from a fabric called \"Biosteel\". The shoe is called the \"Adidas Futurecraft Biofabric\". The material used is 15% lighter than conventional silk fibers, and is 100% biodegradable. The shoe only begin to dissolve when it is put in contact with a high concentration of the digestion enzyme proteinase, which occurs naturally. Once this happens, the shoes can decompose within 36 hours. The shoe was never released.",
            "Adidas EQT is a style of sneakers from Adidas. It originated in the early 1990s and was relaunched in 2017. The latest Adidas EQT line released in a \"Turbo Red\" Pack on 26 January 2017, and included models such as the Adidas EQT Support 93/17, EQT Support ADV, and EQT Support Ultra. Adidas.com is one of the few online retailers.",
            "Adidas Skateboarding producesshoes made specifically for skateboarding, including the redesign of previous models for skateboarding. The brand also releases signature models designed by team riders.",
            "Adidas has been involved with tennis equipment since the mid-1960s and has historically sponsored many top tennis players, beginning with two of the most dominant male tennis players at the start of the professional era in the late 1960s,Stan SmithandIlie Nastase. During the 1980s and 1990s, not only were they exclusive apparel and footwear sponsors of world number one men's tennis playersIvan LendlandStefan Edbergand ladies' world number oneSteffi Graf, but each player had their own, exclusive graphic styles designed for their use during play, which were in turn marketed to the general public.",
            "Ivan Lendl even spent the vast majority of his dominant career playing with several different models of Adidas tennis racquets, primarily using the Adidas GTX-Pro and then later the Adidas GTX Pro-T. In 2009, the company introduced a new line of tennisracquets. While the Feather was made for the \"regular player\", and the Response for the \"club player\", Adidas targeted the \"tournament player\" with the 12.2 oz Barricade tour model.",
            "Adidas enteredKabaddiwhich is still a non-Olympic sport but highly popular in the Indian subcontinent and Asian countries. In 2014, with the launch ofPro Kabaddi Leaguea city based franchise league in India, Kabaddi took the region by storm. In 2015, they tied up with Mumbai-based franchiseU Mumba."
        ]
    },
    {
        "heading": "Accessories",
        "paragraphs": [
            "Adidas also designs and makesslide-style sandals, mobile accessories,watches,eyewear, bags,baseball caps, andsocks. As well, Adidas has a branded range of male and femaledeodorants,perfumes,aftershaveandlotions.",
            "Adidas announced they would be launching a new $199 Fit Smart wristband in mid-August 2014. The wristband will pair with Adidas's miCoach app, which acts as a personal trainer.",
            "Adilettewas the first ever pair ofsandalsmade by Adidas, originally developed in 1963.Adidas claims that a group of athletes approachedAdi Dasslerrequesting a shoe be made for the locker room. To this day, the resulting sandals are a best-seller.Since the original navy blue and white Adilette sandals were created nearly fifty years ago, more varieties have been created in different colours (black, red, green, grey, orange, brown, yellow, pink, golden, silver).",
            "Most recently, Adidas has introduced a colour scheme that goes along with its Predator and adizero line; the scheme is dubbed warning (orange) and purple. Usually, the three stripes appear in the contrasting colour on the strap of the classic models. The most common Adilette livery is in navy blue or black, mixed with white colours. Also the Woodilette and Trefoil models follow a similar design but without stripes on the strap.",
            "The model provides a contoured orthopedic rubber sole with synthetic upper, and was designed as an after sportslide sandal, but the Adilette were quickly adopted outside of the sporting world.",
            "Adissageis also a slide sandal. Available in black, navy, light blue, black with pink, and other assorted colors, the sandal has the trademarked three stripes on avelcrostrap toward the front of the shoe. On the side of the shoe, toward the heel on either side, the manufacturers name appears, as well as on a round emblem in the actual heel of the footbed. Notably, there are tiny black massage nubs throughout the foot-bed for the purpose of massaging foot aches after sport, although popular as a casual sandal amongst non-athletes as well.",
            "TheSantiossageis aslide-style sandal. The sandal has the trademarked three stripes on a velcro strap toward the front of the shoe.Santiossagecomes in black, navy, or red. On the side of the shoe, toward the heel on either side, the manufacturer's name appears, as well as on a round emblem in the actual heel of the foot-bed. Like the Adissage there are tiny clear massage nubs throughout the foot-bed for the purpose of massaging after-sport footaches, although the sandals are worn casually among non-athletes. Seen through these clear nubs are Adidas's three stripes."
        ]
    },
    {
        "heading": "Marketing",
        "paragraphs": [
            "During the mid to late 1990s, Adidas divided the brand into three main groups with each a separate focus:Adidas Performancewas designed to maintain their devotion to the athlete;Adidas Originalswas designed to focus on the brand's earlier designs which remained a popular life-style icon; andStyle Essentials, which dealt with the fashion market; the main group within this beingY-3(which is a collaboration between Adidas and renowned Japanese fashion designerYohji Yamamoto- the Y representing Yamamoto and the 3 representing the three stripes of Adidas).",
            "Launched in 2004,\"Impossible is Nothing\"is one of the company's most memorable campaigns.The campaign was developed by 180/TBWA based in Amsterdam, but significant work was also done byTBWAChiatDayin San Francisco.A few years later, Adidas launched a basketball specific campaign -- \"Believe in 5ive\"—for the 2006-2007 NBA season.",
            "In 2011,\"Adidas is all in\"became the global marketing strategy slogan for Adidas. The slogan aimed to tie all brands and labels together, presenting a unified image to consumers interested in sports, fashion, street, music and pop culture. There appears to be connection with the phrase \"all-in\" meaning \"exhausted\" in some English speaking nations.",
            "In 2015, Adidas launched \"Creating the New\" as its strategic business plan until 2020."
        ]
    },
    {
        "heading": "Collaborations",
        "paragraphs": [
            "Adidas has done several collaborations with well known designers, includingAlexander Wang,Jeremy Scott,Raf Simons, andStella McCartney. They have also reached out to several celebrities, such asBeyoncé,Jonah Hill,Karlie Kloss,Ninja,Bad Bunny, andPharrell Williamsto create some of the company's most notable and coveted pieces."
        ]
    },
    {
        "heading": "Game advertisement",
        "paragraphs": [
            "The brand is featured in several games, includingDaley Thompson's Olympic Challenge(Commodore Amiga),Adidas power soccer(Sony PlayStation) andAdidas Championship Football(Commodore 64,ZX spectrum,Amstrad CPC)."
        ]
    },
    {
        "heading": "Marketing in India",
        "paragraphs": [
            "India has been a very speculative market for Adidas.[why?]Despite this Dave Thomas, managing director of Adidas in India is ambitious for the country's potential.The company hoped to double its revenue from Rs. 805 crores by 2020.In 2015, the company signedRanveer Singha Bollywood actor as a brand ambassador to the company's products.Singhthen was a budding actor. The company later decided to use the Indian people's passion for the game of cricket to promote their brand and launched a new cricket campaign in the country.The campaign was called FeelLoveUseHate with Indian cricketer Virat Kohli.However, in 2017, Virat Kohli was removed as the brand ambassador of the company.The cricketer later signed a major deal with Puma India.The company also sells its products online through e-commerce websites such as Myntra, Snapdeal, Jabong and Amazon. Adidas also has a website dedicated to the Indian audience that markets and sells products to its consumers in India."
        ]
    },
    {
        "heading": "Marketing in Russia",
        "paragraphs": [
            "Adidas provided outfits for the Soviet Union's team in the1980 Summer Olympics, making them one of the first global brands to enter the territory.TheCommunist Partyprohibited the usage of the company logo on Soviet tracksuits, changing the design from three stripes to one red stripe. The shoes remained unchanged, as the three stripes resembled an \"M\", hinting that the Olympics were held inMoscow. The brand later became a staple of theGopniksubculture."
        ]
    },
    {
        "heading": "Sponsorship",
        "paragraphs": [
            "Adidas has numerous major kit deals with football clubs worldwide, including their main sponsorBayern Munich.Moreover, their sponsored national teams includeGermany,Spain,Mexico,Argentina,Sweden,Japan,Hungary,Belgium,Colombia,Wales,ChileandItaly.",
            "Adidas has sponsored numerous players, includingLionel Messi,Zinedine Zidane,Kaká,David Beckham,Steven Gerrard,Gareth Bale,Thomas Müller,Xavi,James Rodríguez,Iker Casillas,Arjen Robben,Paul Pogba,Luis Suárez,George Weah,Alessandro Del Piero,Son Heung-min,Mohamed SalahandJude Bellingham.",
            "Adidas is one of the official sponsors of theUEFA Champions League, and theAdidas Finaleis the competition's official match ball.Along with theAdidas Predatorboot, Adidas manufactures theadiPurerange of football boots. Adidas provides clothing and equipment for all teams inMajor League Soccer(MLS).",
            "In July 2014, Adidas andManchester Unitedagreed to a ten-year kit deal, beginning with the2015–16 Premier League season. This kit deal has a guaranteed minimum value of £750 million (US$1.29 billion), making it the most valuable kit deal in sports history, and replaced rivalNikeas the club's global equipment partner.",
            "In November 2009, World Number 4 tennis playerAndy Murraywas confirmed as Adidas's highest-paid star with a five-year contract reportedly worth US$24.5 million.InCincinnati, at theATP Tennis Tournamentin Mason, they have also sponsored theball-boy and ball-girluniforms. Adidas is also partners with Malibu Tennis Camp, Green Fitness GmbH and with Schöler & Micke Sportartikel Vertriebs GmbH.",
            "Adidas has sponsored numerous basketball players likeKareem Abdul-Jabbar(first ever NBA player signed with Adidas and first ever player overall with signature shoes),Chauncey Billups,Tim Duncan,Brandon Knight,Jeremy Lin,Tracy McGrady,Iman Shumpertand present players likeJames Harden,Damian Lillard,Donovan Mitchell,Candace Parker,Derrick Rose,John WallandTrae Young. Adidas also endorsedKobe Bryantwith the Adidas Equipment KB8 as his first signature shoe until July 2002.The company also endorsedKevin Garnettuntil he opted out of his contract in 2010.Gilbert Arenaswas an Adidas endorser until 2010.In August 2015,James Hardenleft Nike for Adidas by signing a 13-year contract reportedly worth US$200 million.",
            "Inrugby union, Adidas is the current kit supplier to theAll Blacks, theFrance national team, theItalian national rugby teamand the South AfricanStormersandWestern Provincerugby union teams among others. Adidas is also theNew Zealand Rugby Unionclothing sponsor and supplies clothing to allSuper Rugbyfranchises up till 2022,a selection of domestic teams and national referees. Adidas are also the official match ball supplier to theHeineken Cup. Adidas was theBritish and Irish Lionskit supplier from 1997 to 2013. They are the jersey manufacturers of theGold Coast TitansRugby League club in the AustralasianNational Rugby League. Dual rugby and league international and former boxerSonny Bill Williamsis a global ambassador for Adidas.",
            "Adidas has providedfield hockeyequipment and sponsors numerous players of Germany, England, Netherlands, Australia, Spain and Belgium. The company has been the kit provider of Argentinewomen'sandmen'steams for over 15 years.The company also sponsored clubsReading,BeestonandEast Grinstead.",
            "Adidas also sponsorsprofessional golfersincludingCollin Morikawa,Ludvig Åberg,Nick Dunlap,Tyrrell Hatton,Daniel BergerandNick Taylor. Since Adidas does not make golf equipment the sponsorship is more limited to clothing and shoes.",
            "Inice hockey, Adidas signed an agreement withNational Hockey League(NHL) to be the official outfitter of uniforms and licensed apparel, starting in the2017–18 season, lasting through the2023–24 season.",
            "Adidas'scricketsponsorships include cricketersLasith Malinga,Kieron Pollard,Dwayne BravoandK. L. Rahul. Adidas's volleyball sponsorships includeIvan ZaytsevandEarvin N'Gapeth, who advertises as a model and brand ambassador for Adidas."
        ]
    },
    {
        "heading": "IP protection",
        "paragraphs": [
            "In 2016, Adidas filed lawsuits againstSkechersfor making a duplicateStan Smithdesign and for Adidas replicas such as \"Springblade\"."
        ]
    },
    {
        "heading": "Criticism",
        "paragraphs": [
            "Adidas's business practises/ethicsand commitment to worker welfare have been scrutinised and often criticised."
        ]
    },
    {
        "heading": "2011 All Blacks replica rugby jersey pricing",
        "paragraphs": [
            "Unhappy with the local price of the Adidas replica All Blacks jersey, New Zealand-basedAll Blacksfans asked for price cuts and began purchasing the jersey from overseas vendors after it was revealed that the local price of NZ$220 was more than twice the price offered on some websites.",
            "Adidas has responded by enforcing cross-border agreements to stop overseas retailers from selling to New Zealand residents. It has been labelled a public relations disaster by leading New Zealand PR firms[which?]and Consumer advocate groups. The largest New Zealand sportswear retailerRebel Sporthas stated[when?]it is angry and is considering selling the All Blacks Jerseys to the general public below cost."
        ]
    },
    {
        "heading": "2012 \"shackle\" sneakers",
        "paragraphs": [
            "On 14 June 2012, Adidas posted on their Facebook page a picture of a pair ofJeremy Scott-designed shoes containing shackles. The picture was of a planned shoe line that Adidas intended to release in July. The photo caused controversy.Jesse Jacksonwas quoted as saying: \"The attempt to commercialize and make popular more than 200 years of human degradation, where blacks were considered three-fifths human by our Constitution is offensive, appalling and insensitive\".Jackson threatened a boycott, and NBA commissionerDavid Sternwas at one point reportedly contacted in hopes that he would intervene.Shortly after the outcry, the company cancelled the product."
        ]
    },
    {
        "heading": "Sweatshops and labour standards",
        "paragraphs": [
            "Adidas has been criticized for operatingsweatshops, particularly in Indonesia. Between 2006 and 2007, Adidas rejected many of its suppliers that supported unions in favour of subcontractors with worse labour rights records.By subcontracting work to different suppliers, it is more difficult for Adidas to ensure company labour standards are enforced. Adidas's policy includes the freedom for workers to take part incollective bargainingand a non-retaliation policy towards workers who express concerns.[when?]In practice, however, many of Adidas's suppliers have not upheld these standards. At the Panarub factory inJava, 33 workers were fired after striking for better pay in 2005.",
            "PT Kizone is another Indonesian factory where Adidas has been criticized over treatment of workers. They produced products for Adidas as well asNikeand theDallas Cowboysuntil they closed in January 2011. 2,686 workers who were laid off are owed $3 million in severance pay and benefits. Nike has contributed $1.5 million but Adidas has not acted. A campaign has been initiated byUnited Students Against Sweatshopscalling for universities to cut contracts with Adidas.",
            "On 16 July 2012,War on Wantorganised activists in London to replace Adidas price tags in sports stores with 34p ones,a reference to the low hourly wage rate paid to the Indonesian workers who make Adidas goods.The campaign groupLabour Behind the Labelclaimed that the basic pay of Indonesian Adidas workers was only £10 a week. William Anderson, head of social and environmental affairs for the Asia Pacific region, posted an entry on the company blog in which he claimed that total wages including bonuses and overtime were often double the hourly wage, and drew attention topurchasing power parity.",
            "In April 2014, one of the biggest strikes on mainlandChinatook place at theYue Yuen Industrial HoldingsDongguan shoe factory, producing amongst others for Adidas.",
            "In 2022, researchers fromNordhausen University of Applied Sciencesidentified cotton fromXinjiangin Adidas shirts."
        ]
    },
    {
        "heading": "Soviet themed items, and advertising",
        "paragraphs": [
            "In 2018, Adidas promoted a line of Soviet themed items. After a social media outcry, they were taken off the market."
        ]
    },
    {
        "heading": "NCAA corruption scandal",
        "paragraphs": [
            "Adidas executive James Gatto was indicted in the2017 NCAA Division I men's basketball corruption scandal."
        ]
    },
    {
        "heading": "Racial diversity controversy",
        "paragraphs": [
            "In June 2020, the head of global human resources at Adidas, Karen Parkin, voluntarily stepped down after some black employees raised concerns about her failure to address racism and discrimination in the workplace.The former HR chief had also made a comment about racism being \"noise\", in addition to not adequately addressing workforce diversity.Upon her resignation, she made a statement saying that she supports the company's continued progress towards racial justice and offered an apology."
        ]
    },
    {
        "heading": "SL 72 sneaker advertising campaign",
        "paragraphs": [
            "In July 2024, Adidas withdrew and apologized for their advertising campaign starringBella Hadidfor theSL 72which was originally created for the1972 Munich Olympicswhere themassacreof 11 Israeli athletes took place."
        ]
    }
]