[
    {
        "url": "https://en.wikipedia.org/wiki/Just_Eat_Takeaway.com"
    },
    {
        "heading": "Just Eat Takeaway.com",
        "paragraphs": [
            "Just Eat Takeaway.comN.V.(formerlyTakeaway.com;[i]founded asThuisbezorgd.nl)[ii]is a Dutch multinationalonline food orderinganddeliverycompany, formed from themergerof London-basedJust Eatand Amsterdam-based Takeaway.com in 2020.",
            "Just Eat Takeaway.com is the parent company of food delivery brands including Takeaway.com, Lieferando, Thuisbezorgd.nl, Pyszne.pl, 10bis in Israel, and those acquired from Just Eat, includingSkipTheDishesandMenulog. Just Eat Takeaway operate various food ordering and delivery platforms in twenty countries,where customers can order food online from restaurants' menus, and have it delivered by restaurant or companycouriersdirectly to their home or workplace using an app or website.The company also partners withIFoodinBrazilandColombia.",
            "Following clearance by the United Kingdom'sCompetition and Markets Authorityon 23 April 2020, Takeaway.com merged with UK-based food delivery service Just Eat, with Takeaway.com acquiring all of Just Eat's shares.It is listed onEuronext Amsterdamand was listed on theLondon Stock Exchangeuntil November 2024.",
            "In February 2025, it was announced Just Eat Takeaway.com would be acquired by Dutch-based investment firmProsus, which also partly owns rival German food delivery serviceDelivery Hero."
        ]
    },
    {
        "heading": "History",
        "paragraphs": [
            "Takeaway.com was created byJitse Groenin 2000 after he had a difficult time ordering food online from local restaurants. Initially, Groen wanted to deliver all kinds of consumer goods; however, he noticed thatfood deliverieswere subject to the most demand, and decided to make this the company's primary focus.",
            "In 2002, co-founder Ruben Eilander left Takeaway because the business was growing too slowly. According to Groen, in these early years, he was relying on hisstudent loansto keep himself financially afloat. Thanks tobroadband internetbecoming mainstream around 2003, the business started growing, and Groen left his studies to focus on the company.",
            "The company benefited from an investment of€13 million (US$16.7 million) from Prime Ventures—aventure capitalandgrowth equityfirm—in 2012.It began acceptingBitcoinin November 2013and benefited from another investment of €74 million (US$98.31 million) in aseries B-round led byMacquarie Capitaland Prime Ventures in 2014.It also launched a new logo in all of the countries countries where it operated.It then raised €328 million (US$363.06 million) from anIPO, valuing the company at €993 million (US$1.1 billion), in 2016.In August that year, it stopped doing business in the UK, selling its customer portfolio to rivalJust Eat.",
            "In 2017, in Belgium, local provider, Pizza.be, was rebrandedTakeaway.com.In 2018, the company increased thecommissionit charged for using the platform from 12% to 13%.In the same year, Takeaway.com acquiredIsraelifood delivery company 10bis (Hebrew:תן ביס) for €135 million (US$149.43 million),as well as local Bulgarian startup BGmenu.com, including its Romanian subsidiary Oliviera.ro;and in 2019 it acquired Lieferheld, Pizza.de, andFoodorafromDelivery Heroin Germany.",
            "In July 2019, Takeaway.com announced proposals to take overJust Eat.In January 2020, 80.4% of Just Eat shareholders approved Takeaway.com's acquisition deal.Although Just Eat became asubsidiaryof Takeaway.com on 3 February 2020, the BritishCompetition and Markets Authorityordered on the following day that no integration should take place and that the brands should be kept separate until their investigation is completed.On 23 April 2020, the Competition and Markets Authority announced that it was unconditionally approving Just Eat's merger with Takeaway.com.",
            "In June 2020, the company announced that it would acquire, in an all-stock transaction, US-basedGrubhub—valuing the deal at $7.3 billion.",
            "The company was reported to be in talks withProsusto sell its 33% stake, inherited from Just Eat, in Brazilian food delivery companyiFood, which operated inBrazilandColombia, in July 2020.The company already had a partnership with iFood in these two countries.It completed the sale of its stake in iFood to Prosus for €1.8 billion in August 2022.",
            "The company became the sponsors of theUEFA men's clubandwomen's competitionson 22 March 2021, after being awarded the first-ever sponsorship contract for theUEFA Euro 2020.",
            "In July 2021, the company announced it would acquire Slovak market leader Bistro.sk; the acquisition was completed in October 2021.",
            "The company withdrew from operations in Norway and Portugal in April 2022,and discontinued its operations in Romania in June 2022.",
            "In April 2022, following investor pressure, the company announced it was considering a full or partial sale of Grubhub.It confirmed the sale of Grubhub to restaurant chain Wonder Group Inc for $650m in November 2024.",
            "In November 2024, the company announced it would be delisting its shares from the London Stock Exchange, making Amsterdam, where it was headquartered, the sole location where its shares could be traded.",
            "The investment firm,Prosus, announced that it would acquire the company for €4.1 billion, in February 2025. Prosus, which also owned 25% of rival German serviceDelivery Hero, 4% of China'sMeituan, and 25% of India'sSwiggy, had originally planned to purchase UK-based Just Eat in 2019, to prevent the eventual merger of Just Eat and Takeaway.com."
        ]
    },
    {
        "heading": "Operations",
        "paragraphs": [
            "The company operates under different brand names in different countries."
        ]
    }
]