[
    {
        "url": "https://en.wikipedia.org/wiki/List_of_earthquakes_in_California"
    },
    {
        "heading": "List of earthquakes in California",
        "paragraphs": [
            "The earliest known earthquake in theU.S. stateofCaliforniawas documented in 1769 by the Spanish explorers and Catholic missionaries of thePortolá expeditionas they traveled northward fromSan Diegoalong theSanta Ana Rivernear the present site ofLos Angeles. Ship captains and other explorers also documented earthquakes. AsSpanish missionswere constructed beginning in the late 18th century, earthquake records were kept. After the missions weresecularizedin 1834, records were sparse until theCalifornia gold rushin the 1840s. From 1850 to 2004, there was about one potentially damaging event per year on average, though many of these did not cause serious consequences or loss of life.",
            "Since the three damaging earthquakes that occurred in theAmerican Midwestand theUnited States East Coast(1755 Cape Ann,1811–1812 New Madrid,1886 Charleston) were well known, it became apparent tosettlersthat the earthquake hazard was different in California. While the1812 San Juan Capistrano,1857 Fort Tejon, and1872 Owens Valleyshocks were in mostly unpopulated areas and only moderately destructive, the1868 Haywardevent affected the thrivingfinancial hubof theSan Francisco Bay Area, with damage fromSanta Rosain the north toSanta Cruzin the south. By this time, scientists were well aware of the threat, butseismologywas still in its infancy. Following destructive earthquakes in the late 19th and early 20th centuries,real estate developers,press, andboostersminimized and downplayed the risk of earthquakes out of fear that the ongoingeconomic boomwould be negatively affected.",
            "According to seismologistCharles Richter, the1906 San Francisco earthquakemoved theUnited States Governmentinto acknowledging the problem. Prior to that, no agency was specifically focused on researching earthquake activity. TheUnited States Weather Bureaudid record when they happened and severalUnited States Geological Surveyscientists had briefly disengaged from their regular duties of mappingmineralresources to write reports on the New Madrid and Charleston events, but no trained geologists were working on the problem until after 1906 when theUnited States Coast and Geodetic Surveywas made responsible. The outlook improved when ProfessorAndrew Lawsonbrought the state'sfirst monitoring programonline at theUniversity of California, Berkeleyin 1910 with seismologistHarry Wood, who was later instrumental in getting theCaltech Seismological LaboratoryinPasadenaoperational in the 1920s.",
            "Early developments at theCaltechlab included an earthquake observation network using their own custom-built short-periodseismometers, theRichter scale, and theModified Mercalli intensity scale(an updated version of the Mercalli intensity scale). In 1933, theLong Beach earthquakeoccurred in a populated area and damaged or destroyed many public school buildings in Long Beach and Los Angeles. Some decades later, theSan Fernando earthquakeaffected theSan Fernando Valleynorth of Los Angeles with heavy damage to several hospitals. In both cases, the perception of California policy makers changed, and state laws andbuilding codeswere modified (with much debate) to require commercial and residential properties to be built towithstand earthquakes. Higher standards were established for fire stations, hospitals, and schools, and construction of dwellings was also restricted nearactive faults."
        ]
    },
    {
        "heading": "Tectonic setting",
        "paragraphs": [
            "During thelast 66 million years, nearly the entire west coast of North America has been dominated by asubductionzone, with theFarallon platesubducting beneath theNorth American plate. Presently, theJuan de Fuca plate(with itsExplorerandGordasatellite plates) and theRiveraandCocos platesare the only remnants of the once much larger Farallon plate. The plate margin that remains in California is that of thestrike-slipSan Andreas Fault(SAF), thediffusePacific–North American plate boundary that extends east into theBasin and Range Provinceofeastern Californiaandwestern Nevada(a seismically active area calledWalker Lane) and southwest into the California Continental Borderland region off the central and southern coasts. This system offaultsterminates in the north at theMendocino triple junction, one of the most seismically active regions in the state, where earthquakes are occasionally the result ofintraplate deformationwithin the Gorda plate. It terminates in the south at theSalton Seawhere displacement transitions to a series ofspreading centersandtransform faults, beginning with theBrawley seismic zonein theImperial Valley.",
            "In theSan Francisco Bay Area, the San Andreas system of faults spans offshore and into the East Bay area, with the bulk of the faults lying to the east of the main San Andreas fault (SAF). There is a 70% probability that one of these faults will generate a 6.7 Mwor greater earthquake before 2030, including theHayward Fault Zone, which has gone beyond its averagereturn periodof 130 years (156 years ago as of May 2025). While the SAF is quiet north ofSan Francisco, the central SAF segment nearSan Juan Bautistais whereaseismic creepwas first studied, and to the south is where the recurringParkfield earthquakesoccur. The secondary faults lay to the west of the main SAF at the extreme southern portion, including the active and youngSan Jacinto Fault Zone, which may be taking over as the primary boundary south ofCajon Pass. Apaleoseismicinvestigation usingLidarrevealed that more than 16 feet (5 m) of slip has accumulated since the1857 eventon the southern SAF, which borders theMojave Desertto the north and east of the Greater Los Angeles Area. Near theTransverse Ranges,reverseandthrust faultshave produced damaging earthquakes inSanta Barbaraand theSan Fernando Valley."
        ]
    },
    {
        "heading": "References",
        "paragraphs": [
            "Sources"
        ]
    }
]